const articleMap = {
    170: {
        name: '①级生命宝石',
        gem: 101,
        value: 'life_max-10000',
        tips: '嵌入装备内可提升10000生命上限,也可合成更高级宝石。',
    },
    171: {
        gem: 102,
        name: '②级生命宝石',
        value: 'life_max-15000',
        tips: '嵌入装备内可提升15000生命上限,也可合成更高级宝石。',
    },
    172: {
        gem: 103,
        name: '③级生命宝石',
        value: 'life_max-20000',
        tips: '嵌入装备内可提升20000生命上限,也可合成更高级宝石。',
    },
    173: {
        gem: 104,
        name: '④级生命宝石',
        value: 'life_max-30000',
        tips: '嵌入装备内可提升30000生命上限,也可合成更高级宝石。',
    },
    174: {
        gem: 105,
        name: '⑤级生命宝石',
        value: 'life_max-50000',
        tips: '嵌入装备内可提升50000生命上限,也可合成更高级宝石。',
    },
    175: {
        gem: 106,
        name: '⑥级生命宝石',
        value: 'life_max-75000',
        tips: '嵌入装备内可提升75000生命上限,也可合成更高级宝石。',
    },
    176: {
        gem: 107,
        name: '⑦级生命宝石',
        value: 'life_max-100000',
        tips: '嵌入装备内可提升100000生命上限,也可合成更高级宝石。',
    },
    177: {
        gem: 108,
        name: '⑧级生命宝石',
        value: 'life_max-125000',
        tips: '嵌入装备内可提升125000生命上限,也可合成更高级宝石。',
    },
    178: {
        gem: 109,
        name: '⑨级生命宝石',
        value: 'life_max-150000',
        tips: '嵌入装备内可提升150000生命上限,也可合成更高级宝石。',
    },
    179: {
        gem: 1010,
        name: '⑩级生命宝石',
        value: 'life_max-200000',
        tips: '嵌入装备内可提升200000生命上限。',
    },
    1710: {
        gem: 111,
        name: '①级法力宝石',
        value: 'mana_max-10000',
        tips: '嵌入装备内可提升10000法力上限,也可合成更高级宝石。',
    },
    1711: {
        gem: 112,
        name: '②级法力宝石',
        value: 'mana_max-15000',
        tips: '嵌入装备内可提升15000法力上限,也可合成更高级宝石。',
    },
    1712: {
        gem: 113,
        name: '③级法力宝石',
        value: 'mana_max-20000',
        tips: '嵌入装备内可提升20000法力上限,也可合成更高级宝石。',
    },
    1713: {
        gem: 114,
        name: '④级法力宝石',
        value: 'mana_max-30000',
        tips: '嵌入装备内可提升30000法力上限,也可合成更高级宝石。',
    },
    1714: {
        gem: 115,
        name: '⑤级法力宝石',
        value: 'mana_max-50000',
        tips: '嵌入装备内可提升50000法力上限,也可合成更高级宝石。',
    },
    1715: {
        gem: 116,
        name: '⑥级法力宝石',
        value: 'mana_max-75000',
        tips: '嵌入装备内可提升75000法力上限,也可合成更高级宝石。',
    },
    1716: {
        gem: 117,
        name: '⑦级法力宝石',
        value: 'mana_max-100000',
        tips: '嵌入装备内可提升100000法力上限,也可合成更高级宝石。',
    },
    1717: {
        gem: 118,
        name: '⑧级法力宝石',
        value: 'mana_max-125000',
        tips: '嵌入装备内可提升125000法力上限,也可合成更高级宝石。',
    },
    1718: {
        gem: 119,
        name: '⑨级法力宝石',
        value: 'mana_max-150000',
        tips: '嵌入装备内可提升150000法力上限,也可合成更高级宝石。',
    },
    1719: {
        gem: 1110,
        name: '⑩级法力宝石',
        value: 'mana_max-200000',
        tips: '嵌入装备内可提升200000法力上限。',
    },
    1720: {
        gem: 123,
        name: '①级攻击宝石',
        value: 'atk-1000',
        tips: '嵌入装备内可提升1000攻击上限,也可合成更高级宝石。',
    },
    1721: {
        gem: 123,
        name: '②级攻击宝石',
        value: 'atk-1500',
        tips: '嵌入装备内可提升1500攻击上限,也可合成更高级宝石。',
    },
    1722: {
        gem: 123,
        name: '③级攻击宝石',
        value: 'atk-2000',
        tips: '嵌入装备内可提升2000攻击上限,也可合成更高级宝石。',
    },
    1723: {
        gem: 123,
        name: '④级攻击宝石',
        value: 'atk-3000',
        tips: '嵌入装备内可提升3000攻击上限,也可合成更高级宝石。',
    },
    1724: {
        gem: 123,
        name: '⑤级攻击宝石',
        value: 'atk-5000',
        tips: '嵌入装备内可提升5000攻击上限,也可合成更高级宝石。',
    },
    1725: {
        gem: 123,
        name: '⑥级攻击宝石',
        value: 'atk-7500',
        tips: '嵌入装备内可提升7500攻击上限,也可合成更高级宝石。',
    },
    1726: {
        gem: 123,
        name: '⑦级攻击宝石',
        value: 'atk-10000',
        tips: '嵌入装备内可提升10000攻击上限,也可合成更高级宝石。',
    },
    1727: {
        gem: 123,
        name: '⑧级攻击宝石',
        value: 'atk-12500',
        tips: '嵌入装备内可提升12500攻击上限,也可合成更高级宝石。',
    },
    1728: {
        gem: 123,
        name: '⑨级攻击宝石',
        value: 'atk-15000',
        tips: '嵌入装备内可提升15000攻击上限,也可合成更高级宝石。',
    },
    1729: {
        gem: 1210,
        name: '⑩级攻击宝石',
        value: 'atk-20000',
        tips: '嵌入装备内可提升20000攻击上限。',
    },
    1730: {
        gem: 131,
        name: '①级防御宝石',
        value: 'dfs-500',
        tips: '嵌入装备内可提升500防御上限,也可合成更高级宝石。',
    },
    1731: {
        gem: 132,
        name: '②级防御宝石',
        value: 'dfs-750',
        tips: '嵌入装备内可提升750防御上限,也可合成更高级宝石。',
    },
    1732: {
        gem: 133,
        name: '③级防御宝石',
        value: 'dfs-1000',
        tips: '嵌入装备内可提升1000防御上限,也可合成更高级宝石。',
    },
    1733: {
        gem: 134,
        name: '④级防御宝石',
        value: 'dfs-1500',
        tips: '嵌入装备内可提升1500防御上限,也可合成更高级宝石。',
    },
    1734: {
        gem: 135,
        name: '⑤级防御宝石',
        value: 'dfs-2500',
        tips: '嵌入装备内可提升2500防御上限,也可合成更高级宝石。',
    },
    1735: {
        gem: 136,
        name: '⑥级防御宝石',
        value: 'dfs-3750',
        tips: '嵌入装备内可提升3750防御上限,也可合成更高级宝石。',
    },
    1736: {
        gem: 137,
        name: '⑦级防御宝石',
        value: 'dfs-5000',
        tips: '嵌入装备内可提升5000防御上限,也可合成更高级宝石。',
    },
    1737: {
        gem: 138,
        name: '⑧级防御宝石',
        value: 'dfs-6250',
        tips: '嵌入装备内可提升6250防御上限,也可合成更高级宝石。',
    },
    1738: {
        gem: 139,
        name: '⑨级防御宝石',
        value: 'dfs-7500',
        tips: '嵌入装备内可提升7500防御上限,也可合成更高级宝石。',
    },
    1739: {
        gem: 1310,
        name: '⑩级防御宝石',
        value: 'dfs-10000',
        tips: '嵌入装备内可提升10000防御上限。',
    },
    1740: {
        gem: 161,
        name: '①级命中宝石',
        value: 'hit-100',
        tips: '嵌入装备内可提升100命中上限,也可合成更高级宝石。',
    },
    1741: {
        gem: 162,
        name: '②级命中宝石',
        value: 'hit-150',
        tips: '嵌入装备内可提升150命中上限,也可合成更高级宝石。',
    },
    1742: {
        gem: 163,
        name: '③级命中宝石',
        value: 'hit-200',
        tips: '嵌入装备内可提升200命中上限,也可合成更高级宝石。',
    },
    1743: {
        gem: 164,
        name: '④级命中宝石',
        value: 'hit-300',
        tips: '嵌入装备内可提升300命中上限,也可合成更高级宝石。',
    },
    1744: {
        gem: 165,
        name: '⑤级命中宝石',
        value: 'hit-500',
        tips: '嵌入装备内可提升500命中上限,也可合成更高级宝石。',
    },
    1745: {
        gem: 166,
        name: '⑥级命中宝石',
        value: 'hit-750',
        tips: '嵌入装备内可提升750命中上限,也可合成更高级宝石。',
    },
    1746: {
        gem: 167,
        name: '⑦级命中宝石',
        value: 'hit-1000',
        tips: '嵌入装备内可提升1000命中上限,也可合成更高级宝石。',
    },
    1747: {
        gem: 168,
        name: '⑧级命中宝石',
        value: 'hit-1250',
        tips: '嵌入装备内可提升1250命中上限,也可合成更高级宝石。',
    },
    1748: {
        gem: 169,
        name: '⑨级命中宝石',
        value: 'hit-1500',
        tips: '嵌入装备内可提升1500命中上限,也可合成更高级宝石。',
    },
    1749: {
        gem: 1610,
        name: '⑩级命中宝石',
        value: 'hit-2000',
        tips: '嵌入装备内可提升2000命中上限。',
    },
    1750: {
        gem: 151,
        name: '①级闪避宝石',
        value: 'dodge-100',
        tips: '嵌入装备内可提升100闪避上限,也可合成更高级宝石。',
    },
    1751: {
        gem: 152,
        name: '②级闪避宝石',
        value: 'dodge-150',
        tips: '嵌入装备内可提升150闪避上限,也可合成更高级宝石。',
    },
    1752: {
        gem: 153,
        name: '③级闪避宝石',
        value: 'dodge-200',
        tips: '嵌入装备内可提升200闪避上限,也可合成更高级宝石。',
    },
    1753: {
        gem: 154,
        name: '④级闪避宝石',
        value: 'dodge-300',
        tips: '嵌入装备内可提升300闪避上限,也可合成更高级宝石。',
    },
    1754: {
        gem: 155,
        name: '⑤级闪避宝石',
        value: 'dodge-500',
        tips: '嵌入装备内可提升500闪避上限,也可合成更高级宝石。',
    },
    1755: {
        gem: 156,
        name: '⑥级闪避宝石',
        value: 'dodge-750',
        tips: '嵌入装备内可提升750闪避上限,也可合成更高级宝石。',
    },
    1756: {
        gem: 157,
        name: '⑦级闪避宝石',
        value: 'dodge-1000',
        tips: '嵌入装备内可提升1000闪避上限,也可合成更高级宝石。',
    },
    1757: {
        gem: 158,
        name: '⑧级闪避宝石',
        value: 'dodge-1250',
        tips: '嵌入装备内可提升1250闪避上限,也可合成更高级宝石。',
    },
    1758: {
        gem: 159,
        name: '⑨级闪避宝石',
        value: 'dodge-1500',
        tips: '嵌入装备内可提升1500闪避上限,也可合成更高级宝石。',
    },
    1759: {
        gem: 1510,
        name: '⑩级闪避宝石',
        value: 'dodge-2000',
        tips: '嵌入装备内可提升2000闪避上限。',
    },
    1760: {
        gem: 161,
        name: '①级暴击宝石',
        value: 'sudden-100',
        tips: '嵌入装备内可提升100暴击上限,也可合成更高级宝石。',
    },
    1761: {
        gem: 162,
        name: '②级暴击宝石',
        value: 'sudden-150',
        tips: '嵌入装备内可提升150暴击上限,也可合成更高级宝石。',
    },
    1762: {
        gem: 163,
        name: '③级暴击宝石',
        value: 'sudden-200',
        tips: '嵌入装备内可提升200暴击上限,也可合成更高级宝石。',
    },
    1763: {
        gem: 164,
        name: '④级暴击宝石',
        value: 'sudden-300',
        tips: '嵌入装备内可提升300暴击上限,也可合成更高级宝石。',
    },
    1764: {
        gem: 165,
        name: '⑤级暴击宝石',
        value: 'sudden-500',
        tips: '嵌入装备内可提升500暴击上限,也可合成更高级宝石。',
    },
    1765: {
        gem: 166,
        name: '⑥级暴击宝石',
        value: 'sudden-750',
        tips: '嵌入装备内可提升750暴击上限,也可合成更高级宝石。',
    },
    1766: {
        gem: 167,
        name: '⑦级暴击宝石',
        value: 'sudden-1000',
        tips: '嵌入装备内可提升1000暴击上限,也可合成更高级宝石。',
    },
    1767: {
        gem: 168,
        name: '⑧级暴击宝石',
        value: 'sudden-1250',
        tips: '嵌入装备内可提升1250暴击上限,也可合成更高级宝石。',
    },
    1768: {
        gem: 169,
        name: '⑨级暴击宝石',
        value: 'sudden-1500',
        tips: '嵌入装备内可提升1500暴击上限,也可合成更高级宝石。',
    },
    1769: {
        gem: 1610,
        name: '⑩级暴击宝石',
        value: 'sudden-2000',
        tips: '嵌入装备内可提升2000暴击上限。',
    },
}

module.exports = {
    getArticleList: function () {
        return Object.keys(articleMap).map((id) => {
            const idNum = Number(id);
            return {
                ...articleMap[id],
                id: idNum,
            }
        })
    },
    getArticle: function (id) {
        if (!articleMap[id]) {
            console.log('未找到物品：', id);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}