const articleMap = {
    180: {
        n: '宠物技能卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物觉醒技能。',
    },
    181: {
        n: '宠物进化卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物提升资质。',
    },
    182: {
        n: '宠物转生卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物先天资质，每个宠物最多使用三次。',
    },
    183: {
        n: '宠物扩房卷',
        tips: '神奇的卷轴,可在宠物房中进行空间扩张。',
    },
    184: {
        n: '彩灵蛋',
        tips: '蕴含五系灵力的灵蛋，可用于兑换宠物。',
    },
    185: {
        n: '水灵蛋',
        tips: '蕴含水系灵力的灵蛋，可用于兑换宠物。',
    },
    186: {
        n: '火灵蛋',
        tips: '蕴含火系灵力的灵蛋，可用于兑换宠物。',
    },
    187: {
        n: '风灵蛋',
        tips: '蕴含风系灵力的灵蛋，可用于兑换宠物。',
    },
    188: {
        n: '雷灵蛋',
        tips: '蕴含雷系灵力的灵蛋，可用于兑换宠物。',
    },
    189: {
        n: '冰灵蛋',
        tips: '蕴含冰系灵力的灵蛋，可用于兑换宠物。',
    },
    1810: {
        n: '一元诀',
        tips: '可使技能等级提升到1级，3个一元诀可合成1个二气诀。',
    },
    1811: {
        n: '二气诀',
        tips: '可使技能等级提升到2级，3个二气诀可合成1个三才诀。',
    },
    1812: {
        n: '三才诀',
        tips: '可使技能等级提升到3级，3个三才诀可合成1个四象诀。',
    },
    1813: {
        n: '四象诀',
        tips: '可使技能等级提升到4级，3个四象诀可合成1个五行诀。',
    },
    1814: {
        n: '五行诀',
        tips: '可使技能等级提升到5级，3个五行诀可合成1个六合诀。',
    },
    1815: {
        n: '六合诀',
        tips: '可使技能等级提升到6级，3个六合诀可合成1个七星诀。',
    },
    1816: {
        n: '七星诀',
        tips: '可使技能等级提升到7级，3个七星诀可合成1个八卦诀。',
    },
    1817: {
        n: '八卦诀',
        tips: '可使技能等级提升到8级，3个八卦诀可合成1个九宫诀。',
    },
    1818: {
        n: '九宫诀',
        tips: '可使技能等级提升到9级，3个九宫诀可合成1个十重诀。',
    },
    1819: {
        n: '十重诀',
        tips: '可使技能等级提升到10级，3个十重诀可合成1个风云诀。',
    },
    1820: {
        n: '风云诀',
        tips: '可使技能等级提升到11级，3个风云诀可合成1个逍遥诀。',
    },
    1821: {
        n: '逍遥诀',
        tips: '可使技能等级提升到12级，3个逍遥诀可合成1个天地诀。',
    },
    1822: {
        n: '天地诀',
        tips: '可使技能等级提升到13级，3个天地诀可合成1个一转技能书。',
    },
    1823: {
        n: '一转技能书',
        tips: '可使技能突破至一转0级，3个一转技能书可合成1个二转技能书。',
    },
    1824: {
        n: '二转技能书',
        tips: '可使技能突破至二转0级，3个二转技能书可合成1个三转技能书。',
    },
    1825: {
        n: '三转技能书',
        tips: '可使技能突破至三转0级，3个三转技能书可合成1个四转技能书。',
    },
    1825: {
        n: '四转技能书',
        tips: '可使技能突破至四转0级，3个四转技能书可合成1个五转技能书。',
    },
    1827: {
        n: '五转技能书',
        tips: '可使技能突破至五转0级，并使技能可突破至20级，3个五转技能书可合成1个六转技能书。',
    },
    1828: {
        n: '六转技能书',
        tips: '可使技能突破至六转0级，并使技能可突破至50级，3个六转技能书可合成1个七转技能书。',
    },
    1829: {
        n: '七转技能书',
        tips: '可使技能突破至七转0级，并使技能可突破至100级。',
    },
    1830: {
        n: '初阶技能升级书',
        tips: '13级-30级的技能使用此技能继续提升等级,五本可合成一本中阶技能升级书。',
    },
    1831: {
        n: '中阶技能升级书',
        tips: '31级-50级的技能可使用此技能继续提升等级,五本可合成一本高阶技能升级书。',
    },
    1832: {
        n: '高阶技能升级书',
        tips: '50级以上的技能可使用此技能继续提升等级。',
    },
    1833: {
        n: '1级强化卡',
        tips: '装备强化卡,可使强化等级0的装备100%强化到1级，两个1级强化卡可合成2级强化卡。',
    },
    1834: {
        n: '2级强化卡',
        tips: '装备强化卡,可使强化等级1的装备100%强化到2级，两个2级强化卡可合成3级强化卡。',
    },
    1835: {
        n: '3级强化卡',
        tips: '装备强化卡,可使强化等级2的装备100%强化到3级，两个4级强化卡可合成4级强化卡。',
    },
    1836: {
        n: '4级强化卡',
        tips: '装备强化卡,可使强化等级3的装备100%强化到4级，两个4级强化卡可合成5级强化卡。',
    },
    1837: {
        n: '5级强化卡',
        tips: '装备强化卡,可使强化等级4的装备100%强化到5级，两个5级强化卡可合成6级强化卡。',
    },
    1838: {
        n: '6级强化卡',
        tips: '装备强化卡,可使强化等级5的装备100%强化到6级，两个5级强化卡可合成6级强化卡。',
    },
    1839: {
        n: '7级强化卡',
        tips: '装备强化卡,可使强化等级6的装备100%强化到7级，两个6级强化卡可合成7级强化卡。',
    },
    1840: {
        n: '8级强化卡',
        tips: '装备强化卡,可使强化等级7的装备100%强化到8级，两个8级强化卡可合成9级强化卡。',
    },
    1841: {
        n: '9级强化卡',
        tips: '装备强化卡,可使强化等级8的装备100%强化到9级，两个9级强化卡可合成10级强化卡。',
    },
    1842: {
        n: '10级强化卡',
        tips: '装备强化卡,可使强化等级9的装备100%强化到10级，两个10级强化卡可合成11级强化卡。',
    },
    1843: {
        n: '11级强化卡',
        tips: '装备强化卡,可使强化等级10的装备100%强化到11级，两个11级强化卡可合成12级强化卡。',
    },
    1844: {
        n: '12级强化卡',
        tips: '装备强化卡,可使强化等级11的装备100%强化到12级，两个12级强化卡可合成13级强化卡。',
    },
    1845: {
        n: '13级强化卡',
        tips: '装备强化卡,可使强化等级12的装备100%强化到13级，两个13级强化卡可合成14级强化卡。',
    },
    1846: {
        n: '14级强化卡',
        tips: '装备强化卡,可使强化等级13的装备100%强化到14级，两个14级强化卡可合成15级强化卡。',
    },
    1847: {
        n: '15级强化卡',
        tips: '装备强化卡,可使强化等级14的装备100%强化到15级，两个15级强化卡可合成16级强化卡。',
    },
    1848: {
        n: '16级强化卡',
        integral: 1314,
        tips: '装备强化卡,可使强化等级15的装备100%强化到16级。',
    },
    1849: {
        n: '一阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级星君,法皇，血煞职业的装备',
    },
    1850: {
        n: '二阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级法皇,星君,血煞职业的装备',
    },
    1851: {
        n: '三阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级法皇,星君,血煞职业的装备',
    },
    1852: {
        n: '顶阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级法皇,星君,血煞职业的装备',
    },
    1853: {
        n: '一阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级战尊,战神,战狂职业的装备',
    },
    1854: {
        n: '二阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级战尊,战神,战狂职业的装备',
    },
    1855: {
        n: '三阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级战尊,战神,战狂职业的装备',
    },
    1856: {
        n: '顶阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级战尊,战神,战狂职业的装备',
    },
    1857: {
        n: '一阶云石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级羽圣,剑仙,赤魅职业的装备',
    },
    1858: {
        n: '二阶云石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级羽圣,剑仙,赤魅职业的装备',
    },
    1859: {
        n: '三阶云石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级羽圣,剑仙,赤魅职业的装备',
    },
    1860: {
        n: '顶阶云石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级羽圣,剑仙,赤魅职业的装备',
    },
    1861: {
        n: '一阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的武器部位。',
    },
    1862: {
        n: '二阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的武器部位。',
    },
    1863: {
        n: '三阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的武器部位。',
    },
    1864: {
        n: '顶阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的武器部位。',
    },
    1865: {
        n: '一阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的头盔部位。',
    },
    1866: {
        n: '二阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的头盔部位。',
    },
    1867: {
        n: '三阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的头盔部位。',
    },
    1868: {
        n: '顶阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的头盔部位。',
    },
    1869: {
        n: '一阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的铠甲部位。',
    },
    1870: {
        n: '二阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的铠甲部位。',
    },
    1871: {
        n: '三阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的铠甲部位。',
    },
    1872: {
        n: '顶阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的铠甲部位。',
    },
    1873: {
        n: '一阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的腰带部位。',
    },
    1874: {
        n: '二阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的腰带部位。',
    },
    1875: {
        n: '三阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的腰带部位。',
    },
    1876: {
        n: '顶阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的腰带部位。',
    },
    1877: {
        n: '一阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的鞋子部位。',
    },
    1878: {
        n: '二阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的鞋子部位。',
    },
    1879: {
        n: '三阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的鞋子部位。',
    },
    1880: {
        n: '顶阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的鞋子部位。',
    },
    1881: {
        n: '一阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的戒指部位。',
    },
    1882: {
        n: '二阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的戒指部位。',
    },
    1883: {
        n: '三阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的戒指部位。',
    },
    1884: {
        n: '顶阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的戒指部位。',
    },
    1885: {
        n: '一阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的项链部位。',
    },
    1886: {
        n: '二阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的项链部位。',
    },
    1887: {
        n: '三阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的项链部位。',
    },
    1888: {
        n: '顶阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的项链部位。',
    },
    1889: {
        n: '一星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个一星魔符可合成1个二星魔符。',
    },
    1890: {
        n: '二星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个二星魔符可合成1个三星魔符。',
    },
    1891: {
        n: '三星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个三星魔符可合成1个四星魔符。',
    },
    1892: {
        n: '四星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个四星魔符可合成1个五星魔符。',
    },
    1893: {
        n: '五星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个五星魔符可合成1个六星魔符。',
    },
    1894: {
        n: '六星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个一六星魔符可合1一个七星魔符。',
    },
    1895: {
        n: '七星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个七星魔符可合成1个八星魔符。',
    },
    1896: {
        n: '八星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个八星魔符可合成1个九星魔符。',
    },
    1897: {
        n: '九星魔符',
        integral: 1314,
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性。',
    },
    1898: {
        n: '强化石',
        price: 50,
        integral: 2,
        tips: '极为稀有的石头，可用于强化装备，强化等级越高成功概率越低。',
    },
    1899: {
        n: '月光石',
        integral: 20,
        tips: '极为稀有的石头，可用于提升装备强化概率。',
    },
    18100: {
        n: '法则之石',
        tips: '诞生于混沌中的一种奇石,里面蕴含了无数法则,可用于锻造90级以上的套装。',
    },
    18101: {
        n: '大道之力',
        tips: '一缕大道感悟,似乎蕴含了大道运行轨迹,可用于锻造出蕴含大道的套装。',
    },
    18102: {
        n: '姻缘石',
        tips: '缘定三生之石,乃是天下有情人因果凝结成,可用于锻造情缘装备。',
    },
    18103: {
        n: '宠物转化卷',
        tips: '极为稀有的卷轴，可以改变宠物的类型。',
    },
}

module.exports = {
    getArticleList: function () {
        return Object.keys(articleMap).map((id) => {
            const idNum = Number(id);
            return {
                ...articleMap[id],
                id: idNum,
            }
        })
    },
    getArticle: function (id) {
        if (!articleMap[id]) {
            console.log('未找到物品：', id);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}