const articleMap = {
    180: {
        name: '宠物技能卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物觉醒技能。',
    },
    181: {
        name: '宠物进化卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物提升资质。',
    },
    182: {
        name: '宠物转生卷',
        tips: '极为稀有的卷轴，据说拥有极为神秘的力量，可为宠物先天资质，每个宠物最多使用三次。',
    },
    183: {
        name: '宠物扩房卷',
        tips: '神奇的卷轴,可在宠物房中进行空间扩张。',
    },
    184: {
        name: '彩灵蛋',
        tips: '蕴含五系灵力的灵蛋，可用于兑换宠物。',
    },
    185: {
        name: '水灵蛋',
        tips: '蕴含水系灵力的灵蛋，可用于兑换宠物。',
    },
    186: {
        name: '火灵蛋',
        tips: '蕴含火系灵力的灵蛋，可用于兑换宠物。',
    },
    187: {
        name: '风灵蛋',
        tips: '蕴含风系灵力的灵蛋，可用于兑换宠物。',
    },
    188: {
        name: '雷灵蛋',
        tips: '蕴含雷系灵力的灵蛋，可用于兑换宠物。',
    },
    189: {
        name: '冰灵蛋',
        tips: '蕴含冰系灵力的灵蛋，可用于兑换宠物。',
    },
    1810: {
        name: '一元诀',
        tips: '可使技能等级提升到1级，3个一元诀可合成1个二气诀。',
    },
    1811: {
        name: '二气诀',
        tips: '可使技能等级提升到2级，3个二气诀可合成1个三才诀。',
        manufacture: {
            id: 1810,
            s: 3
        }
    },
    1812: {
        name: '三才诀',
        tips: '可使技能等级提升到3级，3个三才诀可合成1个四象诀。',
        manufacture: {
            id: 1811,
            s: 3
        }
    },
    1813: {
        name: '四象诀',
        tips: '可使技能等级提升到4级，3个四象诀可合成1个五行诀。',
        manufacture: {
            id: 1812,
            s: 3
        }
    },
    1814: {
        name: '五行诀',
        tips: '可使技能等级提升到5级，3个五行诀可合成1个六合诀。',
        manufacture: {
            id: 1813,
            s: 3
        }
    },
    1815: {
        name: '六合诀',
        tips: '可使技能等级提升到6级，3个六合诀可合成1个七星诀。',
        manufacture: {
            id: 1814,
            s: 3
        }
    },
    1816: {
        name: '七星诀',
        tips: '可使技能等级提升到7级，3个七星诀可合成1个八卦诀。',
        manufacture: {
            id: 1815,
            s: 3
        }
    },
    1817: {
        name: '八卦诀',
        tips: '可使技能等级提升到8级，3个八卦诀可合成1个九宫诀。',
        manufacture: {
            id: 1816,
            s: 3
        }
    },
    1818: {
        name: '九宫诀',
        tips: '可使技能等级提升到9级，3个九宫诀可合成1个十重诀。',
        manufacture: {
            id: 1817,
            s: 3
        }
    },
    1819: {
        name: '十重诀',
        tips: '可使技能等级提升到10级，3个十重诀可合成1个风云诀。',
        manufacture: {
            id: 1818,
            s: 3
        }
    },
    1820: {
        name: '风云诀',
        tips: '可使技能等级提升到11级，3个风云诀可合成1个逍遥诀。',
        manufacture: {
            id: 1819,
            s: 3
        }
    },
    1821: {
        name: '逍遥诀',
        tips: '可使技能等级提升到12级，3个逍遥诀可合成1个天地诀。',
        manufacture: {
            id: 1820,
            s: 3
        }
    },
    1822: {
        name: '天地诀',
        tips: '可使技能等级提升到13级，3个天地诀可合成1个初阶技能升级书。',
        manufacture: {
            id: 1821,
            s: 3
        }
    },
    1823: {
        name: '一转技能书',
        tips: '技能提升至13级后，可使此技能数升华一转，并可达到32级上限。',
    },
    1824: {
        name: '二转技能书',
        tips: '技能提升至32级后，可使此技能数升华二转，并可达到50级上限。',
    },
    1825: {
        name: '三转技能书',
        tips: '技能提升至50级后，可使此技能数升华三转，并可达到70级上限。',
    },
    1826: {
        name: '四转技能书',
        tips: '技能提升至70级后，可使此技能数升华四转，并可达到80级上限。',
    },
    1827: {
        name: '五转技能书',
        tips: '技能提升至80级后，可使此技能数升华五转，并可达到90级上限。',
    },
    1828: {
        name: '六转技能书',
        tips: '技能提升至90级后，可使此技能数升华六转，并可达到100级上限。',
    },
    1829: {
        name: '七转技能书',
        tips: '技能提升至100级后，可使此技能数升华七转。',
    },
    1830: {
        name: '初阶技能升级书',
        tips: '13级-30级的技能使用此技能继续提升等级,五本可合成一本中阶技能升级书。',
        manufacture: {
            id: 1822,
            s: 3
        }
    },
    1831: {
        name: '中阶技能升级书',
        tips: '31级-50级的技能可使用此技能继续提升等级,五本可合成一本高阶技能升级书。',
        manufacture: {
            id: 1830,
            s: 5
        }
    },
    1832: {
        name: '高阶技能升级书',
        tips: '50级以上的技能可使用此技能继续提升等级。',
        manufacture: {
            id: 1831,
            s: 5
        }
    },
    1833: {
        name: '1级强化卡',
        tips: '装备强化卡,可使强化等级0的装备100%强化到1级，2个1级强化卡可合成2级强化卡。',
    },
    1834: {
        name: '2级强化卡',
        tips: '装备强化卡,可使强化等级1的装备100%强化到2级，2个2级强化卡可合成3级强化卡。',
        manufacture: {
            id: 1833,
            s: 2
        }
    },
    1835: {
        name: '3级强化卡',
        tips: '装备强化卡,可使强化等级2的装备100%强化到3级，2个4级强化卡可合成4级强化卡。',
        manufacture: {
            id: 1834,
            s: 2
        }
    },
    1836: {
        name: '4级强化卡',
        tips: '装备强化卡,可使强化等级3的装备100%强化到4级，2个4级强化卡可合成5级强化卡。',
        manufacture: {
            id: 1835,
            s: 2
        }
    },
    1837: {
        name: '5级强化卡',
        tips: '装备强化卡,可使强化等级4的装备100%强化到5级，2个5级强化卡可合成6级强化卡。',
        manufacture: {
            id: 1836,
            s: 2
        }
    },
    1838: {
        name: '6级强化卡',
        tips: '装备强化卡,可使强化等级5的装备100%强化到6级，2个5级强化卡可合成6级强化卡。',
        manufacture: {
            id: 1837,
            s: 2
        }
    },
    1839: {
        name: '7级强化卡',
        tips: '装备强化卡,可使强化等级6的装备100%强化到7级，2个6级强化卡可合成7级强化卡。',
        manufacture: {
            id: 1838,
            s: 2
        }
    },
    1840: {
        name: '8级强化卡',
        tips: '装备强化卡,可使强化等级7的装备100%强化到8级，2个8级强化卡可合成9级强化卡。',
        manufacture: {
            id: 1839,
            s: 2
        }
    },
    1841: {
        name: '9级强化卡',
        tips: '装备强化卡,可使强化等级8的装备100%强化到9级，2个9级强化卡可合成10级强化卡。',
        manufacture: {
            id: 1840,
            s: 2
        }
    },
    1842: {
        name: '10级强化卡',
        tips: '装备强化卡,可使强化等级9的装备100%强化到10级，2个10级强化卡可合成11级强化卡。',
        manufacture: {
            id: 1841,
            s: 2
        }
    },
    1843: {
        name: '11级强化卡',
        tips: '装备强化卡,可使强化等级10的装备100%强化到11级，2个11级强化卡可合成12级强化卡。',
        manufacture: {
            id: 1842,
            s: 2
        }
    },
    1844: {
        name: '12级强化卡',
        tips: '装备强化卡,可使强化等级11的装备100%强化到12级，2个12级强化卡可合成13级强化卡。',
        manufacture: {
            id: 1843,
            s: 2
        }
    },
    1845: {
        name: '13级强化卡',
        tips: '装备强化卡,可使强化等级12的装备100%强化到13级，2个13级强化卡可合成14级强化卡。',
        manufacture: {
            id: 1844,
            s: 2
        }
    },
    1846: {
        name: '14级强化卡',
        tips: '装备强化卡,可使强化等级13的装备100%强化到14级，3个14级强化卡可合成15级强化卡。',
        manufacture: {
            id: 1845,
            s: 2
        }
    },
    1847: {
        name: '15级强化卡',
        tips: '装备强化卡,可使强化等级14的装备100%强化到15级，3个15级强化卡可合成16级强化卡。',
        manufacture: {
            id: 1846,
            s: 3
        }
    },
    1848: {
        name: '16级强化卡',
        integral: 1314,
        tips: '装备强化卡,可使强化等级15的装备100%强化到16级。',
        manufacture: {
            id: 1847,
            s: 3
        }
    },
    1849: {
        name: '一阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级星君,法皇，血煞职业的装备',
    },
    1850: {
        name: '二阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级法皇,星君,血煞职业的装备',
    },
    1851: {
        name: '三阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级法皇,星君,血煞职业的装备',
    },
    1852: {
        name: '顶阶玄石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级法皇,星君,血煞职业的装备',
    },
    1853: {
        name: '一阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级战尊,战神,战狂职业的装备',
    },
    1854: {
        name: '二阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级战尊,战神,战狂职业的装备',
    },
    1855: {
        name: '三阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级战尊,战神,战狂职业的装备',
    },
    1856: {
        name: '顶阶玉石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级战尊,战神,战狂职业的装备',
    },
    1857: {
        name: '一阶云石',
        tips: '蕴含强大能量的石头，可用于锻造10-35级羽圣,剑仙,赤魅职业的装备',
    },
    1858: {
        name: '二阶云石',
        tips: '蕴含强大能量的石头，可用于锻造36-55级羽圣,剑仙,赤魅职业的装备',
    },
    1859: {
        name: '三阶云石',
        tips: '蕴含强大能量的石头，可用于锻造56-70级羽圣,剑仙,赤魅职业的装备',
    },
    1860: {
        name: '顶阶云石',
        tips: '蕴含强大能量的石头，可用于锻造71-80级羽圣,剑仙,赤魅职业的装备',
    },
    1861: {
        name: '一阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的武器部位。',
    },
    1862: {
        name: '二阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的武器部位。',
    },
    1863: {
        name: '三阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的武器部位。',
    },
    1864: {
        name: '顶阶武器晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的武器部位。',
    },
    1865: {
        name: '一阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的头盔部位。',
    },
    1866: {
        name: '二阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的头盔部位。',
    },
    1867: {
        name: '三阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的头盔部位。',
    },
    1868: {
        name: '顶阶头盔晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的头盔部位。',
    },
    1869: {
        name: '一阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的铠甲部位。',
    },
    1870: {
        name: '二阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的铠甲部位。',
    },
    1871: {
        name: '三阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的铠甲部位。',
    },
    1872: {
        name: '顶阶铠甲晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的铠甲部位。',
    },
    1873: {
        name: '一阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的腰带部位。',
    },
    1874: {
        name: '二阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的腰带部位。',
    },
    1875: {
        name: '三阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的腰带部位。',
    },
    1876: {
        name: '顶阶腰带晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的腰带部位。',
    },
    1877: {
        name: '一阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的鞋子部位。',
    },
    1878: {
        name: '二阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的鞋子部位。',
    },
    1879: {
        name: '三阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的鞋子部位。',
    },
    1880: {
        name: '顶阶鞋子晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的鞋子部位。',
    },
    1881: {
        name: '一阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的戒指部位。',
    },
    1882: {
        name: '二阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的戒指部位。',
    },
    1883: {
        name: '三阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的戒指部位。',
    },
    1884: {
        name: '顶阶戒指晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的戒指部位。',
    },
    1885: {
        name: '一阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造35级套装的项链部位。',
    },
    1886: {
        name: '二阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造55级套装的项链部位。',
    },
    1887: {
        name: '三阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造70级套装的项链部位。',
    },
    1888: {
        name: '顶阶项链晶石',
        tips: '蕴含强大能量的石头，可用于打造80级套装的项链部位。',
    },
    1889: {
        name: '一星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个一星魔符可合成1个二星魔符。',
    },
    1890: {
        name: '二星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个二星魔符可合成1个三星魔符。',
        manufacture: {
            id: 1889,
            s: 3
        }
    },
    1891: {
        name: '三星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个三星魔符可合成1个四星魔符。',
        manufacture: {
            id: 1890,
            s: 3
        }
    },
    1892: {
        name: '四星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个四星魔符可合成1个五星魔符。',
        manufacture: {
            id: 1891,
            s: 3
        }
    },
    1893: {
        name: '五星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个五星魔符可合成1个六星魔符。',
        manufacture: {
            id: 1892,
            s: 3
        }
    },
    1894: {
        name: '六星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个一六星魔符可合1一个七星魔符。',
        manufacture: {
            id: 1893,
            s: 3
        }
    },
    1895: {
        name: '七星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,3个七星魔符可合成1个八星魔符。',
        manufacture: {
            id: 1894,
            s: 3
        }
    },
    1896: {
        name: '八星魔符',
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性,4个八星魔符可合成1个九星魔符。',
        manufacture: {
            id: 1895,
            s: 3
        }
    },
    1897: {
        name: '九星魔符',
        integral: 1314,
        tips: '蕴含强大魔力的符文，可对装备进行附魔提升大量的属性。',
        manufacture: {
            id: 1896,
            s: 4
        }
    },
    1898: {
        name: '强化石',
        price: 50,
        unit: 'yuanbao',
        integral: 2,
        tips: '极为稀有的石头，可用于强化装备，强化等级越高成功概率越低。',
    },
    1899: {
        name: '月光石',
        integral: 20,
        tips: '极为稀有的石头，可用于提升装备强化概率。',
    },
    18100: {
        name: '法则之石',
        tips: '诞生于混沌中的一种奇石,里面蕴含了无数法则,可用于锻造90级以上的套装。',
    },
    18101: {
        name: '大道之力',
        tips: '一缕大道感悟,似乎蕴含了大道运行轨迹,可用于锻造出蕴含大道的套装。',
    },
    18102: {
        name: '姻缘果',
        tips: '缘定三生之石,乃是天下有情人因果凝结成,可用于锻造情缘装备。',
    },
    18103: {
        name: '宠物转化卷',
        tips: '极为稀有的卷轴，可以改变宠物的类型。',
    },
}

module.exports = {
    getArticleList: function () {
        return Object.keys(articleMap).map((id) => {
            const idNum = Number(id);
            return {
                ...articleMap[id],
                id: idNum,
            }
        })
    },
    getArticle: function (id) {
        if (!articleMap[id]) {
            console.log('未找到物品：', id);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}