const articleMap = {
    200: {
        name: '太阳石碎片',
        tips: '从太阴石矿中获取到的太阴石碎片，每100枚可合成1枚一阶太阴石。',
    },
    201: {
        name: '一阶太阴石',
        tips: '从太阴石矿中获取到的一阶太阴石，每100枚可合成1枚二阶太阴石。',
    },
    202: {
        name: '二阶太阴石',
        tips: '从太阴石矿中获取到的二阶太阴石，每100枚可合成1枚三阶太阴石。',
    },
    203: {
        name: '三阶太阴石',
        tips: '从太阴石矿中获取到的三阶太阴石，每100枚可合成1枚四阶太阴石。',
    },
    204: {
        name: '四阶太阴石',
        tips: '从太阴石矿中获取到的四阶太阴石，每100枚可合成1枚五阶太阴石。',
    },
    205: {
        name: '五阶太阴石',
        tips: '从太阴石矿中获取到的五阶太阴石，每100枚可合成1枚六阶太阴石。',
    },
    206: {
        name: '六阶太阴石',
        tips: '从太阴石矿中获取到的六阶太阴石，每100枚可合成1枚七阶太阴石。',
    },
    207: {
        name: '七阶太阴石',
        tips: '从太阴石矿中获取到的七阶太阴石，蕴含纯粹的太阴道蕴。',
    },
    208: {
        name: '太阳石碎片',
        tips: '从太阳石矿中获取到的太阳石碎片，每100枚可合成1枚一阶太阳石。',
    },
    209: {
        name: '一阶太阳石',
        tips: '从太阳石矿中获取到的一阶太阳石，每100枚可合成1枚二阶太阳石。',
    },
    2010: {
        name: '二阶太阳石',
        tips: '从太阳石矿中获取到的二阶太阳石，每100枚可合成1枚三阶太阳石。',
    },
    2011: {
        name: '三阶太阳石',
        tips: '从太阳石矿中获取到的三阶太阳石，每100枚可合成1枚四阶太阳石。',
    },
    2012: {
        name: '四阶太阳石',
        tips: '从太阳石矿中获取到的四阶太阳石，每100枚可合成1枚五阶太阳石。',
    },
    2013: {
        name: '五阶太阳石',
        tips: '从太阳石矿中获取到的五阶太阳石，每100枚可合成1枚六阶太阳石。',
    },
    2014: {
        name: '六阶太阳石',
        tips: '从太阳石矿中获取到的六阶太阳石，每100枚可合成1枚七阶太阳石。',
    },
    2015: {
        name: '七阶太阳石',
        tips: '从太阳石矿中获取到的七阶太阳石，蕴含纯粹的太阳道蕴。',
    },
    2016: {
        name: '造化石碎片',
        tips: '从造化石矿中获取到的造化石碎片，每100枚可合成1枚一阶造化石。',
    },
    2017: {
        name: '一阶造化石',
        tips: '从造化石矿中获取到的一阶造化石，每100枚可合成1枚二阶造化石。',
    },
    2018: {
        name: '二阶造化石',
        tips: '从造化石矿中获取到的二阶造化石，每100枚可合成1枚三阶造化石。',
    },
    2019: {
        name: '三阶造化石',
        tips: '从造化石矿中获取到的三阶造化石，每100枚可合成1枚四阶造化石。',
    },
    2020: {
        name: '四阶造化石',
        tips: '从造化石矿中获取到的四阶造化石，每100枚可合成1枚五阶造化石。',
    },
    2021: {
        name: '五阶造化石',
        tips: '从造化石矿中获取到的五阶造化石，每100枚可合成1枚六阶造化石。',
    },
    2022: {
        name: '六阶造化石',
        tips: '从造化石矿中获取到的六阶造化石，每100枚可合成1枚七阶造化石。',
    },
    2023: {
        name: '七阶造化石',
        tips: '从造化石矿中获取到的七阶造化石，蕴含纯粹的造化道蕴。',
    },
    
    
}

module.exports = {
    getArticleList: function () {
        return Object.keys(articleMap).map((id) => {
            const idNum = Number(id);
            return {
                ...articleMap[id],
                id: idNum,
            }
        })
    },
    getArticle: function (id) {
        if (!articleMap[id]) {
            console.log('未找到物品：', id);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}
