// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]  元素:{list,n,tip }
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 人族地图 id5开头
const copyGrand = {
    50000: {
        id: 50000,
        name: "炼魂洞",
        data: [
            [
                {
                    list: [[212, 213]],
                    n: '炼魂洞一层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞二层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞三层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞四层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞五层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞六层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞七层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
                {
                    list: [[212, 213]],
                    n: '炼魂洞八层',
                    tip: "洞府内,地面四周可见白骨，全是被炼魂郎君所杀。"
                },
            ]
        ]
    },

};

module.exports = {
    copyGrand,
};