// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]  元素:{list,n,tip }
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 异界地图 id6开头
const differenceGrand = {
    60000: {
        id: 60000,
        name: "情缘之地",
        data: [
            [
                {
                    list: [[434]],
                    n: '姻缘石',
                    tip: "传说中的姻缘石，可让两情相悦者缔结姻缘。"
                },
                {
                    n: '姻缘树',
                    tip: "姻缘树，天地造化而成，传说唯有缔结姻缘之人可以看到。"
                }
            ]
        ]
    },

};

module.exports = {
    differenceGrand,
};