
// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 妖族地图 id2开头
const goblinGrand = {
    20000: {
        id: 20000,
        name: "妖魔寨",
        data: [
            [
                [],
                [["2000000", "2000001", "2000002"]],
                [],
                []
            ]
        ]
    }
};

module.exports = {
    goblinGrand,
};