// 妖族地图 id2开头
const goblinGrand = {
    20000: {
        id: 20000,
        name: "盘丝洞",
        data: [
            [
                {
                    n: '盘丝洞',
                    tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                    list: [[44]],
                },
                {
                    list: [[20211, 20212]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20213, 20214]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20215, 20216]],
                    n: '黑风寨',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20217, 20218]],
                    n: '后山悬崖',
                    tip: "到处都是极其危险山贼。"
                },
            ]
        ]
    },
    20001: {
        id: 20001,
        name: "妖魔寨",
        data: [
            [
                {
                    list: [
                        [43],
                        [440],
                        [417],
                        [416],
                        [40]
                    ],
                    tip: "人族主城,强者随处可见。"
                },
                {
                    list: [
                        [45],
                        [46],
                        [47],
                        [48],
                        [49],
                        [410, 411, 413, 414],
                        [415]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [418],
                        [419],
                        [420],
                        [38],
                        // [421],
                    ],
                    n: '生活区',
                    tip: "人族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [422],
                        [423]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代人族先辈守护。"
                },

            ]
        ]
    },
    20002: {
        id: 20002,
        name: "不夜城",
        data: [
            [
                { list: [[20221, 20222]]},
                { list: [[20223, 20224]]},
                { list: [[20225, 20226]]},
                { list: [[20227, 20228]]},
            ],
            [
                {
                    list: [[441]],
                    n: '欧冶子居所',
                    tip: "看起来有些简陋的茅屋，传说中人族神匠欧冶子隐居之所，外面还立着一座火炉。"
                },
            ]
        ]
    },
    20003: {
        id: 20003,
        name: "迷雾森林",
        data: [
            [
                { list: [[20231, 20232]]},
                { list: [[20233, 20234]]},
                { list: [[20235, 20236]]},
                { list: [[20237, 20238]]},
            ],
        ]
    },
    20004: {
        id: 20004,
        name: "妖魔岭",
        data: [
            [
                { list: [[20241, 20242]]},
                { list: [[20243, 20244]]},
                { list: [[20245, 20246]]},
                { list: [[20247, 20248]]},
            ],
        ]
    },
};

module.exports = {
    goblinGrand,
};

