
// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 妖族地图 id2开头
const goblinGrand = {
    20000: {
        id: 20000,
        name: "盘丝洞",
        data: [
            [
                {
                    list: [
                        [11]
                    ],  
                }
            ]
        ]
    },
    20001: {
        id: 20001,
        name: "妖魔寨",
        data: [
            [
                {
                    list: [
                        [43],
                        [44],
                        [40]
                    ],
                    tip: "妖族主城,强者随处可见。"
                },
                {
                    list: [
                        [45],
                        [46],
                        [47],
                        [48],
                        [49],
                        [410, 411, 412, 413],
                        [414, 415, 416],
                        [13]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [417],
                        [418],
                        [419],
                        [420],
                        [421],
                    ],
                    n: '生活区',
                    tip: "妖族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [422],
                        [423]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代妖族先辈守护。"
                },

            ]
        ]
    },
    20002: {
        id: 20002,
        name: "不夜城",
        data: [
            [
                {
                    list: [
                        [11]
                    ],  
                }
            ]
        ]
    },
    20003: {
        id: 20003,
        name: "迷雾之谷",
        data: [
            [
                {
                    list: [
                        [11]
                    ],  
                }
            ]
        ]
    },
    20004: {
        id: 20004,
        name: "封魔之地",
        data: [
            [
                {
                    list: [
                        [11]
                    ],  
                }
            ]
        ]
    },
};

module.exports = {
    goblinGrand,
};