// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 仙族地图 id3开头
const immortalGrand = {
    30000: {
        id: 30000,
        name: "蓬莱仙岛",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],  
                }
            ]
        ]
    },
    30001: {
        id: 30001,
        name: "九仙山",
        data: [
            [
                {
                    list: [
                        [4000003],
                        [4000004],
                        [4000000]
                    ],
                    tip: "仙族主城,强者随处可见。"
                },
                {
                    list: [
                        [4000005],
                        [4000006],
                        [4000007],
                        [4000008],
                        [4000009],
                        [4000010, 4000011, 4000012, 4000013],
                        [4000014, 4000015, 4000016],
                        [1000003]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [4000017],
                        [4000018],
                        [4000019],
                        [4000020],
                        [4000021],
                    ],
                    n: '生活区',
                    tip: "仙族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [4000022],
                        [4000023]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代仙族先辈守护。"
                },

            ]
        ]
    },
    30002: {
        id: 30002,
        name: "九天虚无岛",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],  
                }
            ]
        ]
    },
    30003: {
        id: 30003,
        name: "九重天",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],  
                }
            ]
        ]
    },
    30004: {
        id: 30004,
        name: "云顶天宫",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],  
                }
            ]
        ]
    }
};

module.exports = {
    immortalGrand,
};