// 人族地图 id1开头
const peopleGrand = {
    10000: {
        id: 10000,
        name: "隐仙村",
        data: [
            [
                {
                    n: '隐仙村',
                    tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                    list: [[2999988, 2999989, 2999990, 2999991, 2999992, 2999993, 2999994, 2999995, 2999996, 2999997, 2999998, 2999999]],
                },
                {
                    n: '隐仙村',
                    tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                    list: [[44]],
                },
                {
                    list: [[2000, 2001]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[2002, 2003]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[2004, 2005]],
                    n: '黑风寨',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[2006, 2007]],
                    n: '后山悬崖',
                    tip: "到处都是极其危险山贼。"
                },
            ]
        ]
    },
    10001: {
        id: 10001,
        name: "剑舞城",
        data: [
            [
                {
                    list: [
                        [43],
                        [440],
                        [417],
                        [416],
                        [40]
                    ],
                    tip: "人族主城,强者随处可见。"
                },
                {
                    list: [
                        [45],
                        [46],
                        [47],
                        [48],
                        [49],
                        [410, 411, 413, 414],
                        [415]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [418],
                        [419],
                        [420],
                        [38],
                        [35],
                    ],
                    n: '生活区',
                    tip: "人族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [422],
                        [423]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代人族先辈守护。"
                },

            ]
        ]
    },
    10002: {
        id: 10002,
        name: "大泽谷",
        data: [
            [
                { list: [[2008, 2009]] },
                { list: [[20010, 20011]] },
                { list: [[20012, 20013]] },
                { list: [[20014, 20015]] },
            ],
            [
                {
                    list: [[441]],
                    n: '欧冶子居所',
                    tip: "看起来有些简陋的茅屋，传说中人族神匠欧冶子隐居之所，外面还立着一座火炉。"
                },
            ]
        ]
    },
    10003: {
        id: 10003,
        name: "映月崖",
        data: [
            [
                { list: [[20016, 20017]] },
                { list: [[20018, 20019]] },
                { list: [[20020, 20022]] },
                { list: [[20023, 20024]] },
            ],
        ]
    },
    10004: {
        id: 10004,
        name: "藏剑冢",
        data: [
            [
                { list: [[20025, 20026]] },
                { list: [[20027, 20028]] },
                { list: [[20029, 20030]] },
                { list: [[20031, 20032]] },
            ],
        ]
    },
};

module.exports = {
    peopleGrand,
};

