// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]  元素:{list,n,tip }
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 人族地图 id1开头
const peopleGrand = {
    10000: {
        id: 10000,
        name: "隐仙村",
        data: [
            [
                {
                    list: [[1000000]],
                    n: '隐仙村',
                    tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。"
                },
                {
                    list: [[2000000, 2000001, 2000002]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[2000003, 2000004, 2000005, 2000006, 2000007]],
                    n: '装备材料',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[2000008, 2000009, 2000010,2000011],[2000012, 2000013]],
                    n: '声望',
                    tip: "到处都是极其危险山贼。"
                },
            ]
        ]
    },
    10001: {
        id: 10001,
        name: "剑舞城",
        data: [
            [
                {
                    list: [
                        [4000003],
                        [4000004],
                        [4000000]
                    ],
                    tip: "人族主城,强者随处可见。"
                },
                {
                    list: [
                        [4000005],
                        [4000006],
                        [4000007],
                        [4000008],
                        [4000009],
                        [4000010, 4000011, 4000012, 4000013],
                        [4000014, 4000015, 4000016],
                        [1000003]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [4000017],
                        [4000018],
                        [4000019],
                        [4000020],
                        [4000021],
                    ],
                    n: '生活区',
                    tip: "人族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [4000022],
                        [4000023]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代人族先辈守护。"
                },

            ]
        ]
    },
    10002: {
        id: 10002,
        name: "大泽谷",
        data: [
            [
                {
                    list: [
                        // [1000006]
                    ],
                    n: '大泽入口',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代人族先辈守护。"
                },
                {
                    list: [
                        [1000006]
                    ],
                    n: '欧冶子居所',
                    tip: "在这里隐居着以为传奇神匠。"
                }
            ]
        ]
    },
    10003: {
        id: 10003,
        name: "映月崖",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],
                }
            ]
        ]
    },
    10004: {
        id: 10004,
        name: "五帝冢",
        data: [
            [
                {
                    list: [
                        [1000002]
                    ],
                }
            ]
        ]
    },
};

module.exports = {
    peopleGrand,
};