// 人族地图 id1开头
const peopleGrand = {
    10000: {
        id: 10000,
        name: "隐仙村",
        data: [
            [
                // {
                //     n: '隐仙村',
                //     tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                //     list: [[2999988, 2999989, 2999990, 2999991, 2999992, 2999993, 2999994, 2999995, 2999996, 2999997, 2999998, 2999999]],
                // },
                {
                    list: [[44]],
                    n: '隐仙村',
                    tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                },
                {
                    list: [[20011, 20012]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20013, 20014]],
                    n: '十里坡',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20015, 20016]],
                    n: '黑风寨',
                    tip: "到处都是极其危险山贼。"
                },
                {
                    list: [[20017, 20018]],
                    n: '后山悬崖',
                    tip: "到处都是极其危险山贼。"
                },
            ],
            [
                {
                    // n: '隐仙村',
                    // tip: "极为偏僻的村庄,村口有一棵传说从上古时期便存在的参天古树。",
                    list: [[20019, 200110]],
                },
                {
                    list: [[200111, 200112]],
                    // n: '十里坡',
                    // tip: "到处都是极其危险山贼。"
                },
            ]
        ]
    },
    10001: {
        id: 10001,
        name: "剑舞城",
        data: [
            [
                {
                    list: [
                        [43],
                        [440],
                        [417],
                        [416],
                        [40]
                    ],
                    tip: "人族主城,强者随处可见。"
                },
                {
                    list: [
                        [45],
                        [46],
                        [47],
                        [48],
                        [49],
                        [410, 411, 413, 414],
                        [415]
                    ],
                    n: '交易区',
                    tip: "繁华的交易场所,互通三界,传说中的拍卖行更是拍出过天价之宝。"
                },
                {
                    list: [
                        [418],
                        [419],
                        [420],
                        [38],
                        [35],
                    ],
                    n: '生活区',
                    tip: "人族修士的生活区域,你可以在这里寻找自己的势力。"
                },
                {
                    list: [
                        [422],
                        [423]
                    ],
                    n: '异界裂缝',
                    tip: "在这里有无数裂缝可通往异世界，同时也会有异界生物入侵,所幸有历代人族先辈守护。"
                },

            ]
        ]
    },
    10002: {
        id: 10002,
        name: "大泽谷",
        data: [
            [
                { list: [[20021, 20022]] },
                { list: [[20023, 20024]] },
                { list: [[20025, 20026]] },
                { list: [[20027, 20028]] },
            ],
            [
                {
                    list: [[441]],
                    n: '欧冶子居所',
                    tip: "看起来有些简陋的茅屋，传说中人族神匠欧冶子隐居之所，外面还立着一座火炉。"
                },
            ]
        ]
    },
    10003: {
        id: 10003,
        name: "映月崖",
        data: [
            [
                { list: [[20031, 20032]] },
                { list: [[20033, 20034]] },
                { list: [[20035, 20036]] },
                { list: [[20037, 20038]] },
            ],
        ]
    },
    10004: {
        id: 10004,
        name: "藏剑冢",
        data: [
            [
                { list: [[20041, 20042]] },
                { list: [[20043, 20044]] },
                { list: [[20045, 20046]] },
                { list: [[20047, 20048]] },
            ],
        ]
    },
};

module.exports = {
    peopleGrand,
};

