// [
//     [ 0.0 , 0.1 , 0.2 , 0.3 ],
//     [ 1.0 , 1.1 , 1.2 , 1.3 ],
//     [ 2.0 , 2.1 , 2.2 , 2.3 ],
//     [ 3.0 , 3.1 , 3.2 , 3.3 ]
// ]
// 地图元素(1开头:NPC元素,2开头:怪物元素,3开头:传送元素,4:面板元素)
// 人族地图 id1开头
const peopleGrand = {
    10000: {
        id: 10000,
        name: "隐仙村",
        data: [
            [
                [],
                [["2000000", "2000001", "2000002",]],
                [],
                []
            ]
        ]
    },
};

module.exports = {
    peopleGrand,
};