module.exports = {
    36: {
        id: 36,
        title: "御龙军传说(1)",
        tips: "你来到无妄海就见拎壶冲的模样有些颓废,快去了解出什么事了吧?",
        type: 2,
        reward: {
            attr: "exp-10000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,0",
            }
        },
        receive: [
            "拎壶冲没有回答而是指了指远处,只见莫约百米外是一片漆黑无边无尽的大海,无数怨气惊天的骷髅大军在海面上游荡甚至还隐约能听到龙吟。",
            "你目光一震：这是什么?",
            "拎壶冲：这应该就是传说中的御龙军。",
            "你：&御龙军?",
        ],
        done: [
            "拎壶冲：我人族曾经出现过一尊极为鼎盛的皇朝,御龙军便是当时最强军队,据说镇压仙,妖两族数百年甚至差点将两族泯灭与时间长河之中。",
            "你：这么厉害!",
            "拎壶冲：可惜,突然有一天御龙军不见了,那鼎盛的皇朝也就此没落。",
            "你：&御龙军为什么会消失呢?",
        ],
        nextId: 37,
    },
    37: {
        id: 37,
        title: "御龙军传说(2)",
        tips: "传说中世间无敌的御龙军为什么会消失呢,与拎壶冲对话了解一下。",
        type: 2,
        reward: {
            attr: "exp-10000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,0",
            }
        },
        receive: [
            "拎壶冲：我怎么知道,那时候我还没出生呢,这些也只是古籍中记载的。",
            "你：那你怎么确定这就是传说中的御龙军。",
            "拎壶冲：你看大海深处那些飞在空中的骷髅巨鸟,根据古籍记载这应该就是御龙军的飞骑龙鹰。",
            "你：&难怪我听到了龙吟!",
        ],
        done: [
            "拎壶冲：只是没想到传说中无敌的御龙军竟然会葬身这片无妄海并化作了亡灵大军。",
            "你：也就是说我们要找传说中的馒头就必须与传说中的御龙军交手。",
            "拎壶冲：没错。",
            "你：&......",
        ],
        nextId: 38,
    },
    38: {
        id: 38,
        title: "御龙军传说(3)",
        tips: "击败化身骷髅剑客的御龙军,帮助拎壶冲找回自信。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,0",
            }
        },
        complete: {
            freak: "2047-2"
        },
        tp: '40001,0,1',
        receive: [
            "拎壶冲：唉,要不我们还是放弃吧。",
            "听到拎壶冲的话你愣了一下,随即转身便朝远处的无妄海走去。",
            "拎壶冲：你去干嘛!",
            "你：&我去试试这传说中的御龙军究竟有多强。",
        ],
        done: [
            "目睹你击败几名御龙军归来后,拎壶冲当即不可置信道：你...你...你真的战胜了传说的御龙军!",
            "你重重的吐了一口气：这御龙军果然厉害,若非失去了灵智,谁胜谁负还真不好说。",
            "这时背后突然传来一声怒斥：你们是什么人,竟然敢打扰御龙军安息!",
            "&继续",
        ],
        nextId: 39,
    },
    39: {
        id: 39,
        title: "御龙军传说(4)",
        tips: "突然出现的神秘小女孩似乎知道御龙军或许可以通过她了解御龙军。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 113,
                address: "40001,0,0",
            }
        },
        replace: true,
        receive: [
            "转过身去只见在你们身后突然出现一个短发绿衣小女孩,脸上抹着几道红色彩印,此时正一脸敌意的看着你们。",
            "神秘小女孩：你们打扰了御龙军,还不速速离去。",
            "你：&你知道御龙军。",
        ],
        done: [
            "神秘小女孩：当然知道,御龙军可是......,咦,你是${role_name}",
            "这话一出你当即愣住了：你认识我?",
            "拎壶冲也是一脸错愕的朝我问道：你俩认识?",
            "见你一脸茫然,这时神秘小女孩才恍然大悟的开口道：哦,我想起来了,现在的你还不认识我。",
            "你：&现在不认识,难道以后我们会认识?",
        ],
        nextId: 40,
    },
    40: {
        id: 40,
        title: "御龙军传说(5)",
        tips: "神秘小女孩竟然知道你与拎壶冲的目的找她继续了解原因。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 113,
                address: "40001,0,0",
            }
        },
        replace: true,
        receive: [
            "神秘小女孩没有直接回答而是突然一脸好奇的问道：你们来无妄海是找传说中的馒头?",
            "你与拎壶冲都是一惊,不明白这神秘的小女孩是如何知道的。",
            "见你二人的反应神秘小女孩当即就一脸惊喜的笑了起来：果然如此,${role_name}没想到你现在这么弱。",
            "你：&......",
        ],
        done: [
            "神秘小女孩：好了,不逗你了,我可以偷偷告诉你馒头就在御龙军的大将军手中!",
            "你说我们找的馒头竟然在御龙大将军手中。",
            "听到这话还不等你有什么反应,一旁的拎壶冲吓得直接惊呼。",
            "你白了咋咋呼呼的拎壶冲一眼看向神秘小女孩：&你有办法让我从大将军手中拿到馒头?",
        ],
        nextId: 41,
    },
    41: {
        id: 41,
        title: "御龙军传说(7)",
        tips: "前往无妄海教训八爪章鱼一顿后找神秘小女孩询问拿到馒头的办法。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 113,
                address: "40001,0,0",
            }
        },
        complete: {
            freak: '2048-10'
        },
        tp: "40001,0,1",
        receive: [
            "神秘小女孩：嘻嘻,看到海里那群八只爪子的讨厌家伙?",
            "你：八爪章鱼?",
            "神秘小女孩：嗯,你去帮我教训它们一顿,我就告诉你一个可以拿到馒头的办法?",
            "你：&成交",
        ],
        done: [
            "看着你捣毁八爪章鱼群,神秘小女孩当即拍手叫好：哈哈,这群臭章鱼,让你以前偷袭本姑娘!",
            "你：现在可以告诉我了?",
            "神秘小女孩：跟我来,你不许来!",
            "拎壶冲正准备一起跟过来却被神秘小女孩拦了下来。",
            "&继续",
        ],
        nextId: 42,
    },
    42: {
        id: 42,
        title: "御龙军传说(8)",
        tips: "你跟着神秘小女孩来到一处山洞,似乎有些门道。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 114,
                address: "40001,1,0",
            }
        },
        receive: [
            "路上你看着神秘小女孩问道：对了,我还不知道你叫什么名字呢?",
            "神秘小女孩：我叫女娃,记住咯!",
            "你点了点头正又要开口突然前面的女娃脚步一顿：到了。",
            "你：&这是?",
        ],
        done: [
            "只见在你面前的是一个山洞,洞口似乎有一道玄奥的阵法。",
            "你：这是什么地方?",
            "女娃：炼魂洞府!",
            "&继续",
        ],
        nextId: 43,
    },
    43: {
        id: 43,
        title: "御龙军传说(9)",
        tips: "按照女娃的指引,进入炼魂洞府中进行历练。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 114,
                address: "40001,1,0",
            },
            tNpc: {
                id: 115,
                address: "50000,0,0",
            }
        },
        receive: [
            "你：炼魂洞府,你带我来这里干嘛?",
            "女娃：嘿嘿,这炼魂洞府乃是数百年前一尊大修士的洞府,其中可是有不少宝物哟。",
            "这话虽然没有直接回答,但言外之意不能再明显了,显然这炼魂洞内有能提升你实力的宝物。",
            "&继续",
        ],
        done: [
            "在女娃的指引下你成功踏入洞府内,瞬间一股阴冷的气息便笼罩全身,只见洞府内竟然到处都是骨骸彷如人间地狱一般,不远处似乎还有一道半透明的幽魂。",
            "那道幽魂这时也发现了你,眼中闪过一道惊喜：&你是外来者?",
        ],
        nextId: 44,
    },
    44: {
        id: 44,
        title: "御龙军传说(10)",
        tips: "与洞府之灵对话,了解当初炼魂郎君为何会遭到暗算。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 115,
                address: "50000,0,0",
            }
        },
        replace: true,
        receive: [
            "你：在下${role_name},不知前辈是?",
            "洞府之灵：我乃是洞府之灵,奉主人炼魂郎君之命守护此地。",
            "听到这话你心里微微一震,这段时间你也看过不少古籍知道人族历史上的一些大能者,其中便有这位炼魂郎君,据说曾诛杀了无数大妖,战功显赫,不过后来在诛杀一名大妖幽毒郎君时遭到暗算从此陨落。",
            "你：&没想到这里竟是炼魂郎君前辈的洞府!",
        ],
        done: [
            "洞府之灵：看来我人族后辈还有人记得主人,小家伙你可否帮我一个忙?",
            "你：前辈请奖!",
            "洞府之灵：诛杀幽毒郎君!",
            "你：&幽毒郎君不是死了?",
        ],
        nextId: 45,
    },
    45: {
        id: 45,
        title: "御龙军传说(11)",
        tips: "驱散炼魂洞内的凶魂,阻止大妖幽毒郎君破开封印。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 115,
                address: "50000,0,0",
            }
        },
        complete: {
            freak: '2058-10'
        },
        tp: "50000,0,1",
        receive: [
            "洞府之灵：当初主人遭到妖族暗算身负重伤无法彻底将幽毒郎君抹杀,于是只能将他封印在这洞府之中。",
            "你：所以前辈是想让晚辈去封印幽毒郎君的地方将其彻底击杀。",
            "洞府之灵：没错,不过在此之前你需要先将洞府内的凶魂驱散。",
            "你：为何?",
            "洞府之灵：数百年过去当初的封印早已经松动,幽毒郎君利用洞府内的宝物引来无数人族修士将他们击杀灵魂永拘此地,并且还在借助这些凶魂加速破开封印,所以我们必须先将这些凶魂驱散。",
            "你：&晚辈这就去。",
        ],
        done: [
            "见你轻易的驱散了凶魂,洞府之灵又是一脸期待的道：干的不错,我已经感觉到了洞府内的封印正在加固,接下来你再去将那些怨魂驱散就大功告成了。",
            "听到这话你并没有直接答应而是皱了皱眉头道：这些凶魂似乎实力都不强,前辈为何不亲自将它们驱散呢?",
            "洞府之灵脸色极为隐晦的一变,随即开口解释道：我虽是洞府之灵,但诞生之初就是为了完善镇压幽毒郎君的阵法,并不具备任何攻击力!",
            "你：&原来如此!",
        ],
        nextId: 46,
    },
    46: {
        id: 46,
        title: "御龙军传说(12)",
        tips: "驱散炼魂洞内的怨魂,阻止大妖幽毒郎君破开封印。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 115,
                address: "50000,0,0",
            },
            tNpc: {
                id: 116,
                address: "50000,0,1",
            }
        },
        complete: {
            freak: '2059-10'
        },
        tp: "50000,0,1",
        receive: [
            "洞府之灵：小家伙,没时间了迟疑,幽毒郎君似乎察觉到了变故正在加速冲破封印。",
            "你：既然如此,前辈为何不带我先去将幽毒郎君抹杀呢?",
            "洞府之灵：幽毒郎君实力强大以你现在的实力没有半点胜算,只有将怨魂驱散让我彻底掌控阵法压制他的力量你才有机会。",
            "你虽然还有疑惑,但听到这话也只能暂时压下。",
            "&继续",
        ],
        done: [
            "你虽然答应洞府之灵要驱散怨魂,但不知为何你总感觉有些地方不对,只是驱散了几道怨魂后就停了下来。",
            "小家伙,你被幽毒郎君骗了!",
            "正在你迟疑时,一道苍老的声音从背后传来,只见身后不知何时出现一个灵魂,相貌竟然与洞府之灵一模一样,不过此人气质明显要儒和许多。",
            "你：&你是炼魂郎君!",
        ],
        nextId: 47,
    },
    47: {
        id: 47,
        title: "御龙军传说(13)",
        tips: "炼魂郎君现身说破幽毒狼君的诡计,击败气急败坏的幽毒郎君。",
        type: 1,
        reward: {
            fun: "yulLongJun14",
        },
        grand: {
            npc: {
                id: 116,
                address: "50000,0,1",
            },
            freak: [{
                id: 20013,
                address: "50000,0,1",
            }]
        },
        receive: [
            "不知为何你看到此人就有这样的感觉,此人就是数百年前的人族大能：炼魂郎君。",
            "炼魂郎君：小家伙,这洞府内的凶魂与怨魂都是吾当年用来布置十二凶煞阵的阵灵,你若将它们全部驱散那幽毒郎君便会真正的破开阵法。",
            "听到这话你顿时一惊：你是说洞府之灵就是幽毒郎君!",
            "幽毒郎君：没错,本座就是幽毒郎君,没想到炼魂郎君,你竟然还有一缕残魂存在,不过本座已经破开了七成封印,尔等受死吧!",
            "&迎战幽毒郎君",
        ],
        done: [
            "幽毒郎君：不!!不可能!!!",
            "你狠狠的吐了一鲜血,拼尽全力最终幽毒郎君还在不甘之中化为灰烬,数百年前的一代大妖就此陨落。",
            "见到幽毒郎君陨落,炼魂郎君的残魂也是化作点点星光散去,在彻底消失前对着你轻轻笑道：吾宿命终于完成也该离去了,小家伙,人族有你,很不错。",
            "&继续。",
        ],
        nextId: 48,
    },
    48: {
        id: 48,
        title: "御龙军传说(14)",
        tips: "驱散炼魂洞内的怨魂,阻止大妖幽毒郎君破开封印。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 114,
                address: "40001,1,0",
            },
            tNpc: {
                id: 10,
                address: "40001,0,0",
            },
        },
        replace: true,
        receive: [
            "不久后炼魂洞府开始坍塌,你也被传送了出去,此时女娃也不知去那里了,只在地面上留下一排字：",
            "${role_name}我走了,期待我们下次见面哟。",
            "你：&真是个奇怪的小丫头。",
        ],
        done: [
            "重新回到无妄海岸口,拎壶冲还在原地等你。",
            "见你一人回来,拎壶冲问道：那个小女孩呢?",
            "你没有回答直接道：&走吧,我们去见识见识那传说中的御龙大将军。",
        ],
        nextId: 49,
    },
    49: {
        id: 49,
        title: "御龙军传说(15)",
        tips: "前往无妄海(1,3)击败十名骷髅骑士。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,1",
            },
            tNpc: {
                id: 10,
                address: "40001,0,2",
            },
        },
        complete: {
            freak: '2049-10'
        },
        tp: "40001,0,2",
        receive: [
            "拎壶冲：小心,前面已经接近御龙军的军营了,这里的骷髅士兵更加强大了!",
            "你点了点：&你在这等我,我去前面开路。",
        ],
        done: [
            "拎壶冲：没想到你已经这么厉害了。",
            "你：&那是自然。",
        ],
        nextId: 50,
    },
    50: {
        id: 50,
        title: "御龙军传说(16)",
        tips: "九头大蛇突然从海底钻出袭击朝你们,赶紧将它们击杀吧。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,2",
            },
        },
        complete: {
            freak: '20410-10'
        },
        tp: "40001,0,2",
        receive: [
            "这时拎壶冲突然怪叫一声：我去,那是什么东西!",
            "你连忙朝海面看过去,只见不远处的海面突然开始翻滚起来,一条条拥有就九个头颅的巨蛇朝你们袭来。",
            "你：&九头蛇!",
        ],
        done: [
            "九头大蛇看着有些吓人,实力其实与骷髅百夫长差不了太多,一只只蛇头被你斩落,这群九头蛇也发现了你不好惹纷纷退去。",
            "拎壶冲：吓死我了,我还以为我们要葬身在这里了呢。",
            "你收起手中的武器：&走吧,应该马上就可以见到御龙大将军了!",
        ],
        nextId: 51,
    },
    51: {
        id: 51,
        title: "御龙军传说(17)",
        tips: "九头大蛇的血液引来了无数骷髅护卫,趁着包围圈还没形成赶紧突围离开。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,3",
            },
        },
        complete: {
            freak: '20411-10'
        },
        tp: "40001,0,3",
        receive: [
            "拎壶冲：不好,远处的骷髅护卫闻到了九头大蛇的血腥味朝我们围过来,我们必须赶紧突围!",
            "你点了点头：&跟紧我。",
        ],
        done: [
            "终于你一路护着拎壶冲杀出了骷髅护卫的包围,不过这时天空传来一道怪异的叫声,声音似龙似鹰。",
            "你与拎壶冲连忙抬头看去,只见空中出群一大群的龙身鹰首的骷髅怪物,它们的背上则是站着一名名骷髅剑士,正是传说中的龙鹰剑士。",
            "&继续",
        ],
        nextId: 52,
    },
    52: {
        id: 52,
        title: "御龙军传说(18)",
        tips: "龙鹰剑士正在召集其他化为骷髅的御龙军,必须赶紧解决它们。",
        type: 1,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,3",
            },
        },
        complete: {
            freak: '20412-10'
        },
        tp: "40001,0,3",
        replace: true,
        receive: [
            "不过龙鹰剑士并没有立即对你与拎壶冲发起攻击,而是盘旋的上空让脚下的龙鹰不断发出那似龙似鹰的叫声!",
            "拎壶冲：它们为什么不攻击?",
            "你脸色一变：他们在暴露我们的位置,我们必须赶紧解决他们!",
            "&继续",

        ],
        done: [
            "龙鹰剑士实力强横,在空中不断的袭击,你护着拎壶冲完全没办法将它们甩开,无数的骷髅士兵也开始如潮水般从四面八方汇聚而来。",
            "见此拎壶冲明白如果在拖下去两人都得葬身在无妄海,当即便下定决心：${role_name}你先走了,我来替你断后。",
            "看着一脸准备赴死的拎壶冲,你淡淡道：&放心,我们暂时还死不了。",
        ],
        nextId: 53,
    },
    53: {
        id: 53,
        title: "御龙军传说(19)",
        tips: "传说中的御龙大将军突然出现,仅仅是气势便令你感到窒息。",
        type: 2,
        reward: {
            attr: "exp-20000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,3",
            },
            tNpc: {
                id: 117,
                address: "40001,0,4",
            },
        },
        replace: true,
        receive: [
            "话音刚落便见无数骷髅士兵突然停止了攻击,仿佛是感应到了什么一样,纷纷朝一个方向跪下。",
            "只见在那个方向出现一尊身着金甲,手持一柄黑色战枪的骷髅,空洞的双瞳跳动着一道诡异的火焰,犹如尸山血海浇铸而成的血色火焰。",
            "见到这犹如王者般的可怕气势,拎壶冲身体不由得一颤：御龙大将军!",
            "此刻你也是如临大敌挡在拎壶冲前面,从御龙大将军身上你第一次认识到什么才是真正强者,仅仅是身上的气势就压的你喘不过气来。",
            "御龙大将军：&两个小辈,你们来此为何",
        ],
        done: [
            "说罢便见御龙大将军一只森白的骨手一挥,那从四面八方聚集的骷髅士兵便全部如潮水便退出。",
            "你与拎壶冲相视一眼互相都看到了对方眼中的惊讶,这御龙大将军竟然还存在意识,当即都开口恭敬道。",
            "晚辈拎壶冲,见过大将军!",
            "&晚辈${role_name},见过大将军!",
        ],
        nextId: 54,
    },
    54: {
        id: 54,
        title: "御龙军传说(20)",
        tips: "御龙大将军竟然愿意将传说中的馒头给你,赶紧与他对话了解原因!",
        type: 2,
        reward: {
            attr: "exp-100000,world-500",
            tael: 200000,
            yuanbao: 200,

        },
        grand: {
            npc: {
                id: 117,
                address: "40001,0,4",
            },
        },
        replace: true,
        receive: [
            "御龙大将军：如果我没猜错,你们来此是为了传说中的馒头。",
            "来无妄海的目的瞬间就被拆穿,拎壶冲当即就吓得瑟瑟发抖,要知道御龙大将军的实力如此可怕,他说什么也不会来这里作死。",
            "你也是一愣,不过也立即冷静下来道：没错,不过路上听说此物已在大将军手中,既然如此不知可否让晚辈二人离去。",
            "听到你的话拎壶冲也是连忙点头,然后小心翼翼的看向御龙大将军,虽然后者此时只是一具骷髅,没有任何表情,但那瞳孔中诡异火焰仿佛是在思考什么一般。",
            "片刻后御龙大将军才缓缓开口道：${role_name},我可以将传说中的馒头给你!",
            "拎壶冲：什么!!!",
            "你：&什么!!!",
        ],
        done: [
            "御龙大将军：当然馒头不是白给,我需要你帮我做三件事!",
            "听到这话你才松了一口气,果然世上没有白送的午餐,当即问道：不知大将军有什么需要晚辈的呢?",
            "御龙大将军：映月崖,乾坤洞!",
            "&开启主线【遗弃之地】",
        ],
        nextId: 55,
    },
}