module.exports = {
    55: {
        id: 55,
        title: "遗弃之地(1)",
        tips: "映月崖,乾坤洞,拎壶冲似乎知道这个地方!",
        type: 2,
        level: 40,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,4",
            },
        },
        receive: [
            "拎壶冲：不行,绝对不行!",
            "你：&???",
        ],
        done: [
            "拎壶冲当即就解释道：映月崖,乾坤洞是一处被天道遗弃的地方,无论是人,仙,妖只要踏入那片地方轻则化此生修为永远停滞不前,重则化为行尸走肉,万劫不复!",
            "这时一旁的御龙大将军也点了点头：这小家伙说的没错,那个鬼地方,纵然是我生前一个不慎也会落得万劫不复的下场。",
            "你顿时倒吸一口凉气,映月崖,乾坤洞,恐怖如斯。",
            "&继续",
        ],
        nextId: 56,
    },
    56: {
        id: 56,
        title: "遗弃之地(2)",
        tips: "拎壶冲身上突然不断出现尸斑,陷入生死垂危之际,你只能答应御龙大将军前往映月崖。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 10,
                address: "40001,0,3",
            },
            tNpc: {
                id: 117,
                address: "40001,0,4",
            },
        },
        receive: [
            "如此危险的地方,你心里也开始打起来了退堂鼓,不过这时拎壶冲却突然一口鲜血喷出,脸色惨白。",
            "你连忙扶住拎壶冲却看到后者的身体竟然出现了一道道如同死人般的尸斑。",
            "你顿时一惊看向御龙大将军：大将军,他这是?",
            "御龙大将军却如同没听到你的话一样,瞳孔中血色火焰似是带着几分玩味就这淡淡的盯着你。",
            "见此你深深的吸了一口气道：&晚辈愿前往映月崖。",
        ],
        done: [
            "御龙大将军：映月崖有一位守崖人,他会告诉你接下来要做什么。",
            "你看了一眼此时陷入昏迷不醒的拎壶冲,眉头微微一皱：大将军,不打算先出手救人?",
            "御龙大将军：我也救不了他,不过等你从遗弃之地回来,你自会知道如何救他。",
            "听到这话你微微一愣：&我?",
        ],
        nextId: 57,
    },
    57: {
        id: 57,
        title: "遗弃之地(3)",
        tips: "不知不觉中你被腐肉行尸群包围了,赶快杀出突围吧。",
        type: 1,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20010,
                address: "10003,0,0",
            },
        },
        complete: {
            freak: '20010-15'
        },
        tp: "10003,0,0",
        receive: [
            "恍惚间,你只觉一股强大的力量将笼罩,下一秒便出现在一片陌生的荒野上。",
            "只见这里的天空都是一片阴暗被笼罩在一片灰色迷雾中,空气也是稀薄无比就连呼吸都有些困难。",
            "这时你突然发现不知何时自己竟然一群肉身干枯的行尸给包围了。",
            "&继续",
        ],
        done: [
            "一路杀出包围圈,你也累的够呛：真是一群难缠的家伙,看来这里就是映月崖了!",
            "因为在刚刚的战斗中你明显感觉到自身的法力都受到了天地的压制,一身修为发挥不出五成。",
            "&沙沙沙!",
        ],
        nextId: 58,
    },
    58: {
        id: 58,
        title: "遗弃之地(3)",
        tips: "你刚刚从行尸群杀出重围,又被一群可怕的八眼魔蛛盯上。",
        type: 1,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20011,
                address: "10003,0,0",
            },
            tNpc: {
                id: 20012,
                address: "10003,0,0",
            }
        },
        complete: {
            freak: '20011-15'
        },
        tp: "10003,0,0",
        receive: [
            "这时你又听到耳边传来一阵动静,你顺着声音看过去只见荒野中一只只紫色蜘蛛朝你爬了过来。",
            "只见这些蜘蛛身上竟然长着八只眼睛在昏暗的环境下显得极为诡异。",
            "你：&击退蛛潮",
        ],
        done: [
            "你正催动着体内的法力击杀这源源不断的八眼魔蛛,突然感觉到不远处似乎有一道目光注视着你。",
            "只见那人有些年迈,身着蓑衣,半躺在在一块岩石上似是有几分玩味的看着你,随即抬手轻轻的打了个响指。",
            "响指落下,便见成千上万的八眼魔蛛身上燃烧起森白的火焰,不到一息间就化为灰烬。",
            "你一脸震惊：&这又是什么神仙?",
        ],
        nextId: 59,
    },
    59: {
        id: 59,
        title: "遗弃之地(4)",
        tips: "突然出现神秘老者出手相助,上前去感谢一下吧。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20012,
                address: "10003,0,0",
            }
        },
        replace: true,
        receive: [
            "你：晚辈${role_name},多谢前辈出手。",
            "蓑衣老者：好久没见到活人了,小家伙这里可不是什么好地方,还是赶紧离开吧。",
            "你：&多谢前辈好意,不知晚辈可知道守崖人。",
        ],
        done: [
            "守崖人!",
            "蓑衣老者顿时神情一震,片刻后才收起之前的玩味仔细的打量起你来。",
            "见到蓑衣老者的反应,你眼前瞬间一亮：&前辈真的知道守崖人,不知可否告诉晚辈他的下落。",
        ],
        nextId: 60,
    },
    60: {
        id: 60,
        title: "遗弃之地(5)",
        tips: "强大的蓑衣老者突然就要动手杀你,赶紧出招迎战吧。",
        type: 1,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20012,
                address: "10003,0,0",
            },
            freak: [
                {
                    id: 20012,
                    address: "10003,0,0",
                }
            ]
        },
        receive: [
            "这时蓑衣老者突然看着你问道：小衍让你来的?",
            "你摇了摇头：晚辈并不认识张衍。",
            "话音刚落蓑衣老者便突然爆怒,一双干瘦到不像人类的枯掌朝你拍来：既然如此,那你就去死吧!",
            "你顿时大惊,&迎战蓑衣老者",
        ],
        done: [
            "几招之后蓑衣老者突然收手,点头道：还不错,不愧是小衍那臭小子看中的人。",
            "你则是被弄的一脸茫然,搞不清这究竟是什么情况。",
            "这时蓑衣老者才轻轻一笑：小家伙,我就是你要找的守崖人。",
            "你：&你是守崖人!!!",
        ],
        nextId: 61,
    },
    61: {
        id: 61,
        title: "遗弃之地(6)",
        tips: "原来蓑衣老者就是守崖人,朝他询问御龙大将军让你来此的原因。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20014,
                address: "10003,0,0",
            },
        },
        receive: [
            "守崖人：没错,我就是守崖人,小衍就是让你来此处的御龙大将军。",
            "你：&前辈既然就是守崖人,为何要朝我出手?",
            "守崖人：你可知小衍让你来此事做什么?",
            "你摇了摇头：&不知,将军只找到前辈就知道了。",
        ],
        done: [
            "守崖人：映月崖中有一处秘境,名为乾坤洞,洞内镇压着一尊大妖名为蚩梦。",
            "你：大将军让我来此难道是因为这大妖?",
            "守崖人神色复杂的点了点头：小衍让你就是想将大妖蚩梦从乾坤洞中释放。",
            "你：&释放大妖!!!",
        ],
        nextId: 62,
    },
    62: {
        id: 62,
        title: "遗弃之地(7)",
        tips: "原来蓑衣老者就是守崖人,朝他询问御龙大将军让你来此的原因。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20014,
                address: "10003,0,0",
            },
        },
        receive: [
            "对于你的反应守崖人并没有觉得意外,只是静静的看着你：现在你还要进乾坤洞?",
            "你：大将军此举是为何呢?",
            "守崖人没有回答,只淡淡的看着你。",
            "见此你沉思了一下：请前辈告诉晚辈乾坤洞如何进入乾坤洞。",
            "瞬间守崖人便沉默了下来。",
        ],
        done: [
            "片刻后守崖人才缓缓开口：你可知大妖出世,我人族必将遭受浩劫!",
            "你：晚辈认为万物皆有阴阳两面,所以还是想去乾坤洞看看在做决定。",
            "守崖人神色复杂的看了你一眼：难怪小衍会让你来，你随我来。",
            "&乾坤洞入口",
        ],
        nextId: 62,
    },
    63: {
        id: 63,
        title: "遗弃之地(8)",
        tips: "乾坤洞入口到处是毒蝎拦住了去路，必须先将拦住去路的毒蝎清理。",
        type: 1,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20014,
                address: "10003,0,1",
            },
        },
        complete: {
            freak: '20016-15'
        },
        tp: "10003,0,0",
        receive: [
            "你随着守崖人一路来到一处峡谷口，入口处蝎子，毒蛇随处可见，更深处则是弥漫着一层灰雾完全看不清。",
            "你：这里面莫非就是乾坤洞？",
            "守崖人点了点头：自古以来踏入乾坤洞者，还没有人能安然无恙的出来，小家伙希望你能好运吧。",
            "你：&多谢前辈！",
        ],
        done: [
            "清理完毒蝎后你明显感觉到体内产生了一股灰色的邪气，受到邪气侵蚀后你感受到法力似乎都变得浑浊起来。",
            "你面露惊诧：&这是？",
        ],
        nextId: 64,
    },
    64: {
        id: 64,
        title: "遗弃之地(9)",
        tips: "周围的毒蛇朝你聚拢过来，赶紧将它们驱除。",
        type: 1,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20017,
                address: "10003,0,1",
            },
        },
        complete: {
            freak: '20017-15'
        },
        tp: "10003,0,0",
        receive: [
            "你能感觉到任由这邪气侵蚀一身修为怕是要彻底散尽。",
            "嘶，嘶！",
            "你正欲催动法力将体内的邪气镇压，这时周围的毒蛇朝你聚拢过来。",
            "&击退毒蛇",
        ],
        done: [
            "你击退毒蛇群之后体内邪气有多出了几分连忙盘腿打坐祛除邪气。",
            "半响后你发现这诡异的邪气竟然无法驱除，只能暂时放着不管先进乾坤洞。",
            "&乾坤洞",
        ],
        nextId: 65,
    },
    65: {
        id: 65,
        title: "遗弃之地(10)",
        tips: "周围的毒蛇朝你聚拢过来，赶紧将它们驱除。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20018,
                address: "10003,0,1",
            },
        },
        replace: true,
        receive: [
            "当即你踏入乾坤洞之后顿时被眼前这一幕惊呆了。",
            "天道遗弃之地，在你的认知中应该是破败不堪，甚至暗无天日。",
            "落入眼中一片安逸的山谷，谷内鸟语花香，谷中心是一座小湖，湖面中心是一棵大树，一间小木屋便搭建在大树那盘根交错的巨大树根上。",
            "一名紫衣女子正大树下荡着秋千，如此美妙景象说是一副画都不为过。",
            "你：&在下${role_name},见过前辈。",
        ],
        done: [
            "听到声音秋千上的紫衣女子眼眸微斜打量了你一眼，然后又若无其事的收了回去。",
            "对于紫衣女子的淡漠无视，你尴尬一笑倒也没太在意，当即便准备离开这山谷。",
            "&继续",
        ],
        nextId: 66,
    },
    66: {
        id: 66,
        title: "遗弃之地(11)",
        tips: "周围的毒蛇朝你聚拢过来，赶紧将它们驱除。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20018,
                address: "10003,0,2",
            },
        },
        receive: [
            "此时你才发现之前进入山谷的入口早不见踪影了，这座山谷四面又都是石壁没有任何的出口。",
            "只能从上方飞出这座山谷，只是下一秒你就发现丹田中的法力竟然一潭死水般无法调动半分，可以说此时的你与凡人无异。",
            "正当你惊慌时察觉到秋千上那名紫衣女子此时正一脸戏谑的看着你。",
            "稳了稳心神你明白这紫衣女子定然知道无法调用法力的原因，正要尝试开口询问，后者又一脸淡漠的收回了目光。",
            "你：&......"
        ],
        done: [
            "见紫衣女子这淡漠的样子，心想真是个高冷的女人。",
            "只是这山谷就紫衣女子一人，自己想要恢复法力离开这里只想办法与她搭讪。",
            "&继续",
        ],
        nextId: 67,
    },
    67: {
        id: 67,
        title: "遗弃之地(11)",
        tips: "周围的毒蛇朝你聚拢过来，赶紧将它们驱除。",
        type: 2,
        reward: {
            attr: "exp-100000",
        },
        grand: {
            npc: {
                id: 20018,
                address: "10003,0,2",
            },
        },
        receive: [
            "蚩梦：人族小子，。",
            "只能从上方飞出这座山谷，只是下一秒你就发现丹田中的法力竟然一潭死水般无法调动半分，可以说此时的你与凡人无异。",
            "正当你惊慌时察觉到秋千上那名紫衣女子此时正一脸戏谑的看着你。",
            "稳了稳心神你明白这紫衣女子定然知道无法调用法力的原因，正要尝试开口询问，后者又一脸淡漠的收回了目光。",
            "你：&......"
        ],
        done: [
            "见紫衣女子这淡漠的样子，你揉了揉鼻子心想真是个高冷的女人。",
            "&继续",
        ],
        nextId: 67,
    }
}