// 技能类型type 1:消耗品 2:buff丹药 3:装备 4:卷轴 5:材料 6:任务 7:杂物
// group 1 直接改变某属性（例如恢复药，声望卷轴,元宝卡,银票，勋章宝石一类)
// group 2 buff类型 如双倍经验卡，临时提升属性的丹药

const articleMap = {
    170: {
        n: '①级生命宝石',
        gem: 11,
        value: 'life_max-10000',
        tips: '嵌入装备内可提升10000生命上限,也可合成更高级宝石。',
    },
    171: {
        gem: 21,
        n: '②级生命宝石',
        value: 'life_max-15000',
        tips: '嵌入装备内可提升15000生命上限,也可合成更高级宝石。',
    },
    172: {
        gem: 31,
        n: '③级生命宝石',
        value: 'life_max-20000',
        tips: '嵌入装备内可提升20000生命上限,也可合成更高级宝石。',
    },
    173: {
        gem: 41,
        n: '④级生命宝石',
        value: 'life_max-30000',
        tips: '嵌入装备内可提升30000生命上限,也可合成更高级宝石。',
    },
    174: {
        gem: 51,
        n: '⑤级生命宝石',
        value: 'life_max-50000',
        tips: '嵌入装备内可提升50000生命上限,也可合成更高级宝石。',
    },
    175: {
        gem: 61,
        n: '⑥级生命宝石',
        value: 'life_max-75000',
        tips: '嵌入装备内可提升75000生命上限,也可合成更高级宝石。',
    },
    176: {
        gem: 71,
        n: '⑦级生命宝石',
        value: 'life_max-100000',
        tips: '嵌入装备内可提升100000生命上限,也可合成更高级宝石。',
    },
    177: {
        gem: 81,
        n: '⑧级生命宝石',
        value: 'life_max-125000',
        tips: '嵌入装备内可提升125000生命上限,也可合成更高级宝石。',
    },
    178: {
        gem: 91,
        n: '⑨级生命宝石',
        value: 'life_max-150000',
        tips: '嵌入装备内可提升150000生命上限,也可合成更高级宝石。',
    },
    179: {
        gem: 101,
        n: '⑩级生命宝石',
        value: 'life_max-200000',
        tips: '嵌入装备内可提升200000生命上限。',
    },
    1710: {
        gem: 12,
        n: '①级法力宝石',
        value: 'mana_max-10000',
        tips: '嵌入装备内可提升10000法力上限,也可合成更高级宝石。',
    },
    1711: {
        gem: 22,
        n: '②级法力宝石',
        value: 'mana_max-15000',
        tips: '嵌入装备内可提升15000法力上限,也可合成更高级宝石。',
    },
    1712: {
        gem: 32,
        n: '③级法力宝石',
        value: 'mana_max-20000',
        tips: '嵌入装备内可提升20000法力上限,也可合成更高级宝石。',
    },
    1713: {
        gem: 42,
        n: '④级法力宝石',
        value: 'mana_max-30000',
        tips: '嵌入装备内可提升30000法力上限,也可合成更高级宝石。',
    },
    1714: {
        gem: 52,
        n: '⑤级法力宝石',
        value: 'mana_max-50000',
        tips: '嵌入装备内可提升50000法力上限,也可合成更高级宝石。',
    },
    1715: {
        gem: 62,
        n: '⑥级法力宝石',
        value: 'mana_max-75000',
        tips: '嵌入装备内可提升75000法力上限,也可合成更高级宝石。',
    },
    1716: {
        gem: 72,
        n: '⑦级法力宝石',
        value: 'mana_max-100000',
        tips: '嵌入装备内可提升100000法力上限,也可合成更高级宝石。',
    },
    1717: {
        gem: 82,
        n: '⑧级法力宝石',
        value: 'mana_max-125000',
        tips: '嵌入装备内可提升125000法力上限,也可合成更高级宝石。',
    },
    1718: {
        gem: 92,
        n: '⑨级法力宝石',
        value: 'mana_max-150000',
        tips: '嵌入装备内可提升150000法力上限,也可合成更高级宝石。',
    },
    1719: {
        gem: 102,
        n: '⑩级法力宝石',
        value: 'mana_max-200000',
        tips: '嵌入装备内可提升200000法力上限。',
    },
    1720: {
        gem: 13,
        n: '①级攻击宝石',
        value: 'atk-1000',
        tips: '嵌入装备内可提升1000攻击上限,也可合成更高级宝石。',
    },
    1721: {
        gem: 23,
        n: '②级攻击宝石',
        value: 'atk-1500',
        tips: '嵌入装备内可提升1500攻击上限,也可合成更高级宝石。',
    },
    1722: {
        gem: 33,
        n: '③级攻击宝石',
        value: 'atk-2000',
        tips: '嵌入装备内可提升2000攻击上限,也可合成更高级宝石。',
    },
    1723: {
        gem: 43,
        n: '④级攻击宝石',
        value: 'atk-3000',
        tips: '嵌入装备内可提升3000攻击上限,也可合成更高级宝石。',
    },
    1724: {
        gem: 53,
        n: '⑤级攻击宝石',
        value: 'atk-5000',
        tips: '嵌入装备内可提升5000攻击上限,也可合成更高级宝石。',
    },
    1725: {
        gem: 63,
        n: '⑥级攻击宝石',
        value: 'atk-7500',
        tips: '嵌入装备内可提升7500攻击上限,也可合成更高级宝石。',
    },
    1726: {
        gem: 73,
        n: '⑦级攻击宝石',
        value: 'atk-10000',
        tips: '嵌入装备内可提升10000攻击上限,也可合成更高级宝石。',
    },
    1727: {
        gem: 83,
        n: '⑧级攻击宝石',
        value: 'atk-12500',
        tips: '嵌入装备内可提升12500攻击上限,也可合成更高级宝石。',
    },
    1728: {
        gem: 93,
        n: '⑨级攻击宝石',
        value: 'atk-15000',
        tips: '嵌入装备内可提升15000攻击上限,也可合成更高级宝石。',
    },
    1729: {
        gem: 103,
        n: '⑩级攻击宝石',
        value: 'atk-20000',
        tips: '嵌入装备内可提升20000攻击上限。',
    },
    1730: {
        gem: 14,
        n: '①级防御宝石',
        value: 'dfs-500',
        tips: '嵌入装备内可提升500防御上限,也可合成更高级宝石。',
    },
    1731: {
        gem: 24,
        n: '②级防御宝石',
        value: 'dfs-750',
        tips: '嵌入装备内可提升750防御上限,也可合成更高级宝石。',
    },
    1732: {
        gem: 34,
        n: '③级防御宝石',
        value: 'dfs-1000',
        tips: '嵌入装备内可提升1000防御上限,也可合成更高级宝石。',
    },
    1733: {
        gem: 44,
        n: '④级防御宝石',
        value: 'dfs-1500',
        tips: '嵌入装备内可提升1500防御上限,也可合成更高级宝石。',
    },
    1734: {
        gem: 54,
        n: '⑤级防御宝石',
        value: 'dfs-2500',
        tips: '嵌入装备内可提升2500防御上限,也可合成更高级宝石。',
    },
    1735: {
        gem: 64,
        n: '⑥级防御宝石',
        value: 'dfs-3750',
        tips: '嵌入装备内可提升3750防御上限,也可合成更高级宝石。',
    },
    1736: {
        gem: 74,
        n: '⑦级防御宝石',
        value: 'dfs-5000',
        tips: '嵌入装备内可提升5000防御上限,也可合成更高级宝石。',
    },
    1737: {
        gem: 84,
        n: '⑧级防御宝石',
        value: 'dfs-6250',
        tips: '嵌入装备内可提升6250防御上限,也可合成更高级宝石。',
    },
    1738: {
        gem: 94,
        n: '⑨级防御宝石',
        value: 'dfs-7500',
        tips: '嵌入装备内可提升7500防御上限,也可合成更高级宝石。',
    },
    1739: {
        gem: 104,
        n: '⑩级防御宝石',
        value: 'dfs-10000',
        tips: '嵌入装备内可提升10000防御上限。',
    },
    1740: {
        gem: 15,
        n: '①级命中宝石',
        value: 'hit-100',
        tips: '嵌入装备内可提升100命中上限,也可合成更高级宝石。',
    },
    1741: {
        gem: 25,
        n: '②级命中宝石',
        value: 'hit-150',
        tips: '嵌入装备内可提升150命中上限,也可合成更高级宝石。',
    },
    1742: {
        gem: 35,
        n: '③级命中宝石',
        value: 'hit-200',
        tips: '嵌入装备内可提升200命中上限,也可合成更高级宝石。',
    },
    1743: {
        gem: 45,
        n: '④级命中宝石',
        value: 'hit-300',
        tips: '嵌入装备内可提升300命中上限,也可合成更高级宝石。',
    },
    1744: {
        gem: 55,
        n: '⑤级命中宝石',
        value: 'hit-500',
        tips: '嵌入装备内可提升500命中上限,也可合成更高级宝石。',
    },
    1745: {
        gem: 65,
        n: '⑥级命中宝石',
        value: 'hit-750',
        tips: '嵌入装备内可提升750命中上限,也可合成更高级宝石。',
    },
    1746: {
        gem: 75,
        n: '⑦级命中宝石',
        value: 'hit-1000',
        tips: '嵌入装备内可提升1000命中上限,也可合成更高级宝石。',
    },
    1747: {
        gem: 85,
        n: '⑧级命中宝石',
        value: 'hit-1250',
        tips: '嵌入装备内可提升1250命中上限,也可合成更高级宝石。',
    },
    1748: {
        gem: 95,
        n: '⑨级命中宝石',
        value: 'hit-1500',
        tips: '嵌入装备内可提升1500命中上限,也可合成更高级宝石。',
    },
    1749: {
        gem: 105,
        n: '⑩级命中宝石',
        value: 'hit-2000',
        tips: '嵌入装备内可提升2000命中上限。',
    },
    1750: {
        gem: 16,
        n: '①级闪避宝石',
        value: 'dodge-100',
        tips: '嵌入装备内可提升100闪避上限,也可合成更高级宝石。',
    },
    1751: {
        gem: 26,
        n: '②级闪避宝石',
        value: 'dodge-150',
        tips: '嵌入装备内可提升150闪避上限,也可合成更高级宝石。',
    },
    1752: {
        gem: 36,
        n: '③级闪避宝石',
        value: 'dodge-200',
        tips: '嵌入装备内可提升200闪避上限,也可合成更高级宝石。',
    },
    1753: {
        gem: 46,
        n: '④级闪避宝石',
        value: 'dodge-300',
        tips: '嵌入装备内可提升300闪避上限,也可合成更高级宝石。',
    },
    1754: {
        gem: 56,
        n: '⑤级闪避宝石',
        value: 'dodge-500',
        tips: '嵌入装备内可提升500闪避上限,也可合成更高级宝石。',
    },
    1755: {
        gem: 66,
        n: '⑥级闪避宝石',
        value: 'dodge-750',
        tips: '嵌入装备内可提升750闪避上限,也可合成更高级宝石。',
    },
    1756: {
        gem: 76,
        n: '⑦级闪避宝石',
        value: 'dodge-1000',
        tips: '嵌入装备内可提升1000闪避上限,也可合成更高级宝石。',
    },
    1757: {
        gem: 86,
        n: '⑧级闪避宝石',
        value: 'dodge-1250',
        tips: '嵌入装备内可提升1250闪避上限,也可合成更高级宝石。',
    },
    1758: {
        gem: 96,
        n: '⑨级闪避宝石',
        value: 'dodge-1500',
        tips: '嵌入装备内可提升1500闪避上限,也可合成更高级宝石。',
    },
    1759: {
        gem: 106,
        n: '⑩级闪避宝石',
        value: 'dodge-2000',
        tips: '嵌入装备内可提升2000闪避上限。',
    },
    1760: {
        gem: 17,
        n: '①级暴击宝石',
        value: 'sudden-100',
        tips: '嵌入装备内可提升100暴击上限,也可合成更高级宝石。',
    },
    1761: {
        gem: 27,
        n: '②级暴击宝石',
        value: 'sudden-150',
        tips: '嵌入装备内可提升150暴击上限,也可合成更高级宝石。',
    },
    1762: {
        gem: 37,
        n: '③级暴击宝石',
        value: 'sudden-200',
        tips: '嵌入装备内可提升200暴击上限,也可合成更高级宝石。',
    },
    1763: {
        gem: 47,
        n: '④级暴击宝石',
        value: 'sudden-300',
        tips: '嵌入装备内可提升300暴击上限,也可合成更高级宝石。',
    },
    1764: {
        gem: 57,
        n: '⑤级暴击宝石',
        value: 'sudden-500',
        tips: '嵌入装备内可提升500暴击上限,也可合成更高级宝石。',
    },
    1765: {
        gem: 67,
        n: '⑥级暴击宝石',
        value: 'sudden-750',
        tips: '嵌入装备内可提升750暴击上限,也可合成更高级宝石。',
    },
    1766: {
        gem: 77,
        n: '⑦级暴击宝石',
        value: 'sudden-1000',
        tips: '嵌入装备内可提升1000暴击上限,也可合成更高级宝石。',
    },
    1767: {
        gem: 87,
        n: '⑧级暴击宝石',
        value: 'sudden-1250',
        tips: '嵌入装备内可提升1250暴击上限,也可合成更高级宝石。',
    },
    1768: {
        gem: 97,
        n: '⑨级暴击宝石',
        value: 'sudden-1500',
        tips: '嵌入装备内可提升1500暴击上限,也可合成更高级宝石。',
    },
    1769: {
        gem: 107,
        n: '⑩级暴击宝石',
        value: 'sudden-2000',
        tips: '嵌入装备内可提升2000暴击上限。',
    },
}

module.exports = {
    getArticleList: function () {
        Object.keys(articleMap).map((id) => ({
            ...articleMap[id],
            id,
        }))
    },
    getArticle: function (articleId) {
        if (!articleMap[articleId]) {
            console.log('未找到物品：', articleId);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}
