// 技能类型type 1:消耗品 2:buff丹药 3:装备 4:卷轴 5:材料 6:任务 7:杂物
// group 1 直接改变某属性（例如恢复药，声望卷轴,元宝卡,银票，勋章宝石一类)
// group 2 buff类型 如双倍经验卡，临时提升属性的丹药

const articleMap = {
    160: {
        n: '1级房屋宝石',
        group1: 'fw-100',
        tips: '1级房屋宝石，使用后可增加100点房屋清洁。',
    },
    161: {
        n: '2级房屋宝石',
        group1: 'fw-200',
        tips: '2级房屋宝石，使用后可增加200点房屋清洁。',
    },
    162: {
        n: '3级房屋宝石',
        group1: 'fw-300',
        tips: '3级房屋宝石，使用后可增加300点房屋清洁。',
    },
    163: {
        n: '4级房屋宝石',
        group1: 'fw-500',
        tips: '4级房屋宝石，使用后可增加500点房屋清洁。',
    },
    164: {
        n: '5级房屋宝石',
        group1: 'fw-1000',
        tips: '5级房屋宝石，使用后可增加1000点房屋清洁。',
    },
    165: {
        n: '1级勋章宝石',
        group1: 'xz-100',
        tips: '1级勋章宝石，使用后可增加100点勋章荣誉。',
    },
    166: {
        n: '2级勋章宝石',
        group1: 'xz-200',
        tips: '2级勋章宝石，使用后可增加200点勋章荣誉。',
    },
    167: {
        n: '3级勋章宝石',
        group1: 'xz-300',
        tips: '3级勋章宝石，使用后可增加300点勋章荣誉。',
    },
    168: {
        n: '4级勋章宝石',
        group1: 'xz-500',
        tips: '4级勋章宝石，使用后可增加500点勋章荣誉。',
    },
    169: {
        n: '5级勋章宝石',
        group1: 'xz-1000',
        tips: '5级勋章宝石，使用后可增加1000点勋章荣誉。',
    },
    1610: {
        n: '1级令牌宝石',
        group1: 'lp-100',
        tips: '1级令牌宝石，使用后可增加100点令牌忠义。',
    },
    1611: {
        n: '2级令牌宝石',
        group1: 'lp-200',
        tips: '2级令牌宝石，使用后可增加200点令牌忠义。',
    },
    1612: {
        n: '3级令牌宝石',
        group1: 'lp-300',
        tips: '3级令牌宝石，使用后可增加300点令牌忠义。',
    },
    1613: {
        n: '4级令牌宝石',
        group1: 'lp-500',
        tips: '4级令牌宝石，使用后可增加500点令牌忠义。',
    },
    1614: {
        n: '5级令牌宝石',
        group1: 'lp-1000',
        tips: '5级令牌宝石，使用后可增加1000点令牌忠义。',
    },
    1615: {
        n: '1级徽标宝石',
        group1: 'hb-100',
        tips: '1级徽标宝石，使用后可增加100点徽标名望。',
    },
    1616: {
        n: '2级徽标宝石',
        group1: 'hb-200',
        tips: '2级徽标宝石，使用后可增加200点徽标名望。',
    },
    1617: {
        n: '3级徽标宝石',
        group1: 'hb-300',
        tips: '3级徽标宝石，使用后可增加300点徽标名望。',
    },
    1618: {
        n: '4级徽标宝石',
        group1: 'hb-400',
        tips: '4级徽标宝石，使用后可增加500点徽标名望。',
    },
    1619: {
        n: '5级徽标宝石',
        group1: 'hb-1000',
        tips: '5级徽标宝石，使用后可增加1000点徽标名望。',
    },
    1620: {
        n: '玉瓷百花瓶',
        value: 'fw-1000',
        tips: '摆放在房屋之中可获得1000清洁度,通过炼魂洞副本概率掉落',
    },
    1621: {
        n: '檀木花纹桌',
        value: 'fw-2000',
        tips: '摆放在房屋之中可获得2000清洁度,通过炼魂洞副本概率掉落',
    },
    1622: {
        n: '红杏闹春帘',
        value: 'fw-3000',
        tips: '摆放在房屋之中可获得3000清洁度,通过炼魂洞副本概率掉落',
    },
    1623: {
        n: '日月春秋床',
        value: 'fw-5000',
        tips: '摆放在房屋之中可获得5000清洁度,通过炼魂洞副本概率掉落',
    },
    1624: {
        n: '锦绣山河画',
        value: 'fw-10000',
        tips: '摆放在房屋之中可获得10000清洁度,通过炼魂洞副本概率掉落',
    },
    1625: {
        n: '江山社稷图',
        value: 'fw-20000',
        tips: '摆放在房屋之中可获得20000清洁度,通过炼魂洞副本概率掉落',
    },
    1626: {
        n: '九州观星台',
        value: 'fw-50000',
        tips: '摆放在房屋之中可获得50000清洁度,通过炼魂洞副本概率掉落',
    },
    1627: {
        n: '玄机符',
        tips: '蕴含神秘力量，可以用来更换聚宝盆目标奖励。',
    },
    1628: {
        n: '经验丹',
        price: 100,
        unit: 'yuanbao',
        effect: {
            exp: 100000,
            condition: 30
        },
        tips: '角色等级低于30级时使用，等级直接+1，30级及以上可获得100000经验。',
    },
    1629: {
        n: '人参果',
        price: 200,
        unit: 'yuanbao',
        effect: {
            exp: 10000000,
            condition: 50
        },
        tips: '角色等级低于50级时使用，等级直接+1，50级及以上可获得10000000经验。',
    },
    1630: {
        n: '猫耳朵',
        price: 500,
        unit: 'yuanbao',
        effect: {
            exp: 100000000,
            condition: 70,
        },
        tips: '角色等级低于70级时使用，等级直接+1，70级及以上可获得100000000经验。',
    },
    1631: {
        n: '洗髓丹',
        price: 100,
        unit: 'yuanbao',
        effect: {
            exp: 100000000,
            condition: 70
        },
        tips: '可重新分配自身的潜力。',
    },
}

module.exports = {
    getArticleList: function () {
        Object.keys(articleMap).map((id) => ({
            ...articleMap[id],
            id,
        }))
    },
    getArticle: function (articleId) {
        if (!articleMap[articleId]) {
            console.log('未找到物品：', articleId);
            return;
        }
        return JSON.parse(JSON.stringify({
            ...articleMap[id],
            id,
        }))
    }

}
