import React from 'react';

export default ({ backJuBaoPeng }) => {
    return (
        <div>
            <div>材料掉落信息</div>
            <div>======云荒大陆======</div>
            <div>风铃草(10)：云荒大陆(1,4)，皮皮猴掉落。</div>
            <div>赤炎蛛丝(10)：云荒大陆(1,5)，赤炎蜘蛛掉落。</div>
            <div>赤炎蛛腿(10)：云荒大陆(1,5)，赤炎蜘蛛掉落。</div>
            <div>灵异水(10)：云荒大陆(1,5)，灵异小妖掉落。</div>
            <div>避水丹(10)：云荒大陆(1,5)，灵异小妖掉落。</div>
            <div>======南海琉璃宫======</div>
            <div>虾嘴(25)：南海琉璃宫(1,1)，虾兵掉落。</div>
            <div>蟹壳(25)：南海琉璃宫(1,1)，蟹将掉落。</div>
            <div>紫叶草(25)：南海琉璃宫(1,2)，紫草冰精掉落。</div>
            <div>神马皮(25)：南海琉璃宫(1,2)，雷电神马掉落。</div>
            <div>巨鲸牙(25)：南海琉璃宫(1,3)，深海巨鲸掉落。</div>
            <div>======幽冥地府======</div>
            <div>幽冥草(100)：幽冥地府(1,1)，黄泉孤魂与黄泉野鬼掉落。</div>
            <div>彼岸花(100)：幽冥地府(1,2)，彼岸花妖与彼岸花灵掉落。</div>
            <div>忘川水(100)：幽冥地府(1,3)，忘川情执与忘川恨执掉落。</div>
            <div>黄泉水(100)：幽冥地府(1,4)，过去因果与未来因果掉落。</div>
            <div>幽冥火(100)：幽冥地府(1,5)，一念之恶与一念之善掉落。</div>
            <div><span onClick={backJuBaoPeng} className="g_u_end">返回上页</span></div>
        </div>

    )
}
