const TEST = {
    2999988: {
        id: 2999988,
        name: "宝石",
        type: 2,
        level: 1,
        isRanks: true,
        article: '230-20,235-20,240-20,245-20,250-20,255-20,260-20,265-20,270-20,275-20,280-20,285-20,290-20,295-20',
    },
    2999989: {
        id: 2999989,
        name: "一阶装备boss",
        type: 2,

        level: 1,
        attr: 1,
        isRanks: true,
        article: '118-200,122-200,126-200,130-200,134-200,138-200,142-200',
    },
    2999990: {
        id: 2999990,
        name: "二阶装备boss",
        type: 2,

        level: 1,
        attr: 1,
        isRanks: true,
        article: '119-200,123-200,127-200,131-200,135-200,139-200,143-200',
    },
    2999991: {
        id: 2999991,
        name: "三阶装备boss",
        type: 2,

        level: 1,
        attr: 1,
        isRanks: true,
        article: '120-200,124-200,128-200,132-200,136-200,140-200,144-200',
    },
    2999992: {
        id: 2999992,
        name: "四阶装备boss",
        type: 2,

        level: 1,
        attr: 1,
        isRanks: true,
        article: '121-200,125-200,129-200,133-200,137-200,141-200,145-200',
    },
    2999993: {
        id: 2999993,
        name: "神装boss",
        type: 2,

        level: 1,
        attr: 1,
        isRanks: true,
        article: '309-500,310-500',
    },
    2999994: {
        id: 2999994,
        name: "声望boss",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '42-5000,43-5000,45-5000',
    },
    2999995: {
        id: 2999995,
        name: "强化材料boss",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '90-5000,91-5000,92-5000,93-5000,94-5000,95-5000,96-5000,97-5000,98-5000,99-5000,100-5000,101-5000,102-5000,103-5000,104-5000,105-5000',
    },
    2999996: {
        id: 2999996,
        name: "强化石,月光石boss",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '156-30000,157-5000',
    },
    2999997: {
        id: 2999997,
        name: "帮会材料",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '53-100,54-100,55-100,56-100,57-100,58-100,59-100,60-100',
    },
    2999998: {
        id: 2999998,
        name: "家具材料",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '296-100,297-100,298-100,299-100,300-100,301-100,302-100',
    },
    2999999: {
        id: 2999999,
        name: "聚宝盆材料",
        type: 2,
        level: 1,
        attr: 1,
        isRanks: true,
        article: '207-100,208-100,209-100,210-100,211-100,212-100,213-100,214-100,215-100,216-100,217-100,218-100,219-100,220-100,221-100',
    },
}


module.exports = {
    TEST_FREAK: TEST
}