// 技能类型p 1:单攻 2:群攻 3:buff 4:天赋
// 基础数值v 升级增加up 转生rp 消耗d 目标数量t
// 增伤 atk 吸血 suck 破防 ignore
module.exports = {
    1: {
        id: 1,
        p: 1,
        n: '诸天道法',
        v: 150,
        d: 100,
        up:20,
        rp:50,
        effect: {
            atk: 10
        },
        msg: '对单个目标造成&[v]&伤害,四转可领悟伤害增幅10%。'
    },
    2: {
        id: 2,
        p: 1,
        n: '嗜血封魔',
        v: 150,
        d: 100,
        effect: {
            suck: 10
        },
        msg: '对单个目标造成&[v]&伤害,四转可领悟造成伤害10%的生命恢复。'
    },
    3: {
        id: 3,
        p: 1,
        n: '九幽断魂',
        v: 150,
        d: 100,
        effect: {
            ignore: 10
        },
        msg: '对单个目标造成&[v]&伤害,四转可领悟无视目标10%防御。'
    },
    4: {
        id: 4,
        p: 2,
        n: '无上大道',
        v: 120,
        d: 120,
        t: 2,
        msg: '对&[t]&个目标目标造成&[v]&伤害。'
    },
    5: {
        id: 5,
        p: 3,
        n: '黄泉天怒',
        t: 4,
        effect: {
            atk: 100,
            sudden: 20
        },
        msg: '暂时提升&[v]&攻击与&[v]&暴击,持续&[t]回合。'
    },
    6: {
        id: 6,
        p: 3,
        n: '大天造化',
        t: 5,
        effect: {
            life: 1000,
            dfs: 50
        },
        msg: '暂时提升&[v]&生命与&[v]&防御,持续&[t]回合。'
    },
    7: {
        id: 7,
        p: 3,
        n: '追星逐月',
        t: 5,
        effect: {
            hit: 20,
            dodge: 20,
        },
        msg: '暂时提升&[v]&命中与&[v]&闪避,持续&[t]回合。'
    },
    8: {
        id: 8,
        p: 4,
        n: '黄泉诀',
        effect: {
            life: 500,  // 1.5 2 3 4 5 7 10
        },
        msg: '提升500生命上限。'
    },
    9: {
        id: 9,
        p: 4,
        n: '圣灵诀',
        effect: {
            mana: 500,
        },
        msg: '提升500法力上限。'
    },
    10: {
        id: 10,
        p: 4,
        n: '鬼神诀',
        effect: {
            atk: 50,
        },
        msg: '提升50攻击上限。'
    },
    11: {
        id: 11,
        p: 4,
        n: '琉璃诀',
        effect: {
            dfs: 20,
        },
        msg: '提升20防御上限。'
    },
    12: {
        id: 12,
        p: 4,
        n: '洞虚诀',
        effect: {
            hit: 10,
        },
        msg: '提升10命中上限。'
    },
    13: {
        id: 13,
        p: 4,
        n: '无影诀',
        effect: {
            dodge: 10,
        },
        msg: '提升10闪避上限。'
    },
    14: {
        id: 14,
        p: 4,
        n: '鬼煞诀',
        effect: {
            sudden: 10,
        },
        msg: '提升10暴击上限。'
    },
}