// 技能类型p 1:伤害 2:buff 3:天赋
// 基础数值v 升级增加up 转生rp 消耗d 目标数量t
module.exports = {
    art: {
        1: {
            id: 1,
            p: 1,
            n: '青元剑诀',
            v: 200,
            up: 10,
            rp: 100,
            d: 100,
            t: 1,
            msg: '&[n],对单体目标目标造成&[v]伤害。',
        },
        2: {
            id: 2,
            p: 1,
            n: '太极剑法',
            v: 180,
            up: 8,
            rp: 50,
            d: 100,
            t: 3,
            msg: '&[n],对&[t]个目标目标造成&[v]伤害。'
        },
        3: {
            id: 3,
            p: 2,
            n: '道君经',
            up: 8,
            rp: 50,
            d: 100,
            t: 5,
            v: {
                atk: 500
            },
            msg: '&[n],可提升&[v]攻击,持续&[t]回合。'
        },
        4: {
            id: 4,
            p: 1,
            n: '道君指',
            v: 500,
            up: 8,
            rp: 50,
            d: 100,
            t: 5,
            msg: '&[n],对&[t]个目标目标造成&[v]伤害。'
        }
    }
}