module.exports = {
    100: {
        id: 100,
        type: 1,
        title: "序章",
        tips: "灰色古籍就在仙隐村(1,1)，翻开看看吧。",
        receive: [
            "我穿越了千年,在无尽的岁月长河中沉睡,最终忘却了一切,只为重回千年前……",
            "神秘声音：醒醒,快点醒醒!",
            "一道犹如风铃般的声音将你从沉睡中唤醒,你睁开眼发现面前是一卷灰色古籍。",
            "&翻开灰色古籍",
        ],
        done: [
            "古籍中记载了一段千年前的隐秘......",
            "千年前一位名为东坡先生的大能制作出四个馒头，分别献给了人，仙，妖三族族长。",
            "三族族长吃下馒头后实力暴涨，心中皆是衍生出称霸三族的念头。",
            "不过三族族长都吃过馒头，实力不相上下，于是都想将最后一个馒头占为己有，一场惊世大战因此爆发。",
            "神秘声音：&醒醒，快点醒醒！",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 1010,
                address: "10000,0,0"
            },
        },
        nextId: 101
    },
    101: {
        id: 101,
        type: 1,
        title: "初识狐晶丽",
        tips: "神秘少女就在仙隐村(1,1)，去和她聊聊。",
        receive: [
            "你再度睁开眼这才发现自己正躺在一棵古树下，身前则是一个看起来像是狐族的少女。",
            "少女见你醒后：你终于醒了，我们赶紧动身吧!",
            "你明明记得自己是被车撞了，此时应该是躺在医院才对，当即就是灵魂三问：&你是谁，这是什么地方，我们要去干什么？",
        ],
        done: [
            "少女：我叫狐晶丽，这里是仙隐村，现在要去剿灭黑风寨。",
            "你一句都没听懂，这时已经被少女拉到了村外，一群彪形大汉在此处来会巡逻。",
            "狐晶丽直接将你推了出去：&上吧，{name}!",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
            npc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        nextId: 102
    },
    102: {
        id: 102,
        type: 2,
        title: "惩戒巡逻山贼",
        tips: "巡逻山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        receive: [
            "你被少女不讲武德的推到一群彪形大汉面前，刚要开口解释巡逻山贼便面露凶意朝你聚了过来!",
            "巡逻山贼：什么人，兄弟们杀了他!",
            "你：&......",
        ],
        done: [
            "你艰难的打倒了几个巡逻山贼，打斗的动静就引来了更多山贼，你二话不说，拔腿就跑。",
            "胡晶丽气喘吁吁的追了上来：你不是天选者嘛，怎么这么弱？",
            "你：天选者是什么？",
            "这时身后密密麻麻的山贼已经追了过来，狐晶丽吓得脸色一白：算了，我们先回村子再说。",
            "&仙隐村",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        complete: {
            freak: "2000-2"
        },
        nextId: 103
    },
    103: {
        id: 103,
        type: 3,
        title: "全身武装",
        tips: "破旧宝箱就在仙隐村(1,1)，挑一个打开吧。",
        receive: [
            "终于你与狐晶丽成功甩开山贼回到了村子，这才开口问道：你刚刚说的天选者是什么？",
            "胡晶丽：我也不太清楚，好像是与数千年的那场三族大战有关。",
            "你微微一愣，莫非是那灰色古籍中记载为了三族族长为了争夺馒头而爆发的大战。",
            "正要开口询问狐晶丽不知道从什么地方拿出一堆破旧的箱子：放的时间有些久了，我也忘记那个箱子里面有装备，你随便挑一个吧。",
        ],
        done: [
            "你随便找了个宝箱打开，只见里面竟然有一套崭新的装备。",
            "狐晶丽&：不愧是天选者，这运气真不错。",
        ],
        action: {
            type: 1,
            text: '破旧宝箱'
        },
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 104
    },
    104: {
        id: 104,
        type: 2,
        title: "惩戒持刀山贼",
        tips: "持刀山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        receive: [
            "你刚刚换上装备就见村外有几道手持大刀的山贼，显然是他们一路找过来。",
            "狐晶丽：不好，他们竟然这么快就找来了。",
            "你信心十足：&别怕，我去收拾他们。",
        ],
        done: [
            "持刀山贼完全不是你的对手，几个回合就被你打的落荒而逃。",
            "狐晶丽：你怎么把他们放走了。",
            "你：&有什么问题？",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 105
    },

}

