const scene_list = {
    100: {
        title: "序章",
        tips: "刚刚醒来你什么都不记得了，翻开古籍了解这个世界。",
        receive: [
            "我穿越了千年,在无尽的岁月长河中沉睡,最终忘却了一切,只为重回千年前……",
            "神秘声音：醒醒,快点醒醒!",
            "一道犹如风铃般的声音将你从沉睡中唤醒,你睁开眼发现面前是一卷灰色古籍。",
            "&翻开灰色古籍",
        ],
        done: [
            "古籍中记载了一段千年前的隐秘......",
            "千年前一位名为东坡先生的大能制作出四个馒头，分别献给了人，仙，妖三族族长。",
            "三族族长吃下馒头后实力暴涨，心中皆是衍生出称霸三族的念头。",
            "不过三族族长都吃过馒头，实力不相上下，于是都想将最后一个馒头占为己有，一场惊世大战因此爆发。",
            "神秘声音：&醒醒，快点醒醒！",
        ],
    },
    101: {
        title: "初识狐晶丽",
        tips: "眼前这个神秘少女似乎认识你，去和她聊聊吧。",
        receive: [
            "你再度睁开眼这才发现自己正躺在一棵古树下，身前则是一个看起来像是狐族的少女。",
            "少女见你醒后：你终于醒了，我们赶紧动身吧!",
            "你明明记得自己是被车撞了，此时应该是躺在医院才对，当即就是灵魂三问：&你是谁，这是什么地方，我们要去干什么？",
        ],
        done: [
            "少女：我叫狐晶丽，这里是仙隐村，现在要去剿灭黑风寨。",
            "你一句都没听懂，这时已经被少女拉到了村外，一群彪形大汉在此处来会巡逻。",
            "狐晶丽直接将你推了出去：&上吧，{name}!",
        ],
    },
    102: {
        title: "天选者",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "你被少女不讲武德的推到一群彪形大汉面前，刚要开口解释巡逻山贼便面露凶意朝你聚了过来!",
            "巡逻山贼：什么人，兄弟们杀了他!",
            "你：&......",
        ],
        done: [
            "你艰难的打倒了几个巡逻山贼，打斗的动静就引来了更多山贼，你二话不说，拔腿就跑。",
            "胡晶丽气喘吁吁的追了上来：你不是天选者嘛，怎么这么弱？",
            "你：天选者是什么？",
            "这时身后密密麻麻的山贼已经追了过来，狐晶丽吓得脸色一白：算了，我们先回村子再说。",
            "&仙隐村",
        ],
    },
    103: {
        title: "全身武装",
        tips: "挑一个破旧宝箱，用里面的装备武装自己。",
        receive: [
            "终于你与狐晶丽成功甩开山贼回到了村子，这才开口问道：你刚刚说的天选者是什么？",
            "胡晶丽：我也不太清楚，好像是与数千年的那场三族大战有关。",
            "你微微一愣，莫非是那灰色古籍中记载为了三族族长为了争夺馒头而爆发的大战。",
            "正要开口询问狐晶丽不知道从什么地方拿出一堆破旧的箱子：放的时间有些久了，我也忘记那个箱子里面有装备，你随便挑一个吧。",
        ],
        done: [
            "你随便找了个宝箱打开，只见里面竟然有一套崭新的装备。",
            "狐晶丽&：不愧是天选者，这运气真不错。",
        ],
        complete: {
            freak: "2000-2"
        },
        action: {
            type: 1,
            text: '破旧宝箱'
        },
    },
    104: {
        title: "惩戒持刀山贼",
        tips: "持刀山贼发现了逃回仙隐村的你们，出手将他们击退吧。",
        receive: [
            "你刚刚换上装备就见村外有几道手持大刀的山贼，显然是他们一路找过来。",
            "狐晶丽：不好，他们竟然这么快就找来了。",
            "你信心十足：&别怕，我去收拾他们。",
        ],
        done: [
            "持刀山贼完全不是你的对手，几个回合就被你打的落荒而逃。",
            "狐晶丽：你怎么把他们放走了。",
            "你：&有什么问题？",
        ],
    },
    105: {
        title: "击杀持斧山贼",
        tips: "逃走的山贼竟然带来了更多的山贼前来报复，不要留手将他们全部击杀。",
        receive: [
            "狐晶丽：这些可是山贼，你把他们放了，他们肯定还会找人来。",
            "说完就见之前的山贼带着一群拿着斧头的山贼又找上门来。",
            "&迎战。",
        ],
        done: [
            "这次你听了狐晶丽的话，几个回合后，这群山贼全部被你击杀。",
            "不过最后一个山贼死前放出了一道烟花在天空炸开。",
            "狐晶丽：&不好，是信号弹!",
        ],
    },
    106: {
        title: "突出重围",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "信号弹一出，你也意识到事情不妙，正准备带着狐晶丽离开，迎面而来的便是几个明显实力不凡的精英山贼。",
            "此时还有远远不断的山贼四面八方的朝村子聚拢。",
            "狐晶丽：完了，完了，被包围了。",
            "&杀出重围。",
        ],
        done: [
            "危机时刻你爆发出强大的力量，护着狐晶丽竟然硬生生的杀出了重围。",
            "狐晶丽重重的送了一口气：呼，终于逃出来了。",
            "你：还不能放松，那群山贼肯定还在找我们。",
            "狐晶丽：啊，那怎么办？",
            "你：&直捣黄龙。",
        ],
    },
    107: {
        title: "偷袭二当家",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "你带着狐晶丽一路悄悄的潜入了黑风寨，果然这里的防守弱了很多。",
            "一个身材魁梧脸上还一道刀疤的大汉正在大厅里正在威逼几个刚刚抓来的女子与他玩乐。",
            "狐晶丽立即小心提醒：这是黑风寨二当家，实力非常强。",
            "于是你决定：&袭击。",
        ],
        done: [
            "你不讲武德的偷袭非常顺利，二当家到死都没反应过来头颅便直接落地。",
            "狐晶丽：{name}，你太棒了。",
            "一众女子吓得惊叫：啊！",
            "你：&不好。",
        ],
    },
    108: {
        title: "迎战二当家",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "果然这群女子的尖叫立即引来的黑风寨大当家，见到有人潜入黑风寨还杀了二当家立即大怒。",
            "大当家举着一柄寒光凛凛的大刀朝你冲了、过来：小子，给我死。",
            "&迎战大当家。",
        ],
        done: [
            "你与大当家大战了几个回合后终于将其斩杀，突然一道暗器从黑风寨外飞进来目标正是你。",
            "狐晶丽飞身一跃挡在你前面：小心暗器。",
            "你大惊连忙就追出去，可是偷袭之人不见踪影了。",
            "&查看狐晶丽伤势。",
        ],
    },
    109: {
        title: "暗器有毒",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "狐晶丽惨叫：屁股，我的屁股。",
            "你一看发现那暗器就扎在狐晶丽屁股上，此时已经是一片有些发黑的血。",
            "你脸色一变：&不好，这暗器有毒。",
        ],
        done: [
            "狐晶丽一脸惊慌：啊，那怎么办，我不会要死了吧，呜呜呜，我还没成亲呢。",
            "你：&放心，我不会让你有事的",
        ],
    },
    1010: {
        title: "收集蛇胆",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "这时之前那群女子中走出来一人：这是断魂散。",
            "你：那姑娘可知道有什么办法可以解毒。",
            "小蝶：目前没有办法，不过这后山有中名为斑斓蛇的妖兽，它的蛇胆可以暂时压制毒性不蔓延。",
            "你：&我这就去取来。",
        ],
        done: [
            "你取到蛇胆回到黑风寨时狐晶丽已经昏过去了，气色惨白随时都可能见阎王的模样。",
            "小蝶接过蛇胆看了你一眼：你可以出去了。",
            "你：为什么？",
            "小蝶指了指狐晶丽伤口的部位，你这才反应过来，老脸一红连忙走了出去。",
            "&继续",
        ],
    },
    1011: {
        title: "驱赶四眼老鹰",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "离开黑风寨大厅后，你立即就察觉到头顶有一道道强烈的敌意。",
            "抬头看去，只见空中一群四只眼睛的老鹰似乎是被斑斓蛇胆吸引，直接朝黑风寨大厅扑来。",
            "&驱赶四眼老鹰。",
        ],
        done: [
            "四眼老鹰极为难缠，不过在你击杀几只四眼老鹰后其余鹰群也都四散逃了。",
            "这时大厅内传来小蝶的声音：好了，你可以进来了。",
            "回到大厅时你发现狐晶丽气色好了很多，连忙道谢：多谢姑娘了相救。",
            "小蝶：你叫我小碟就好了，我还得谢谢你杀了这群该死的山贼。",
            "你：&小蝶，狐晶丽现在怎么样了？",
        ],
    },
    1012: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "小蝶摇了摇头：我只能在暂时压制这毒，要彻底解决只能去找我爷爷。",
            "你追问：你爷爷是？",
            "小蝶俏皮一笑：你跟我来就知道了。",
            "&前往不夜城。",
        ],
        done: [
            "几日后你与小碟就来到一座几位繁华的城池，来往的过客有人族，妖族，仙族可谓是鱼龙混杂。",
            "不过你却感觉到这里的人身上都有一股煞气，眉头微皱：这是什么地方？",
            "小蝶：这里就是我家，我带你去找我爷爷。",
            "&跟上小蝶",
        ],
    },
    1013: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "你随小蝶刚到城门口就被一群面相猥琐的大汉围住来。",
            "流氓：哟，哪来的漂亮姑娘，给爷笑一个！",
            "你：&......",
        ],
        done: [
            "毫无疑问这一群流氓被你直接胖揍了一顿。",
            "小蝶：嘻嘻，这群流氓我早想教训他们了。",
            "你：&我们赶紧进城吧。",
        ],
    },
    1014: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "进入城池中后小蝶便带着你进入一件院子，只见院子中一个老者正在来回踱步。",
            "小蝶直接冲了过去：爷爷，我回来了！",
            "鬼医：丫头啊，你终于回来了，你可把我急死了！",
            "小蝶假装摸了摸眼泪：呜呜，爷爷，你是不知道我被黑风寨的山贼抓了，差点就回不来了！",
            "鬼医大怒：&什么，爷爷这就去灭了黑风寨！",
        ],
        done: [
            "小蝶连忙指着你：爷爷黑风寨已经被{name}灭了，狐晶丽姐姐因此受重伤你快救救她吧。",
            "说完小蝶便朝你使了个眼色，你连忙抱着狐晶丽上前：晚辈朋友中了断魂散，还请前辈出手。",
            "鬼医只是简单的看了一眼狐晶丽淡淡道：还真是断魂散，不过我为什么要救她。",
            "你：&？？？",
        ],
    },
    1015: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "小蝶连忙摸了摸眼泪：爷爷，狐晶丽姐姐是为了救我才受伤的。",
            "鬼医：哼，死丫头，你以为我看不出来你这小伎俩。",
            "你：&......",
        ],
        done: [
            "你也看出来了小蝶爷爷性情古怪：不知前辈需要晚辈做什么？。",
            "鬼医抚须一笑：小辈还算上道，要我救人你必须答应我三件事。",
            "你：&前辈请讲。",
        ],
    },
    1016: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "这时小蝶又古灵精怪的凑过来：爷爷，我刚刚进城的时候有一群瘪三竟然骚扰我，你可要帮我作主。",
            "毫无疑问小蝶这是怕自己爷爷为难你才故意这样说的。",
            "这点小心思鬼医自然也看得出来，无奈的宠溺道：行，爷爷替你做主。",
            "你：&小蝶姑娘稍等。",
        ],
        done: [
            "教训了一顿瘪三后你重新回到鬼医居所。",
            "鬼医：小子，效率还不错。",
            "你轻轻一下：&不知前辈还需让我做什么？",
        ],
    },
    1017: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "这时小蝶还想继续放水，不过鬼医却不给机会：在城东有一群亡命恶徒，你去把他们杀了。",
            "小蝶一惊：{name}你千万不能去，那些人都是在外面杀人无数逃到不夜城的恶徒。",
            "鬼医则是一脸打趣的盯着你，见此你对小蝶轻轻一笑：&无妨，我去去就来。",
        ],
        done: [
            "你一路来到城东，瞬间你就发现无数到贪婪的目光落在身上。",
            "你不由得苦笑：还不夜城还真是一个不法之地。",
            "终于你走到一处阴暗的巷子中，里面正是一群亡命恶徒。",
            "&进入巷子。",
        ],
    },
    1018: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "你进入巷子见到里面的景象后立马呆住了。",
            "巷子内一群亡命恶徒肆无忌惮的玩弄着一个衣衫破烂女子，女子的眼神已经没有半点光彩。",
            "你怒火中烧：&该杀。",
        ],
        done: [
            "你一身血衣的从巷子中离开，满身血气回到居所时小蝶和鬼医都惊呆了。",
            "鬼医：小子，你这是杀了多少人？",
            "巷子中的事只是一段插曲你并不想多说，当务之急是救狐晶丽：&前辈可以说下件事了。",
        ],
    },
    1019: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "鬼医：在城东还一群人亡命徒，你去把他们也收拾了吧。",
            "&前往城东。",
        ],
        done: [
            "半日后，整个不夜城都知道从外面来了一尊杀神，一人一剑将城东的亡命徒全部屠戮殆尽。",
            "你再度回到鬼医居所时一道熟悉的身影直接冲到了你面前：{name}，你没受伤吧？",
            "见到醒来的狐晶丽，你顿时大喜：我没事，鬼医前辈与小蝶呢？。",
            "狐晶丽这才拿出一封书信递给你：",
            "&接过书信",
        ],
    },
    1020: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "{name},狐晶丽姐姐已经没事了，不过她身体还很虚弱，还需要静养一阵子。",
            "哦，我和爷爷外出游历了，嘻嘻，那间房子是我求爷爷特意就留给你和狐晶丽姐姐静养哟。",
            "随手放下书信你轻轻一笑，这丫头还真是小孩子心性。",
            "这时你想起刚来不夜城时经过的河里似乎有鱼，当即对狐晶丽道：&我出去一趟。",
        ],
        done: [
            "河里的青鲤鱼极为灵活，你费了好大功夫终于是抓到了几条。",
            "你提着几条青鲤鱼一路小跑回鬼医居所：狐晶丽，我们今天有鱼汤喝了。",
            "狐晶丽：&嘻嘻。",
        ],
    },
    1021: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "这天你依旧在河里抓青鲤鱼，狐晶丽则是在岸上呱呱叫：你脚下有一条，你背后也有一条，哎呀，你怎么一条都没抓住。",
            "你听着狐晶丽在岸上一阵瞎指挥，若不是考虑到她是个病号你都想把她扔进河里。",
            "这时狐晶丽突然竹篮怪叫一声：哎呀，我们抓的鱼不见了。",
            "你朝竹篮里看去果然抓到鱼一条都不见了，这时你才注意到几条藤蔓正裹着你的鱼悄悄逃去。",
            "你：&我去，敢偷我的鱼。",
        ],
        done: [
            "你狠狠的教训了这群偷鱼贼，然后在狐晶丽的负面指挥下一直抓到下午太阳快落山了才回到鬼医居。",
            "&继续。",
        ],
    },
    1022: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "一转眼数个月过去，你与狐晶丽一如即往抓了几条鱼便准备回去。",
            "突然几十道暗器朝你飞了过来，数月时间你的修为突飞猛进直接将狐晶丽挡在身后，一挥衣袖将暗器全部击落。",
            "下一秒无数穿着黑色夜行衣的刺客将你们围了起来。",
            "&擒拿刺客。",
        ],
        done: [
            "你看出这些暗器与当初在黑风寨伤狐晶丽的暗器一模一样，立即决定将这些刺客抓起来。",
            "这些刺客的实力也非常不凡，为了活抓你也花费了不少时间。",
            "&审问刺客。",
        ],
    },
    1023: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "经过你的审问才知道这些刺客是黑炎宗的弟子，只是你很疑惑自己何时招惹过这个宗门要几次暗杀。",
            "狐晶丽大惊：怎么会是黑炎宗！",
            "你：&你知道黑炎宗？",
        ],
        done: [
            "狐晶丽：这黑炎宗是抵御魔族的九大宗门之一。",
            "你：魔族又是啥？",
            "狐晶丽：这我也不清楚，只知道与数千年前人，仙，妖三族大战有关。",
            "你眉头一皱：&又与三族大战牵扯上？",
        ],
    },
    1024: {
        title: "序章",
        tips: "巡逻山贼发现了你，赶紧迎敌吧。",
        receive: [
            "狐晶丽：数千年三族大战死伤惨重，魔族从天外降临，三族联手。",
            "狐晶丽大惊：怎么会是黑炎宗！",
            "你：&你知道黑炎宗？",
        ],
        done: [
            "狐晶丽：这黑炎宗是抵御魔族的九大宗门之一。",
            "你：魔族又是啥？",
            "狐晶丽：这我也不清楚，只知道与数千年前人，仙，妖三族大战有关。",
            "你眉头一皱：&又何三族大战牵扯上？",
        ],
    }
}

module.exports = {
    scene_list,
}
