

module.exports = {
    1: {
        id: 1,
        title: '炼魂洞',
        tips: '击败炼魂郎君的全部残魂，阻止他复活。',
        type: 1,
        level: 20,
        reward: {
            fun: 'lianHunDong',
        },
        levelText: '等级不足28级，无法领取炼魂洞副本',
        grand: {
            npc: {
                id: 424,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 2050,
                    address: '50000,0,0',
                },
                {
                    id: 2051,
                    address: '50000,0,1',
                },
                {
                    id: 2052,
                    address: '50000,0,2',
                },
                {
                    id: 2053,
                    address: '50000,0,3',
                },
                {
                    id: 2054,
                    address: '50000,0,4',
                },
                {
                    id: 2055,
                    address: '50000,0,5',
                },
                {
                    id: 2056,
                    address: '50000,0,6',
                },
                {
                    id: 2057,
                    address: '50000,0,7',
                },
            ],
        },
        receive: [
            "炼魂洞，邪修炼魂郎君为了寻找替身夺舍复活，以藏宝图为诱饵吸引无数修士前来。",
            "你很快便发现了炼魂郎君的阴谋，此时炼魂郎君正在发动阵法，一道道残魂在洞府中开始凝聚。",
            "&【接受任务】",
        ],
        done: [
            "你决定破开阵法，瞬间无数道炼魂郎君的残魂朝你袭来。",
            "你冷哼一声，运转浑身法力，掐出数道法诀，将残魂尽数消灭。",
            "残魂消灭，洞府阵法自破，炼魂郎君也彻底消亡，你用神识将洞府内的天材地宝收起。",
            "&完成任务",
        ]
    },
}