

module.exports = {
    1: {
        id: 1,
        title: '炼魂洞',
        tips: '击败炼魂郎君的全部残魂，阻止他复活。',
        type: 1,
        reward: {
            attr: 'exp-200',
        },
        grand: {
            npc: {
                id: 424,
                address: '10000,0,0',
            },
            freak: [
                {
                    id: 24,
                    address: '50000,0,0',
                },
                {
                    id: 25,
                    address: '50000,0,1',
                },
                {
                    id: 26,
                    address: '50000,0,2',
                },
                {
                    id: 27,
                    address: '50000,0,3',
                },
                {
                    id: 28,
                    address: '50000,0,4',
                },
                {
                    id: 29,
                    address: '50000,0,5',
                },
                {
                    id: 210,
                    address: '50000,0,6',
                },
                {
                    id: 211,
                    address: '50000,0,7',
                },
            ],
        },
        receive: [
            "炼魂洞，邪修炼魂郎君为了寻找替身夺舍复活，以藏宝图为诱饵吸引无数修士前来。",
            "你很快便发现了炼魂郎君的阴谋，此时炼魂郎君正在发动阵法，一道道残魂在洞府中开始凝聚。",
            "你决定：&破开阵法",
        ],
        done: [
            "你决定破开阵法，瞬间无数道炼魂郎君的残魂朝你袭来。",
            "你冷哼一声，运转浑身法力，掐出数道法诀，将残魂尽数消灭。",
            "残魂消灭，洞府阵法自破，炼魂郎君也彻底消亡，你用神识将洞府内的天材地宝收起。",
            "&离开洞府"
        ],
        // treat: {
        //     text: '击败炼魂郎君的全部残魂，阻止他复活。',
        //     address: '10000,0,0',
        //     name: '隐仙村(1,1)'
        // },
        // nextId: 2,
    },
}