

module.exports = {
    1: {
        id: 1,
        title: '炼魂洞',
        tips: '传说中炼魂郎君的洞府',
        type: 1,
        reward: {
            attr: 'exp-200',
        },
        grand: {
            npc: {
                id: 4000024,
                address: '10000,0,0',
            },
            tNpc: {
                id: 4000024,
                address: '10000,0,0',
            },
            freak: [
                {
                    id: 2000014,
                    address: '10000,0,0',
                },
                {
                    id: 2000015,
                    address: '10000,0,1',
                },
                {
                    id: 2000016,
                    address: '10000,0,2',
                },
                {
                    id: 2000017,
                    address: '10000,0,3',
                }
            ],
        },
        // "complete": {
        //     "freak": "2000014,2000015,2000016,2000017"
        // },
        "receive": [
            "当夜，你与拎壶冲偷偷的潜入十里坡，入眼的便是一座荒凉的寨子，寨门紧闭，高高的悬挂着一块牌匾，黑风寨。",
            "寨门口数百精英山贼来回巡逻，空气中隐隐中似乎还夹杂着一缕血腥味。",
            "这时一直担心小花的拎壶冲生怕出事，顾不得门口等精英山贼，直接冲了出去，瞬间便吸引了无数山贼注意力。",
            "你见此机会便要进入黑风寨内，不过还有几个精英山贼发现了你向你直接杀来。",
            "&快速击杀。"
        ],
        "done": [
            "几个照面，你便轻松解决了这些朝你杀来的精英山贼，然后推门而入。",
            "一道怪异的笛声传入你耳中，紧接着一股极为浓烈令人作呕的血腥味扑入鼻中。",
            "只见黑风寨内到处都是锋利刀刃，刀刃上尽是残肢断骸。",
            "而此时还有无数人如同没有痛觉一般的那刀锋上一步步的踏过，腿没了便用手撑着爬，手没了便用身躯在上面蠕动着，无数血液汇聚一起形成一个巨大的血池，纵使人间地狱不过如此。",
            "突然笛声戛然而止，一股冰冷的杀意从你身后袭来。",
            "&连忙避开"
        ],
        treat: {
            text: '快点击杀全部洞主吧',
            address: '10000,0,0',
            name: '隐仙村(1,1)'
        },
        // nextId: 2,
    },
}