
module.exports = {
    1: {
        id: 1,
        title: '序章',
        tips: '我忘却了修为，只为千年前....',
        type: 2,
        reward: {
            attr: 'exp-200',
            tael: 1000,
        },
        grand: {
            npc: {
                id: 1000001,
                address: '10000,0,0',
            },
            tNpc: {
                id: 1000001,
                address: '10000,0,0',
            },
        },
        talk: [
            '我穿越了千年，在无尽的岁月长河中沉睡，最终忘却了一切，只为重回千年前……',
            '神秘女声:醒醒，快点醒醒！',
            '一道声音将你从沉睡中唤醒，你睁开眼发现面前站着一个女子，自身似乎正躺在一处古树下。',
            '你：&你是？'
        ],
        nextId: 2,
    },
    2: {
        id: 2,
        title: '失忆',
        tips: '前往隐仙村与胡晶丽对话对话。',
        type: 2,
        reward: {
            attr: 'exp-200',
            tael: 1000,
        },
        grand: {
            npc: {
                id: 1000001,
                address: '10000,0,0',
            },
            tNpc: {
                id: 1000001,
                address: '10000,0,1',
            },
        },
        talk: [
            '胡晶丽：我是你引导者胡晶丽啊，你不会忘记我了吧！！！',
            '你：&引导者？胡晶丽？'
        ],
        nextId: 3,
    },
    3: {
        id: 3,
        title: '魔族强者',
        tips: '击杀魔族强者。',
        type: 1,
        reward: {
            attr: 'exp-200',
            tael: 1000,
        },
        grand: {
            npc: {
                id: 1000001,
                address: '10000,0,1',
            },
            tNpc: {
                id: 1000001,
                address: '10000,0,0',
            },
            freak: {
                id: 1000007,
                address: '10000,0,1',
            },
        },
        complete: { freak: '1000007' },
        talk: [
            '胡晶丽：看来你果然忘记了一切，算了先把一旁的魔族强者杀了吧！！！',
            '你：&好的！'
        ],
        nextId: 3,
    },
    4: {
        id: 4,
        title: '三族大会',
        tips: '三族大会',
        type: 2,
        reward: {
            attr: 'exp-200',
            tael: 1000,
        },
        grand: {
            npc: {
                id: 1000001,
                address: '10000,0,1',
            },
            tNpc: {
                id: 1000001,
                address: '10000,0,0',
            },
        },
        talk: [
            '胡晶丽：哟呵，不错骂，虽然失忆了！',
            '你：&...！'
        ],
        // nextId: 3,
    },
    // 2: {
    //     id: 2,
    //     title: '失忆?',
    //     tips: '到十里坡与胡晶丽对话。',
    //     type: 1,
    //     reward: {
    //         attr: 'exp-200',
    //         tael: 1000,
    //     },
    //     grand: {
    //         npc: {
    //             id: 1000001,
    //             address: '10000,0,0',
    //         },

    //         tNpc: {
    //             id: 1000001,
    //             address: '10000,0,0',
    //         },
    //     },
    //     complete: { freak: '1000007-1' },
    //     neck: [
    //         '胡晶丽：天啊，你竟然真的失忆了！！！',
    //         '你：什么意思？',
    //         '胡晶丽：我来找你的路上遇到一个疯疯癫癫的老头说你会失忆，我还不信，没想到竟然是真的。',
    //         '你：&老头？'
    //     ],
    //     done: [
    //         '胡晶丽：算了，先别管那老头了，十里坡外来了一群山贼经常骚扰村子,你先去教训他们一顿。',
    //         '你：&我吗？',
    //     ],
    //     nextId: 3,
    // },
    // 3: {
    //     id: 3,
    //     title: '教训山贼',
    //     tips: '狠狠的教训一顿十里坡的山贼，让他们不敢再骚扰村子。',
    //     type: 2,
    //     reward: {
    //         attr: 'exp-100',
    //         tael: 1000,
    //     },
    //     grand: {
    //         npc: {
    //             id: 1000001,
    //             address: '10000,0,1',
    //         },
    //         freak: [
    //             {
    //                 id: 1000007,
    //                 address: '10000,0,1'
    //             }
    //         ]
    //     },
    //     neck: [
    //         '一路上你战战兢兢的被胡晶丽拉倒了一处山坡的石头后面藏了起来，只见四处都是手持大砍刀的彪悍山贼。',
    //         '你：你让我和他们打？(望着这群看着就凶残无比的山贼,你开始怀疑这叫胡晶丽的女人是不是疯了,毕竟穿越前你连坤都没杀过，让你来教训这群山贼这不是送菜？)',
    //         '胡晶丽：你的实力打几个区区山贼不是闹着玩？',
    //         '胡晶丽：哦，忘记你失忆了，不过正好可以用山贼试试手，重新找回记忆。(说着一脚把你踹了出去)',
    //         '你：&靠！！！'
    //     ],
    //     done: [
    //         '你从石头后面出来立即引起了山贼的注意，当即心一狠与他们缠斗了起来,一种仿佛与生俱来的战斗天赋让你轻而易举的获得胜利，隐隐中还记起了一些法术。',
    //         '提示：【法术】界面可领悟与升级法术',
    //         '胡晶丽：不愧是本姑娘选中的人，看来有机会再三族大会之前恢复到巅峰！',
    //         '(本来还想找胡晶丽报刚刚的一脚之仇，听到她又一次提到三族大会，你隐隐中感觉这似乎对你很重要，便暂时放弃了教训她的想法，开口好奇的问道。)',
    //         '你：&三族大会是什么？'
    //     ],
    //     complete: { freak: '1000007' },
    //     nextId: 4,
    // },
    // 4: {
    //     id: 4,
    //     title: '三族大会',
    //     tips: '与胡晶丽对话,了解三族大会。',
    //     type: 2,
    //     reward: {
    //         attr: 'exp-100',
    //         tael: 1000,
    //     },
    //     grand: {
    //         npc: {
    //             id: 1000001,
    //             address: '10000,0,0',
    //         },
    //         tNpc: {
    //             id: 1000001,
    //             address: '10000,0,0',
    //         },
    //     },
    //     neck: [
    //         '胡晶丽：此地不宜久留，先回村子再说！',
    //         '你抬头看了一眼四周，刚刚被你打的四散而逃的几个山贼此刻竟然带着数十号人又回来了，虽然你刚刚赢了，但还没有膨胀到觉得自己能以一挡百，当即从心的点头表示很赞同。',
    //     ],
    //     done: [
    //         '一路跑回村子，胡晶丽便与你说起了三族大会,你也大概的知道了一些情况。',
    //         '原来这个世界竟然又人，妖，仙三大种族，数千年前因为一个吃了便可以一统三族的“馒头”大战了一场，结果三族强者死伤无数，元气大伤，馒头不翼而飞，消失数千年。',
    //         '不过不久前一张关于“馒头”的藏宝图突然出现，三族大会便是因此诞生,由各族年轻一代的天骄进行比斗，最终胜利的一方便可以获得藏宝图。',
    //         '你：为什么人仙妖三族这次没有打起来呢？(听完你将疑惑说了出来)',
    //         '胡晶丽：谁知道呢，可能是三族数千年的大战导致元气打伤，还没恢复吧,对了跟我来。',
    //         '你：&去哪里？'
    //     ],
    //     nextId: 5,
    // },
}