
module.exports = {
    {
    "1": {
        "id": 1,
        "title": "序章",
        "tips": "我忘却了修为，只为重回千年前....",
        "type": 2,
        "reward": {
            "attr": "exp-200"
        },
        "grand": {
            "npc": {
                "id": 1000000,
                "address": "10000,0,0"
            },
            "tNpc": {
                "id": 1000000,
                "address": "10000,0,0"
            }
        },
        "treat": {
            "text": "拎壶冲就在隐仙村(1,1),赶紧过去和他聊聊吧",
            "address": "10000,0,0",
            "name": "隐仙村(1,1)"
        },
        "receive": [
            "我穿越了千年，在无尽的岁月长河中沉睡，最终忘却了一切，只为重回千年前……",
            "神秘声音：醒醒，快点醒醒！",
            "一道声音将你从沉睡中唤醒，你睁开眼发现面前站着一个少年，而你此时正躺在一处古树下。",
            "你：&你是？"
        ],
        "done": [
            "拎壶冲：靠，你不会睡傻了吧，我拎壶冲啊！！！",
            "你：拎壶冲？(你突然发现自己什么都不记得了，只是隐隐记得你并非这个世界的人，来到这里似乎也是因为某种原因。)",
            "拎壶冲：算了，先不说这个了，你快跟我来！",
            "你：&去哪？"
        ],
        "nextId": 2
    },
    "2": {
        "id": 2,
        "title": "黑风寨",
        "tips": "【法术】界面可领悟与升级法术，学好法术后狠狠的教训一顿巡逻山贼。",
        "type": 1,
        "reward": {
            "attr": "exp-300"
        },
        "grand": {
            "npc": {
                "id": 1000000,
                "address": "10000,0,1"
            },
            "tNpc": {
                "id": 1000000,
                "address": "10000,0,1"
            },
            "freak": [
                {
                    "id": 1000007,
                    "address": "10000,0,1"
                }
            ]
        },
        "receive": [
            "拎壶冲：村子外来了一群黑风寨的山贼，昨日小花被他们给劫走了，我们要赶紧去救小花！",
            "你：呵呵，你自己去吧！（你是失了忆，不是失了智，自己这小身板去山贼手中救人，那不是白给了，当即就准备往回走，然而这时却突然出现一声厉喝。）",
            "巡逻山贼：什么人！",
            "你这才发现不知何时你竟然已经闯进了山贼巡逻范围，一旁的拎壶冲也没了踪影，二话不说你拔腿就跑。",
            "可惜很快就被几名巡逻追上了，你也只能硬着头皮上了，这时一道封尘许久的记忆松动了，竟是一道道玄奥的法术。",
            "提示：【法术】界面可进行法术领悟及升级",
            "&知道了"
        ],
        "done": [
            "凭着几道法术，战斗中你竟然爆发出强大的力量，将追上你的巡逻山贼全部的打跑了，一时间你自己都愣住了。",
            "拎壶冲：别发呆了，其他山贼要追上来了。(拎壶冲突然出现在你身边对着你喊道)",
            "你回头一看，只见身后一群彪形大汉朝自己追了过来，在一回头，发现拎壶冲这个家伙已经跑到十米开外。",
            "你：&靠，等等我。"
        ],
        "treat": {
            "text": "【法术】界面可领悟与升级法术，学好法术后狠狠的教训一顿巡逻山贼。",
            "address": "10000,0,1",
            "name": "十里坡(1,2)"
        },
        "complete": {
            "freak": "2000000-2"
        },
        "nextId": 3
    },
    "3": {
        "id": 3,
        "title": "全副武装",
        "tips": "山贼太多，你招架不住，先回村子全副武装一下。",
        "type": 2,
        "reward": {
            "equip": "1,2,3,4,5",
            "article": "1-20,2-20"
        },
        "grand": {
            "npc": {
                "id": 1000000,
                "address": "10000,0,0"
            },
            "tNpc": {
                "id": 1000000,
                "address": "10000,0,0"
            }
        },
        "receive": [
            "有惊无险，你与拎壶冲成功的甩开了身后的山贼，在村口的古树下大口大口的喘气。",
            "拎壶冲：没想到十里坡竟然汇聚了这么多山贼！",
            "你：难道是这十里坡有宝藏？",
            "拎壶冲：宝藏？对了，你先在里等我。",
            "说着也没等你同意，拎壶冲就一溜烟的跑进了村子，然后捧着一个布满蜘蛛丝的箱子跑到你面前。",
            "看着这个箱子，你满是好奇：这里面装的啥？",
            "拎壶冲神秘一笑：你打开就知道了！",
            "&直接打开"
        ],
        "done": [
            "你也不客气，直接就将箱子打开，竟然发现里面摆放着几件精致的装备以及一堆疗伤药。",
            "拎壶冲：怎么样，你只要穿上这些装备我们就可以直接杀回去了。",
            "你也不客气，直接换上这些装备，刚刚与山贼的战斗中你感应到十里坡的方向似乎有一股似曾相识的力量，很有可能与你失去记忆有关。",
            "你：&走，杀回去。"
        ],
        "treat": {
            "text": "山贼太多，你招架不住，先回村子全副武装一下。",
            "address": "10000,0,0",
            "name": "隐仙村(1,1)"
        },
        "nextId": 4
    },
    "4": {
        "id": 4,
        "title": "抓个耳朵",
        "tips": "十里坡防守过于严密，先抓几个山贼小头目拷问一下吧。",
        "type": 1,
        "reward": {
            "attr": "exp-500"
        },
        "grand": {
            "npc": {
                "id": 1000000,
                "address": "10000,0,1"
            },
            "tNpc": {
                "id": 1000000,
                "address": "10000,0,1"
            }
        },
        "receive": [
            "你与拎壶冲重新来到十里坡，发现在此处巡逻的山贼比之前更多，其中还有一些手持刀斧看着应该是小头目的山贼，一时间你们也只好小心的隐藏起来。",
            "拎壶冲气急的骂道：靠，这群山贼究竟想干什么，小花被他们抓走也不知道怎么样了。",
            "你没有理会气急的拎壶冲，而是静静的在一旁观察这些山贼的行动，终于有几个小头目开始不耐烦的离开了巡逻队伍，结伴去和酒了。",
            "你见此当即决定&跟上去，敲晕几个带回来。"
        ],
        "done": [
            "片刻后，你便将几个小头目打晕全部带到拎壶冲面前，等他们醒后你便与拎壶冲分开进行拷问这些山贼聚集到十里坡到目的。",
            "一顿询问下得知十里坡还真是有被封印的宝藏，为了破解宝藏的封印来此的山贼竟然抓了数人准备在今晚进行祭献。",
            "你与拎壶冲相识一眼，没想到这群山贼竟然如此丧心病狂。",
            "于是你两决定：&今夜潜入救人。"
        ],
        "treat": {
            "text": "十里坡防守过于严密，先抓几个山贼小头目拷问一下吧。",
            "address": "10000,0,1",
            "name": "十里坡(1,2)"
        },
        "nextId": 5
    },
    "5": {
        "id": 5,
        "title": "夜袭黑风寨",
        "tips": "趁着拎壶冲吸引了大量守卫，赶紧潜入寨内。",
        "type": 2,
        "reward": {
            "attr": "exp-1000"
        },
        "grand": {
            "npc": {
                "id": 1000000,
                "address": "10000,0,1"
            },
            "tNpc": {
                "id": 1000000,
                "address": "10000,0,1"
            }
        },
        "receive": [
            "当夜，你与拎壶冲偷偷的潜入十里坡，入眼的便是一座荒凉的寨子，寨门紧闭，高高的悬挂着一块牌匾，黑风寨。",
            "寨门口数百精英山贼来回巡逻，空气中隐隐中似乎还夹杂着一缕血腥味。",
            "这时一直担心小花的拎壶冲生怕出事，顾不得门口等精英山贼，直接冲了出去，瞬间便吸引了无数山贼注意力。",
            "你见此机会便要进入黑风寨内，不过还有几个精英山贼发现了你向你直接杀来。",
            "&快速击杀。"
        ],
        "done": [
            "几个照面，你便轻松解决了这些朝你杀来的精英山贼，然后推门而入。",
            "一道怪异的笛声传入你耳中，紧接着一股极为浓烈令人作呕的血腥味扑入鼻中。",
            "只见黑风寨内到处都是锋利刀刃，刀刃上尽是残肢断骸。",
            "而此时还有无数人如同没有痛觉一般的那刀锋上一步步的踏过，腿没了便用手撑着爬，手没了便用身躯在上面蠕动着，无数血液汇聚一起形成一个巨大的血池，纵使人间地狱不过如此。",
            "突然笛声戛然而止，一股冰冷的杀意从你身后袭来。",
            "&连忙避开"
        ],
        "treat": {
            "text": "趁着拎壶冲吸引了大量守卫，赶紧潜入寨内。",
            "address": "10000,0,1",
            "name": "十里坡(1,2)"
        }
    }
}
}
