const { TASK_TYPE } = require('./enum');
module.exports = {
    110: {
        title: '炼魂洞',
        tips: '数百年前的邪修炼魂郎君正在谋划复活，赶紧去阻止他吧。',
        level: 28,
        reward: {
            fun: 'LianHunDong',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足28级，无法领取炼魂洞副本。',
        grand: {
            npc: {
                id: 424,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20511,
                    address: '50000,0,0',
                },
                {
                    id: 20512,
                    address: '50000,0,1',
                },
                {
                    id: 20513,
                    address: '50000,0,2',
                },
                {
                    id: 20514,
                    address: '50000,0,3',
                },
                {
                    id: 20515,
                    address: '50000,0,4',
                },
                {
                    id: 20516,
                    address: '50000,0,5',
                },
                {
                    id: 20517,
                    address: '50000,0,6',
                },
                {
                    id: 20518,
                    address: '50000,0,7',
                },
            ],
        },
        receive: [
            "无妄海内突然出现一块诡异的石碑，引起无数骷髅生灵暴动。",
            "据说石碑的内部乃是数百年前一位强大邪修炼魂郎君的洞府，其中或许隐藏着什么阴谋。",
            "&查探洞府",
        ],
        done: [
            "进入炼魂洞府后你发现炼魂郎君竟然布下大阵血祭了无数修士，妄图借此复生。",
            "你也是成为了炼魂郎君的目标，最终你成功的将其斩杀。",
            "&完成任务",
        ]
    },
    111: {
        title: '黑炎宗',
        tips: "传承千年的黑炎宗竟然在血祭数万凡人，复活传说中的血魔。",
        level: 40,
        reward: {
            fun: 'HeiYanZong',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足40级，无法领取黑炎宗副本。',
        grand: {
            npc: {
                id: 425,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20521,
                    address: '50001,0,0',
                },
                {
                    id: 20522,
                    address: '50001,0,1',
                },
                {
                    id: 20523,
                    address: '50001,0,2',
                },
                {
                    id: 20524,
                    address: '50001,1,1',
                },
                {
                    id: 20525,
                    address: '50001,2,0',
                },
                {
                    id: 20526,
                    address: '50001,2,1',
                },
                {
                    id: 20527,
                    address: '50001,2,2',
                },
                {
                    id: 20528,
                    address: '50001,3,1',
                },
            ],
        },
        receive: [
            "你答应老者的请求进入十万大山寻找他的孙女，最终你竟然查到了黑炎宗身上。",
            "于是你选择了拜访黑炎宗却发现这个宗门竟然血祭了数百万凡人妄图复活传说中的血魔。",
            "&阻止黑炎宗",
        ],
        done: [
            "你见此毫不犹豫的选择出手阻止，无数黑炎宗弟子护法也都朝你杀了过来。",
            "一场大战之后，整个黑炎宗从弟子，护法，长老，宗主尽数陨落。",
            "&完成任务",
        ]
    },
    112: {
        title: '四海龙宫',
        tips: '传说中唯有大气运者才能见到传说中的龙宫。',
        level: 50,
        reward: {
            fun: 'SiHaiLongGong',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足50级，无法领取四海龙宫副本。',
        grand: {
            npc: {
                id: 426,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20531,
                    address: '50002,0,0',
                },
                {
                    id: 20532,
                    address: '50002,0,1',
                },
                {
                    id: 20533,
                    address: '50002,0,2',
                },
                {
                    id: 20534,
                    address: '50002,1,1',
                },
                {
                    id: 20535,
                    address: '50002,2,0',
                },
                {
                    id: 20536,
                    address: '50002,2,1',
                },
                {
                    id: 20537,
                    address: '50002,2,2',
                },
                {
                    id: 20538,
                    address: '50002,3,1',
                },
            ],
        },
        receive: [
            "在南海之岸有这样一个传说。",
            "在太阳升起之时，有缘者可在天地相接之处见到传说中的龙宫入口，龙宫内拥有无数稀世的天材地宝。",
            "这日你来到南海之岸，一道金色霞光落洒落在海面，隐隐中竟然还有一座金碧辉煌的宫殿。",
            "&进入龙宫",
        ],
        done: [
            "龙宫之内，金碧辉煌。",
            "无数海族强者守护在宫殿之中，你甚至还见到了传说中的龙族皇者。",
            "&完成任务",
        ]
    },
    113: {
        title: '凤凰桐木',
        tips: '一座荒凉的大山，山巅之上隐隐传来恐怖的大妖气息。',
        level: 60,
        reward: {
            fun: 'FengHuangTongMu',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足60级，无法领取凤凰桐木副本。',
        grand: {
            npc: {
                id: 427,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20541,
                    address: '50003,0,0',
                },
                {
                    id: 20542,
                    address: '50003,0,1',
                },
                {
                    id: 20543,
                    address: '50003,0,2',
                },
                {
                    id: 20544,
                    address: '50003,1,1',
                },
                {
                    id: 20545,
                    address: '50003,2,0',
                },
                {
                    id: 20546,
                    address: '50003,2,1',
                },
                {
                    id: 20547,
                    address: '50003,2,2',
                },
                {
                    id: 20548,
                    address: '50003,3,1',
                },
            ],
        },
        receive: [
            '你站在荒凉的山脚，便感觉到山巅传来的大妖威压。',
            '抬头看去，只见山巅之上一棵千年梧桐古树，万丈大树直入云端，枝干四面延伸，遮天蔽日。',
            "一座有些破旧的诡异道观，安静的坐落在山脚。",
            "&进入道观",
        ],
        done: [
            "你与梧桐古树成功战胜了火凤凰，你得到传说中的凤凰羽衣。",
            "回到古镇中，你将羽衣交给了落魄的书生。",
            "&完成任务",
        ]
    },
    114: {
        title: '血魔老祖',
        tips: '血魔老祖',
        level: 70,
        reward: {
            fun: 'MoZunChuanShuo',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足70级，无法领取血魔老祖副本。',
        grand: {
            npc: {
                id: 428,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20551,
                    address: '50004,0,0',
                },
                {
                    id: 20552,
                    address: '50004,0,1',
                },
                {
                    id: 20553,
                    address: '50004,0,2',
                },
                {
                    id: 20554,
                    address: '50004,1,1',
                },
                {
                    id: 20555,
                    address: '50004,2,0',
                },
                {
                    id: 20556,
                    address: '50004,2,1',
                },
                {
                    id: 20557,
                    address: '50004,2,2',
                },
                {
                    id: 20558,
                    address: '50004,3,1',
                },
            ],
        },
        receive: [
            "你按照天机老人的指引成功找到了千年前抵御血魔一脉的超级宗门：御风宗。",
            "果然此处早已经血气弥漫，而让你没想到的是他们竟然已经完成了血祭，血魔降临无边魔气已经将整个御风宗侵蚀。",
            "&诛杀魔人",
        ],
        done: [
            "最终你虽然战胜了传说中的血魔，不过曾经的超级宗门此时也化为了一片废墟。",
            "你不仅感慨没想到曾经抵御魔族的御风宗竟然沦落至此。",
            "&完成任务",
        ]
    },
    115: {
        title: '海底魔宫',
        tips: '海底魔宫',
        level: 80,
        reward: {
            fun: 'HaiDiMoGong',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足80级，无法领取海底魔宫副本。',
        grand: {
            npc: {
                id: 429,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20561,
                    address: '50005,0,0',
                },
                {
                    id: 20562,
                    address: '50005,0,1',
                },
                {
                    id: 20563,
                    address: '50005,0,2',
                },
                {
                    id: 20564,
                    address: '50005,1,1',
                },
                {
                    id: 20565,
                    address: '50005,2,0',
                },
                {
                    id: 20566,
                    address: '50005,2,1',
                },
                {
                    id: 20567,
                    address: '50005,2,2',
                },
                {
                    id: 20568,
                    address: '50005,3,1',
                },
            ],
        },
        receive: [
            "一座藏在深海之底的恐怖魔宫，无数强大的傀儡守护在周围。",
            "隐隐中你似乎听到了来自宫殿内部海魔的咆哮，他似乎正在冲击自身封印。",
            "&镇压海魔",
        ],
        done: [
            "你成功斩杀了海魔，瞬间整个宫殿都坍塌了起来，一张残破的图纸落入了你手中。",
            "&完成任务",
        ]
    },
    116: {
        title: '天魔传说',
        tips: '天魔传说',
        level: 90,
        reward: {
            fun: 'MoZuYiJi',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足90级，无法领取天魔传说副本。',
        grand: {
            npc: {
                id: 430,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20571,
                    address: '50006,0,0',
                },
                {
                    id: 20572,
                    address: '50006,0,1',
                },
                {
                    id: 20573,
                    address: '50006,0,2',
                },
                {
                    id: 20574,
                    address: '50006,1,1',
                },
                {
                    id: 20575,
                    address: '50006,2,0',
                },
                {
                    id: 20576,
                    address: '50006,2,1',
                },
                {
                    id: 20577,
                    address: '50006,2,2',
                },
                {
                    id: 20578,
                    address: '50006,3,1',
                },
            ],
        },
        receive: [
            "天魔宫殿内到处都是玄奥的阵法，而阵法的中心则是一尊伟岸的巨像。",
            "你一眼便认出那就是传说中的天魔，此时域外一道光束落在巨像之上，正是天魔想要借此降世。",
            "&阻止天魔降世",
        ],
        done: [
            "你破开阵法最终成功将天魔石像摧毁，天魔则是在域外看着你杀机毕露。",
            "&完成任务",
        ]
    },
    116: {
        title: '地府传说',
        tips: '地府传说',
        level: 100,
        reward: {
            fun: 'YouMingDiFu',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足100级，无法领取地府传说副本。',
        grand: {
            npc: {
                id: 431,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20581,
                    address: '50007,0,0',
                },
                {
                    id: 20582,
                    address: '50007,0,1',
                },
                {
                    id: 20583,
                    address: '50007,0,2',
                },
                {
                    id: 20584,
                    address: '50007,1,1',
                },
                {
                    id: 20585,
                    address: '50007,2,0',
                },
                {
                    id: 20586,
                    address: '50007,2,1',
                },
                {
                    id: 20587,
                    address: '50007,2,2',
                },
                {
                    id: 20588,
                    address: '50007,3,1',
                },
            ],
        },
        receive: [
            "传说世间所有亡者的往生之地，轮回的尽头便通往时间长河，可穿梭于过去，未来。",
            "只是凡是想借此踏入时间长河者都需要通过酆都大帝的考验。",
            "&接受考验",
        ],
        done: [
            "最终你通过了考验得到了一朵彼岸花，它能让你在时间长河中不迷失回来的路。",
            "&完成任务",
        ]
    },
    117: {
        title: '魔族遗迹',
        tips: '魔族遗迹',
        level: 100,
        reward: {
            fun: 'QunMoLuanWu',
        },
        type: TASK_TYPE.zhandou,
        levelText: '等级不足100级，无法领取魔族遗迹副本。',
        grand: {
            npc: {
                id: 432,
                address: '40001,1,0',
            },
            freak: [
                {
                    id: 20591,
                    address: '50008,0,0',
                },
                {
                    id: 20592,
                    address: '50008,0,1',
                },
                {
                    id: 20593,
                    address: '50008,0,2',
                },
                {
                    id: 20594,
                    address: '50008,1,1',
                },
                {
                    id: 20595,
                    address: '50008,2,0',
                },
                {
                    id: 20596,
                    address: '50008,2,1',
                },
                {
                    id: 20597,
                    address: '50008,2,2',
                },
                {
                    id: 20598,
                    address: '50008,3,1',
                },
            ],
        },
        receive: [
            "魔族遗址内魔气铺天盖地，寻常修士踏入顷刻间便会入魔。",
            "你在这里看到了恐怖的一幕，一尊尊伟岸无比的巨像傲立于此，甚至还有被你斩杀的魔族强者竟然也在此复活了。",
            "&摧毁全部巨像",
        ],
        done: [
            "你以一己之力独战群魔最终将全部石像摧毁，彻底断绝域外魔族想要借助石像降临世间的谋划。",
            "&完成任务",
        ]
    },
}
