export const worldConfig = {
  current: 35,
  tabList: [
    {
      label: "35级套装",
      value: 35
    },
    {
      label: "55级套装",
      value: 55
    },
    {
      label: "70级套装",
      value: 70
    },
    {
      label: "80级套装",
      value: 80
    },
    {
      label: "90级套装",
      value: 90
    },
    {
      label: "100级套装",
      value: 100
    }
  ],
  equipMeun: {
    35: [
      { name: "星辰法杖", id: 1326 },
      { name: "星辰头巾", id: 1327 },
      { name: "星辰法袍", id: 1328 },
      { name: "星辰束带", id: 1329 },
      { name: "星辰布鞋", id: 1330 },
      { name: "玉尊战戟", id: 1331 },
      { name: "玉尊战盔", id: 1332 },
      { name: "玉尊战甲", id: 1333 },
      { name: "玉尊战带", id: 1334 },
      { name: "玉尊战靴", id: 1335 },
      { name: "凌影长剑", id: 1336 },
      { name: "凌影头巾", id: 1337 },
      { name: "凌影长衣", id: 1338 },
      { name: "凌影玉束", id: 1339 },
      { name: "凌影布鞋", id: 1340 },
      { name: "海誓山盟の戒", id: 13166 },
      { name: "海誓山盟の项链", id: 13167 }
    ],
    55: [
      { name: "飞炼法杖", id: 1341 },
      { name: "飞炼头巾", id: 1342 },
      { name: "飞炼法袍", id: 1343 },
      { name: "飞炼束带", id: 1344 },
      { name: "飞炼布鞋", id: 1345 },
      { name: "飞尊战戟", id: 1346 },
      { name: "飞尊战盔", id: 1347 },
      { name: "飞尊战甲", id: 1348 },
      { name: "飞尊战带", id: 1349 },
      { name: "飞尊战靴", id: 1350 },
      { name: "飞影长剑", id: 1351 },
      { name: "飞影头巾", id: 1352 },
      { name: "飞影长衣", id: 1353 },
      { name: "飞影玉束", id: 1354 },
      { name: "飞影布鞋", id: 1355 },
      { name: "吉祥如意の戒", id: 13168 },
      { name: "吉祥如意の项链", id: 13169 }
    ],
    70: [
      { name: "金光法杖", id: 1356 },
      { name: "金光头巾", id: 1357 },
      { name: "金光法袍", id: 1358 },
      { name: "金光束带", id: 1359 },
      { name: "金光布鞋", id: 1360 },
      { name: "金玉战戟", id: 1361 },
      { name: "金玉战盔", id: 1362 },
      { name: "金玉战甲", id: 1363 },
      { name: "金玉战带", id: 1364 },
      { name: "金玉战靴", id: 1365 },
      { name: "金流长剑", id: 1366 },
      { name: "金流头巾", id: 1367 },
      { name: "金流长衣", id: 1368 },
      { name: "金流玉束", id: 1369 },
      { name: "金流布鞋", id: 1370 },
      { name: "造化五行の戒", id: 13170 },
      { name: "造化五行の项链", id: 13171 }
    ],
    80: [
      { name: "无极の法杖", id: 1371 },
      { name: "无极の头巾", id: 1372 },
      { name: "无极の法袍", id: 1373 },
      { name: "无极の束带", id: 1374 },
      { name: "无极の布鞋", id: 1375 },
      { name: "守元の战戟", id: 1376 },
      { name: "守元の战盔", id: 1377 },
      { name: "守元の战甲", id: 1378 },
      { name: "守元の战带", id: 1379 },
      { name: "守元の战靴", id: 1380 },
      { name: "遁一の长剑", id: 1381 },
      { name: "遁一の头巾", id: 1382 },
      { name: "遁一の长衣", id: 1383 },
      { name: "遁一の玉束", id: 1384 },
      { name: "遁一の布鞋", id: 1385 },
      { name: "幽冥碧落の戒", id: 13174 },
      { name: "幽冥碧落の项链", id: 13175 }
    ],
    90: [
      { name: "生死の法杖", id: 1386 },
      { name: "生死の头巾", id: 1387 },
      { name: "生死の法袍", id: 1388 },
      { name: "生死の束带", id: 1389 },
      { name: "生死の布鞋", id: 1390 },
      { name: "永恒の战戟", id: 1391 },
      { name: "永恒の战盔", id: 1392 },
      { name: "永恒の战甲", id: 1393 },
      { name: "永恒の战带", id: 1394 },
      { name: "永恒の战靴", id: 1395 },
      { name: "太初の长剑", id: 1396 },
      { name: "太初の头巾", id: 1397 },
      { name: "太初の长衣", id: 1398 },
      { name: "太初の玉束", id: 1399 },
      { name: "太初の布鞋", id: 13100 },
      { name: "诸神黄昏の戒", id: 13176 },
      { name: "诸神黄昏の项链", id: 13177 }
    ],
    100: [
      { name: "黄泉の法杖", id: 13101 },
      { name: "黄泉の头巾", id: 13102 },
      { name: "黄泉の法袍", id: 13103 },
      { name: "黄泉の束带", id: 13104 },
      { name: "黄泉の布鞋", id: 13105 },
      { name: "阴阳の战戟", id: 13106 },
      { name: "阴阳の战盔", id: 13107 },
      { name: "阴阳の战甲", id: 13108 },
      { name: "阴阳の战带", id: 13109 },
      { name: "阴阳の战靴", id: 13110 },
      { name: "太虚の长剑", id: 13111 },
      { name: "太虚の头巾", id: 13112 },
      { name: "太虚の长衣", id: 13113 },
      { name: "太虚の玉束", id: 13114 },
      { name: "太虚の布鞋", id: 13115 },
      { name: "大道同源の戒", id: 13178 },
      { name: "大道同源の项链", id: 13179 }
    ]
  }
};

export const exploitConfig = {
  current: 65,
  tabList: [
    {
      label: "65级套装",
      value: 65
    },
    {
      label: "80级套装",
      value: 80
    },
    {
      label: "首饰套装",
      value: 70
    }
  ],
  equipMeun: {
    65: [
      { name: "醉卧沙场の枪", id: 13131 },
      { name: "醉卧沙场の盔", id: 13132 },
      { name: "醉卧沙场の甲", id: 13133 },
      { name: "醉卧沙场の带", id: 13134 },
      { name: "醉卧沙场の靴", id: 13135 }
    ],
    80: [
      { name: "天下无双の枪", id: 13136 },
      { name: "天下无双の盔", id: 13137 },
      { name: "天下无双の甲", id: 13138 },
      { name: "天下无双の带", id: 13139 },
      { name: "天下无双の靴", id: 13140 }
    ],
    70: [
      { name: "不死不灭の戒", id: 13172 },
      { name: "不死不灭の项链", id: 13173 }
    ]
  }
};

export const gangConfig = {
  current: 60,
  tabList: [
    {
      label: "60级套装",
      value: 60
    },
    {
      label: "75级套装",
      value: 70
    },
    {
      label: "80级套装",
      value: 80
    }
  ],
  equipMeun: {
    60: [
      { name: "义薄云天刃", id: 13116 },
      { name: "义薄云天盔", id: 13117 },
      { name: "义薄云天甲", id: 13118 },
      { name: "义薄云天带", id: 13119 },
      { name: "义薄云天靴", id: 13120 }
    ],
    70: [
      { name: "气吞山河刃", id: 13121 },
      { name: "气吞山河盔", id: 13122 },
      { name: "气吞山河甲", id: 13123 },
      { name: "气吞山河带", id: 13124 },
      { name: "气吞山河靴", id: 13125 }
    ],
    80: [
      { name: "权倾天下の刃", id: 13126 },
      { name: "权倾天下の盔", id: 13127 },
      { name: "权倾天下の甲", id: 13128 },
      { name: "权倾天下の带", id: 13129 },
      { name: "权倾天下の靴", id: 13130 }
    ]
  }
};

export const marriageConfig = {
  current: 55,
  tabList: [
    {
      label: "55级套装",
      value: 55
    },
    {
      label: "70级套装",
      value: 70
    },
    {
      label: "90级套装",
      value: 90
    }
  ],
  equipMeun: {
    55: [
      { name: "天定姻缘の杖", id: 13141 },
      { name: "天定姻缘の冠", id: 13142 },
      { name: "天定姻缘の甲", id: 13143 },
      { name: "天定姻缘の带", id: 13144 },
      { name: "天定姻缘の靴", id: 13145 }
    ],
    70: [
      { name: "生死相契の剑", id: 13146 },
      { name: "生死相契の冠", id: 13147 },
      { name: "生死相契の甲", id: 13148 },
      { name: "生死相契の带", id: 13149 },
      { name: "生死相契の靴", id: 13150 }
    ],
    90: [
      { name: "三生三世の剑", id: 13151 },
      { name: "三生三世の冠", id: 13152 },
      { name: "三生三世の甲", id: 13153 },
      { name: "三生三世の带", id: 13154 },
      { name: "三生三世の靴", id: 13155 }
    ]
  }
};

export const faBaoConfig = {
  current: 66,
  tabList: [
    {
      label: "66级法宝",
      value: 66
    },
    {
      label: "66级元素法宝",
      value: 67
    },
    {
      label: "75级法宝",
      value: 75
    },
    {
      label: "90级法宝",
      value: 90
    }
  ],
  equipMeun: {
    66: [
      { name: "嗜血枪", id: 13184 },
      { name: "水月镜", id: 13185 }
    ],
    67: [
      { name: "破空枪[冰]", id: 13186 },
      { name: "破空枪[雷]", id: 13187 },
      { name: "破空枪[风]", id: 13188 },
      { name: "破空枪[水]", id: 13189 },
      { name: "破空枪[火]", id: 13190 },
      { name: "鬼脸镜[冰]", id: 13191 },
      { name: "鬼脸镜[雷]", id: 13192 },
      { name: "鬼脸镜[风]", id: 13193 },
      { name: "鬼脸镜[水]", id: 13194 },
      { name: "鬼脸镜[火]", id: 13195 }
    ],
    75: [
      { name: "五法霹雳珠[冰]", id: 13196 },
      { name: "五法霹雳珠[雷]", id: 13197 },
      { name: "五法霹雳珠[风]", id: 13198 },
      { name: "五法霹雳珠[水]", id: 13199 },
      { name: "五法霹雳珠[火]", id: 13200 },
      { name: "五法乾坤袋[冰]", id: 13201 },
      { name: "五法乾坤袋[雷]", id: 13202 },
      { name: "五法乾坤袋[风]", id: 13203 },
      { name: "五法乾坤袋[水]", id: 13204 },
      { name: "五法乾坤袋[火]", id: 13205 }
    ],
    90: [
      { name: "山河社稷の图", id: 13206 },
      { name: "九纹大道の钟", id: 13207 }
    ]
  }
};
