const { TASK_TYPE } = require('../enum');
const taskMap = {
    100: {
        title: "序章",
        tips: "灰色古籍就在仙隐村(1,1)，翻开看看吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "我穿越了千年,在无尽的岁月长河中沉睡,最终忘却了一切,只为重回千年前……",
            "神秘声音：醒醒,快点醒醒!",
            "一道犹如风铃般的声音将你从沉睡中唤醒,你睁开眼发现面前是一卷灰色古籍。",
            "&翻开灰色古籍",
        ],
        done: [
            "古籍中记载了一段千年前的隐秘......",
            "千年前一位名为东坡先生的大能制作出四个馒头，分别献给了人，仙，妖三族族长。",
            "三族族长吃下馒头后实力暴涨，心中皆是衍生出称霸三族的念头。",
            "不过三族族长都吃过馒头，实力不相上下，于是都想将最后一个馒头占为己有，一场惊世大战因此爆发。",
            "神秘声音：&醒醒，快点醒醒！",
        ],
        reward: {
            exp: 500,
            article: '100-30,101-30'
        },
        grand: {
            npc: {
                id: 100,
                address: "10000,0,0"
            },
        },
        nextId: 101
    },
    101: {
        title: "初识狐晶丽",
        tips: "神秘少女就在仙隐村(1,2)，去和她聊聊。",
        type: TASK_TYPE.duihau,
        receive: [
            "你从古树下苏醒，便见到一个狐族摸样的红衣少女。",
            "狐晶丽：你终于醒了。",
            "&你是？",
        ],
        done: [
            "狐晶丽似乎没有听到你的询问，当即拉着你朝村外跑去。",
            "你则是一脸懵逼：&你拉我去干嘛？",
        ],
        reward: {
            exp: 600,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 102
    },
    102: {
        title: "惩戒巡逻山贼",
        tips: "巡逻山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "很快你就被少女带到了一处山坡，只见一个个魁梧大汉在这里来回巡逻。",
            "你有些惊愕：这些不会山贼吧？",
            "这时你突然感觉自己被人推了出去，回头一看正是狐晶丽。",
            "巡逻山贼：&什么人？",
        ],
        done: [
            "瞬间几个山贼朝你围了过来，你惊慌之下一顿王八拳终于将它们放倒。",
            "不过打斗的动静就引来了更多山贼，你二话不说，拔腿就跑。",
            "你：&风紧扯呼，先撤！",
        ],
        reward: {
            exp: 700,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        complete: {
            freak: "20011-2"
        },
        nextId: 103
    },
    103: {
        title: "狼狈逃回",
        tips: "仙隐村外的山贼数量实在是太多了赶紧撤吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "你头也不回的跑回了仙隐村，这时狐晶丽也气喘吁吁的追了上来",
            "狐晶丽：你怎么跑了，揍他们啊！",
            "你摆了摆手&：打不过。",
        ],
        done: [
            "狐晶丽：看来必须拿出我珍藏多年的宝物了。",
            "你眼睛顿时一亮：&宝物！！！",
        ],
        reward: {
            exp: 700,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 104
    },
    104: {
        title: "全身武装",
        tips: "破旧宝箱就在仙隐村(1,1)，挑一个打开吧。",
        type: TASK_TYPE.biaoxiang,
        receive: [
            "只见狐晶丽在大树前灰头土脸的一顿乱挖，下面竟然埋了七八个破旧不堪的箱子",
            "你：这堆破烂就是你说的宝物？",
            "狐晶丽：当然是宝物了，不过时间久了，我也忘记是藏在那个箱子了。",
            "你：......",
        ],
        done: [
            "时间紧迫，你随便找了个木箱打开，只见里面竟然海真有一堆宝贝。",
            "&继续",
        ],
        action: {
            type: 1,
            text: '破旧宝箱',
            rate: 2
        },
        reward: {
            exp: 900,
            article: '1630'
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 105
    },
    105: {
        title: "惩戒持刀山贼",
        tips: "持刀山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "这时村外传来一阵动静，原来是之前的山贼追了过来。",
            "狐晶丽：不好，它们追来了。",
            "你信心十足：&别怕，我去收拾他们。",
        ],
        done: [
            "持刀山贼完全不是你的对手，几个回合就被你打的落荒而逃。",
            "狐晶丽：你怎么把他们放走了。",
            "你：&有什么问题？",
        ],
        reward: {
            exp: 1000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "20012-2"
        },
        nextId: 106
    },
    106: {
        title: "击杀持斧山贼",
        tips: "持斧山贼就在仙隐村(1,3)，赶紧过去击杀他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：这些可是黑风寨的山贼，它们一定会卷土重来。",
            "说完就见之前败走的山贼带着一群手握巨斧山贼又找上门来。",
            "&迎战。",
        ],
        done: [
            "啊！",
            "持斧山贼发出一身惨叫，同时放出一道烟花在天空炸开。",
            "狐晶丽：&不好，这是信号弹!",
        ],
        reward: {
            exp: 1200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "20013-2"
        },
        nextId: 107
    },
    107: {
        title: "突出重围",
        tips: "精英山贼就在仙隐村(1,3)，赶紧冲出重围吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：不好，这是信号弹，方圆百里的山贼恐怖都会朝这里聚来。",
            "话音刚落，就见四面八方的山贼朝村子聚拢。",
            "狐晶丽：完了，我们被包围了。",
            "&杀出重围。",
        ],
        done: [
            "危机时刻你爆发出强大的力量护着狐晶丽硬生生杀出了重围。",
            "狐晶丽重重的送了一口气：呼，终于逃出来了。",
            "你：还不能放松，那群山贼肯定还在找我们。",
            "狐晶丽：啊，那怎么办？",
            "你：&直捣黄龙。",
        ],
        reward: {
            exp: 1400,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "20014-2"
        },
        nextId: 108
    },
    108: {
        title: "偷袭二当家",
        tips: "二当家就在仙隐村(1,4)，趁机出手袭击他吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "月黑风高，你带着狐晶丽一路悄悄的潜入了黑风寨。",
            "大厅内一个刀疤汉子正在大厅里正在威逼几个刚刚抓来的女子与他玩乐。",
            "狐晶丽：这是黑风寨二当家，实力非常强。",
            "于是你决定：&袭击。",
        ],
        done: [
            "你不讲武德的偷袭非常顺利，二当家到死都没反应过来头颅便直接落地。",
            "狐晶丽：你太棒了。",
            "如此血腥一幕，吓得一众女子连声惊叫。",
            "你：&不好。",
        ],
        reward: {
            exp: 1600,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "20015-2"
        },
        nextId: 109
    },
    109: {
        title: "迎战大当家",
        tips: "大当家就在仙隐村(1,4)，赶紧出招迎战吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "果然这群女子的尖叫立即引来的黑风寨大当家。",
            "大当家举着一柄寒光凛凛的大刀朝你冲了过来：小子，给我死。",
            "&迎战大当家。",
        ],
        done: [
            "啊！！！",
            "大当家发出一声惨叫，突然发出一道暗器朝你射过来。",
            "狐晶丽飞身一跃挡在你前面：小心暗器。",
            "&查看狐晶丽伤势。",
        ],
        reward: {
            exp: 1800,
            tael: 50000
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "20016-1"
        },
        nextId: 1010
    },
    1010: {
        title: "暗器有毒",
        tips: "狐晶丽替你挡住了暗器，赶紧查看她的伤势吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "屁股，我的屁股！",
            "只见那暗器好巧不巧正好扎在狐晶丽屁股上，此时已经布满发黑的血。",
            "你脸色一变：&不好，这暗器有毒。",
        ],
        done: [
            "狐晶丽一脸惊慌：啊，那怎么办，我不会要死了吧，呜呜呜，我还没成亲呢。",
            "你：&放心，我不会让你有事的",
        ],
        reward: {
            exp: 2000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        nextId: 1011
    },
    1011: {
        title: "收集蛇胆",
        tips: "斑斓蛇就在仙隐村(1,5)，快去收集蛇胆压制毒性。",
        type: TASK_TYPE.shouji,
        receive: [
            "狐晶丽：我想起来了，后山有一种名为斑斓蛇的妖兽，它的蛇胆肯定能解毒。",
            "嘶嘶嘶！",
            "这时后山传来一阵细微的动静，正是一群毒蛇朝你们包围过来。",
            "&只能以毒攻毒试试了。",
        ],
        done: [
            "你将毒蛇驱散顺手还找了几颗蛇胆，递给已经是一脸苍白的狐晶丽。",
            "狐晶丽：你先出去等我。",
            "你正要问为什么，突然想起她的伤口部位，好像自己留在这里是有点不礼貌了。",
            "&继续",
        ],
        reward: {
            exp: 2500,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            article: "210-2"
        },
        nextId: 1012
    },
    1012: {
        title: "驱赶四眼老鹰",
        tips: "四眼老鹰就在仙隐村(1,5)，赶紧将它们击退吧。",
        type: TASK_TYPE.zhandou,
        replace: true,
        receive: [
            "走出大厅后你立即就察觉到头顶有一道道强烈的敌意。",
            "抬头看去，只见空中一群四只眼睛的老鹰似乎是被斑斓蛇胆吸引直接朝黑风寨大厅扑来。",
            "&驱赶四眼老鹰。",
        ],
        done: [
            "四眼老鹰极为难缠，不过在你击杀几只四眼老鹰后其余鹰群也都四散逃了。",
            "这时大厅内传来狐晶丽的声音：{name}，你快来看这是什么？",
            "只见狐晶丽脸色好了不少，手中正拿着一张看着有些破旧的羊皮卷。",
            "你：&你没事了？",
        ],
        reward: {
            exp: 3000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "20017-2"
        },
        nextId: 1013
    },
    1013: {
        title: "羊皮卷",
        tips: "狐晶丽发现了一张古怪的羊皮卷，似乎是一张藏宝图。",
        type: TASK_TYPE.duihau,
        receive: [
            "狐晶丽摇了摇头：蛇胆暂时将毒压制了，你看这羊皮卷似乎有些古怪。",
            "你：&莫非这是藏宝图？",
        ],
        done: [
            "狐晶丽：是不是藏宝图我们去找一趟大泽谷就知道了。",
            "你：大泽谷？",
            "狐晶丽：不过我们出发前还需要先回主城准备一下。",
            "&继续",
        ],
        reward: {
            exp: 3500,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        nextId: 1014
    },
    1014: {
        title: "后山迷宫",
        tips: "漆黑的夜晚看不清路，你与狐晶丽似乎迷路了。",
        type: TASK_TYPE.migong,
        receive: [
            "漆黑的夜晚下，伸手不见五指，突然前面带路的狐晶丽突然停了下来。",
            "你：怎么了？",
            "狐晶丽：我们好像迷路了。",
            "你无奈的摇了摇头：看来只能随便选个方向试试。",
        ],
        done: [
            "狐晶丽：呼，终于走出来了。",
            "你：走吧，这次可别又迷路了。",
            "&剑舞城。",
        ],
        reward: {
            exp: 4000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        action: {
            type: 2,
            text: ['东', '南', '西', '北'],
            num: 2
        },
        nextId: 1015
    },
    1015: {
        title: "了解剑舞城",
        tips: "狐晶丽准备物品需要时间，先去逛逛剑舞城吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "天微微亮你与狐晶丽终于来到了一座古老的主城。",
            "狐晶丽：终于到了，我要去准备一些驱虫物品，你先四处转转，晚点我们在集合。",
            "你点了点头：&好的。",
        ],
        done: [
            "狐晶丽刚走不久，一个青年就朝你走了过来。",
            "百晓生：这位公子，在下剑舞城百晓生，请问有需要帮忙的。",
            "你掏出一锭银子：&带我四处转转吧。",
        ],
        reward: {
            exp: 5000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10001,0,0"
            },
            tNpc: {
                id: 102,
                address: "10001,0,0"
            },
        },
        nextId: 1016
    },
    1016: {
        title: "剑舞城",
        tips: "百晓生就在剑舞城(1,1)，快去跟着他了解剑舞城吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "百晓生大喜接过银子开始解说：我们现在这个地方就是剑舞城主城，每日登录后可在进行登录抽奖。",
            "&继续",
        ],
        done: [
            "百晓生：对了，各种活动也可以从这里进入。",
            "你点了点头：&知道了。",
        ],
        reward: {
            exp: 6000,
        },
        grand: {
            npc: {
                id: 102,
                address: "10001,0,0"
            },
        },
        nextId: 1017
    },
    1017: {
        title: "交易区",
        tips: "百晓生就在剑舞城(1,2)，快去跟着他了解剑舞城吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "很快你与百晓生来到一处极为繁华的地方，街道两边全是出售法宝道具的店铺。",
            "你：&这是什么地方？",
        ],
        done: [
            "百晓生：这里是交易区，玩家可以在这里开店，珍贵的道具还可以拿去拍卖行进行拍卖。",
            "&继续",
        ],
        reward: {
            exp: 7000,
        },
        grand: {
            npc: {
                id: 102,
                address: "10001,0,1"
            },
        },
        nextId: 1018
    },
    1018: {
        title: "生活区",
        tips: "百晓生就在剑舞城(1,3)，快去跟着他了解剑舞城吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "很快你来到一处更加热闹的地区，偶尔还能看到男男女女朝一棵树祈祷。",
            "你：这莫非是传说中的姻缘树？",
            "百晓生：是的，玩家可以来这里与心仪的道侣结缘哟。",
            "&继续",
        ],
        done: [
            "走着走着突然前面传来一阵轰动，人群传来无数的欢呼声。",
            "你与百晓生当即好奇的小跑过去凑热闹。",
            "&继续",
        ],
        reward: {
            exp: 8000,
        },
        grand: {
            npc: {
                id: 102,
                address: "10001,0,2"
            },
        },
        nextId: 1019
    },
    1019: {
        title: "异界裂缝",
        tips: "百晓生就在剑舞城(1,4)，快去跟着他了解剑舞城吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "百晓生：没想到又有大修士从极北深渊获得了神装。",
            "你：神装！！！",
            "百晓生：没错，玩家可以从这里进入极北深渊，不仅仅可以获得大量经验还有可以用积分兑换神装。",
            "你双眼瞬间放光：&我也去试试",
        ],
        done: [
            "你刚动身就被旁边百晓生拉住：诶诶诶，极北深渊可是要50级才能进去的。",
            "你：......",
            "百晓生：对了，玩家10级后可到这里找天机老人提升境界。",
            "&天机老人",
        ],
        reward: {
            exp: 9000,
        },
        grand: {
            npc: {
                id: 102,
                address: "10001,0,3"
            },
        },
        nextId: 1020
    },
    1020: {
        title: "修真境界",
        tips: "天机老人就在剑舞城(1,4)，快去找他了解修真境界吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "天机老人：修真一途可分十二境：淬体，筑基，造化，涅槃，灵海，彼岸，神轮，超凡，至尊，黄庭，鸿蒙，道境。",
            "你：修真一途，还很真是遥远啊。",
            "天机老人：小家伙，你去藏灵洞寻来10块阴灵石，10块阳灵石我可助你破镜。",
            "你：&晚辈这就去。",
        ],
        done: [
            "在天机老人的帮助下，你成功踏入了淬体境。",
            "这时狐晶丽找到了你，她已经准备好前往大泽谷的驱虫物品了。",
            "&前往大泽谷",
        ],
        reward: {
            exp: 10000,
        },
        grand: {
            npc: {
                id: 103,
                address: "10001,0,3"
            },
            tNpc: {
                id: 101,
                address: "10001,0,3"
            },
        },
        nextId: 1021
    },
    1021: {
        title: "前往大泽谷",
        tips: "狐晶丽买到假货了，快亲自出手驱散大泽谷(1,1)的大泽毒蚊吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "大泽谷四处皆是草丛与沼泽，毒虫蚊蛇四处可见。",
            "只见一群血色蚊子朝你们飞了过来，当即狐晶丽便拿出驱蚊散点燃，不过驱蚊散不仅没有效果，反倒是吸引了更多的血色蚊子。",
            "狐晶丽顿时一惊连忙扑灭驱蚊散：我去，买到假货了。",
            "你嘴角一抽：&没想到异界也有假货？",
        ],
        done: [
            "你掐出一道火焰法决，直接将成群的大泽毒蚊驱散。",
            "狐晶丽这才松了口气：该死的奸商，本姑娘回去一定要找他算账。",
            "&继续赶路。",
        ],
        reward: {
            exp: 12000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,0"
            },
        },
        complete: {
            freak: "20021-4"
        },
        nextId: 1022
    },
    1022: {
        title: "毒蛇拦路",
        tips: "大泽毒蛇在大泽谷(1,1)拦住了去路，赶紧将它们驱赶。",
        type: TASK_TYPE.zhandou,
        receive: [
            "不过你与狐晶丽还没走几步，就见前面的路上出现了一群毒蛇拦住了去路。",
            "狐晶丽：不好，这是大泽毒蛇，咬一口就会让人当场丧命。",
            "你：&这么毒？",
        ],
        done: [
            "你出手斩了几条拦路毒蛇，其余的毒蛇吓得纷纷逃走。",
            "接下来你们又遭受几波袭击，狐晶丽突然在前面停了下来。",
            "&上去询问。",
        ],
        reward: {
            exp: 15000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,0"
            },
        },
        complete: {
            freak: "20022-4"
        },
        nextId: 1023
    },
    1023: {
        title: "收集毒囊",
        tips: "大泽毒蛙在大泽谷(1,2)，击杀它们可掉落毒囊。",
        type: TASK_TYPE.shouji,
        receive: [
            "只见前面路被一片灰黑的雾气笼罩并且还在不断的扩散。",
            "狐晶丽：这是大泽毒蛙吐出的毒瘴气，它们体内的毒囊可以免疫瘴毒。",
            "&我去取来。",
        ],
        done: [
            "你与狐晶丽有毒囊护体周围的瘴气纷纷避开。",
            "毒瘴区域内竟然还生长着一株株形状如蛇的诡异兰花。",
            "&继续",
        ],
        reward: {
            exp: 18000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,1"
            },
        },
        complete: {
            article: "211-2"
        },
        nextId: 1024
    },
    1024: {
        title: "天地奇物",
        tips: "大泽毒蝎在大泽谷(1,2)，快去将它们击杀吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：这是竟然是蛇蝎兰，传说可克制世间一切毒物。",
            "这时一群毒蝎悄悄的爬到蛇蝎兰周围，似乎也想要染指这天地奇物。",
            "狐晶丽：不好，快阻止它们。",
            "&击退大泽毒蝎",
        ],
        done: [
            "狐晶丽话音还未落下，你便以瞬雷不及掩耳将大泽毒蝎击杀。",
            "这时蛇蝎兰一股淡淡的花香散发开来。",
            "狐晶丽：&这是要成熟了！",
        ],
        reward: {
            exp: 20000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,1"
            },
        },
        complete: {
            freak: "20024-4"
        },
        nextId: 1025
    },
    1025: {
        title: "蛇蝎兰成熟",
        tips: "大地魔熊在大泽谷(1,3)，快去将它们击败吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "眼见蛇蝎兰就要成熟，大地竟然突然颤抖起来，只见一群巨大的魔熊正朝这里赶来。",
            "狐晶丽：这是周围的大地魔熊，它们被香气吸引过来了。",
            "&击败大地魔熊",
        ],
        done: [
            "你凭借一身强横的修为将大地魔熊全部击溃，这一刻蛇蝎兰终于是彻底成熟。",
            "一股强大的药力散发而开，一些距离比较近的毒物仿佛遇到了天敌般全部倒地死亡。",
            "你：&不愧是天地奇物。",
        ],
        reward: {
            exp: 25000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,1"
            },
        },
        complete: {
            freak: "20025-4"
        },
        nextId: 1026
    },
    1026: {
        title: "蛇蝎兰到手",
        tips: "大泽妖狼在大泽谷(1,3)，击杀它们可掉落蛇蝎兰。",
        type: TASK_TYPE.shouji,
        receive: [
            "狐晶丽正要上前采摘，突然几道如鬼魅般的狼妖掠过将蛇蝎兰叼到嘴里。",
            "&敢截胡，找死！",
        ],
        done: [
            "瞬息间你便追上了大泽妖狼，一拳一头妖狼，全部放倒，有两头叼着蛇蝎兰的狼妖更是牙都被你打掉了几颗。",
            "你这才捡起捡起地上的蛇蝎兰。",
            "&继续",
        ],
        reward: {
            exp: 30000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,1"
            },
        },
        complete: {
            article: "212-2"
        },
        nextId: 1027
    },
    1027: {
        title: "树妖拦路",
        tips: "你与狐晶丽在大泽谷(1,4)又迷路了，赶紧找个方向走出去吧。",
        type: TASK_TYPE.migong,
        receive: [
            "你与狐晶丽奖毒蛇兰服用后，路上终于是没有毒物敢找麻烦了。",
            "不过随着你们走进一片乱林中发现又迷路了。",
        ],
        done: [
            "无奈你只能选个方向听天由命，刚走几步突然发现周围的树木似乎在移动。",
            "&这些树不对劲。",
        ],
        reward: {
            exp: 35000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,3"
            },
        },
        action: {
            type: 2,
            text: ['东', '南', '西', '北'],
            num: 2
        },
        nextId: 1029
    },
    1029: {
        title: "惩戒树妖",
        tips: "你们迷路原来是周围的树妖在大泽谷(1,4)搞鬼，快去教训它们一顿吧",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：我说怎么迷路了，原来是大泽树妖在搞鬼。",
            "&收拾树妖",
        ],
        done: [
            "大泽树妖被你一顿暴揍，也不敢再捣乱了纷纷让开路来。",
            "你们也终于来到了大泽谷的深处，一座如世外桃源的小山谷便隐藏在其中。",
            "&欧冶子居所",
        ],
        reward: {
            exp: 40000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,3"
            },
        },
        complete: {
            freak: "20027-4"
        },
        nextId: 1030
    },
    1030: {
        title: "欧冶子",
        tips: "欧冶子就在大泽谷(1,5)，快将神秘羊皮卷给个他看看吧。",
        type: TASK_TYPE.duihau,
        replace: true,
        receive: [
            "只见山谷中有几间木屋，一个年迈的老者正悠闲的躺在太师椅上晒太阳。",
            "见到老者后狐晶丽笑嘻嘻的就跑了过去：老头，我回来了！",
            "对于少女的称呼老者似乎也习惯了：你这小丫头，又跑什么地方疯去了？",
            "突然他目光一顿看到了你：这是？",
            "&晚辈{name}，见过欧冶子前辈。",
        ],
        done: [
            "这时狐晶丽拿出在黑风寨得到的羊皮卷：老头，你看这是什么？",
            "欧冶子有些无奈的接过羊皮卷，当他看到上面的纹路后脸色瞬间巨变，声音颤抖道：这上面似乎记载了传说中馒头的下落。",
            "狐晶丽顿时大喜：哈哈，太好了，那馒头藏在什么地方呢？",
            "你也对那传说中能引发三族大战的馒头也是有些好奇。",
            "&继续",
        ],
        reward: {
            exp: 45000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        nextId: 1031
    },
    1031: {
        title: "收集精血",
        tips: "大泽巨蟒就在大泽谷(1,4)，击杀后可掉落巨莽精血。",
        type: TASK_TYPE.shouji,
        receive: [
            "欧冶子摇了摇头：这羊皮卷上有封印，遮盖了馒头的具体下落。",
            "狐晶丽：那要如何才能破解封印呢？",
            "欧冶子：大泽谷外有一种巨蟒，它们血液极具灵性必然可以破解。",
            "狐晶丽当即将头看向你，你苦笑一声：&看来又得当打工仔了。",
        ],
        done: [
            "欧冶子将巨蟒精血倒在羊皮卷上，羊皮卷表面瞬间开始如蛇一般蜕皮。",
            "&继续",
        ],
        reward: {
            exp: 50000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        complete: {
            article: "213-2"
        },
        nextId: 1032
    },
    1032: {
        title: "前往映月崖",
        tips: "羊皮卷上的阵法极为玄奥，快去映月崖寻找守墓人帮忙把。",
        type: TASK_TYPE.duihau,
        receive: [
            "羊皮卷彻底蜕变后，欧冶子的眉头又微皱了起来。",
            "狐晶丽：老头，怎么样了？",
            "欧冶子叹了口气：这羊皮卷的封印上竟然还有一道阵法，看来只能去找那个老家伙帮忙了。",
            "&继续",
        ],
        done: [
            "原来欧冶子嘴里的老家伙是一位阵法大宗师，世世代代镇守在葬剑之地，又被称为守墓人。",
            "&前往映月崖",
        ],
        reward: {
            exp: 100000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        nextId: 1033
    },
    1033: {
        title: "映月崖",
        tips: "干枯行尸在映月崖(1,1)朝你们发起攻击，快出手击败它们吧。",
        type: TASK_TYPE.zhandou,
        level: 30,
        receive: [
            "映月崖一片荒凉，整个天空都蒙着一层灰雾仿佛这方天地都被遗弃了一般看不到丝毫的生机。",
            "这时一群干枯的行尸缓缓朝你们围了过来。",
            "你连忙提醒：&小心。",
        ],
        done: [
            "击杀几具干枯的行尸后，你发现它们的尸体竟然会散发出一缕灰色雾气。",
            "这时你突然察觉身后有人偷袭，回头一看竟然是狐晶丽。",
            "此时她双眼空洞无神仿佛没有思想的傀儡一般，瞬间你就意识到这些灰雾有问题。",
            "你连忙将她控制住喊道：&快醒醒！",
        ],
        reward: {
            exp: 75000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10003,0,0"
            },
        },
        complete: {
            freak: "20031-6"
        },
        nextId: 1034
    },
    1034: {
        title: "击退腐肉秃鹫",
        tips: "腐肉秃鹫在映月崖(1,1)对你与狐晶丽发起了攻击，快出手击退它们吧。",
        type: TASK_TYPE.zhandou,
        level: 30,
        receive: [
            "狐晶丽并没有被你的喊声唤醒，此时周围的行尸又围了过来，无奈你只能一掌将她拍晕放在地上。",
            "正当你在抵挡干枯行尸时，天空传来一声声嘶鸣。",
            "你抬头一看竟然是一群浑身都腐烂了的秃鹫朝着躺在地面的狐晶丽冲去。",
            "你顿时大怒：&找死！",
        ],
        done: [
            "凌空一掌将空中袭击的几只秃鹫击毙，眼见周围行尸与天空的秃鹫越来越多，你明白不能继续纠缠下去了。",
            "二话不说你便抱起昏迷的狐晶丽找个行尸比较少的方向进行突围。",
            "&继续",
        ],
        reward: {
            exp: 75000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10003,0,0"
            },
        },
        complete: {
            freak: "20032-6"
        },
        nextId: 1035
    },
    1035: {
        title: "迷失剑客",
        tips: "迷失剑客在映月崖(1,2)围攻青衫青年，快去出手相助吧。",
        type: TASK_TYPE.zhandou,
        replace: true,
        receive: [
            "你抱着狐晶丽刚刚逃出生天，突然从远处传来一阵阵恐怖的战斗波动。",
            "只见不远处一名剑眉星目的俊秀青衫青年，正手握三尺青峰傲立在成千上万的尸体之上。",
            "此时还有一群群强大的剑客与刀客不要命的朝他杀去，即便法力已经开始枯竭，青年依旧是没有退后半步。",
            "&出手相助",
        ],
        done: [
            "你将狐晶丽暂时放在一块巨石上，随即便加入了战斗。",
            "青衫青年压力瞬间大减，对你抬手谢道：在下拎壶冲，多谢阁下出手相助。",
            "你也抬手回应：&在下{name}。",
        ],
        reward: {
            exp: 100000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        complete: {
            freak: "20033-6"
        },
        nextId: 1036
    },
    1036: {
        title: "迷失刀客",
        tips: "迷失刀客就在映月崖(1,2)，快去将他们击杀吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "战斗中你发现拎壶冲一身修为丝毫不弱与你，难怪可以在这能迷惑心神的灰雾中不受影响。",
            "随着一波一波的迷失剑客倒下，终于是只剩下几名迷失刀客。",
            "&击杀迷失刀客",
        ],
        done: [
            "拎壶冲直接瘫坐在地上重重的喘着粗气：终于将这些怪物镇压了。",
            "&继续",
        ],
        reward: {
            exp: 100000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        complete: {
            freak: "20034-6"
        },
        nextId: 1037
    },
    1037: {
        title: "守墓人?",
        tips: "难道拎壶冲就是守墓人，快去映月崖(1,2)找他聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "拎壶冲：映月崖数百年不曾有修士踏入，你来此是有什么事嘛？",
            "你点了点头开口回道：我来这里找守墓人。",
            "拎壶冲微微一愣，随即一脸错愕看着你道：我们难道认识嘛？",
            "你也一脸愕然：&你就是守墓人?",
        ],
        done: [
            "(经过一番了解，你这才知道原来守墓人世代单传，欧冶子让你找的是拎壶冲的师尊，不过他师尊早在五十年前就陨落了，随即你也将自己的来意及狐晶丽的事情告诉了拎壶冲。)",
            "拎壶冲眉头一皱：先去看看你朋友吧。",
            "&继续",
        ],
        reward: {
            exp: 150000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        nextId: 1038
    },
    1038: {
        title: "收集月光草",
        tips: "幽光月狼在映月崖(1,3)，击杀后有概率掉落月光草。",
        type: TASK_TYPE.shouji,
        receive: [
            "拎壶冲看了一眼狐晶丽开口道：还好吸入的灰雾不多，你去收集两种材料。",
            "你直接问道：什么材料？",
            "拎壶冲：在映月崖的西边有一种月光草的东西，不过你要小心守护在周围的幽光月狼。",
            "&收集月光草",
        ],
        done: [
            "接过一株株在月色下发光的草，拎壶冲点了点头：没错，这就是月光草。",
            "&下个材料是什么呢？",
        ],
        reward: {
            exp: 150000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        complete: {
            article: "214-4"
        },
        nextId: 1039
    },
    1039: {
        title: "冰系魔核",
        tips: "幽冰魔狼在映月崖(1,3)，击杀后有概率掉落冰系魔核。",
        type: TASK_TYPE.shouji,
        receive: [
            "拎壶冲：接下只要收集几颗冰系魔核就好了，你去杀几头幽冰魔狼。",
            "&收集冰系魔核",
        ],
        done: [
            "两种材料到手后，接下来拎壶冲就拿出一尊药鼎开始炼制丹药，不多久一颗森白的丹药在丹鼎内成型。",
            "拎壶冲：这是冰心丹，给你朋友服下就行了。",
            "&继续",
        ],
        reward: {
            exp: 200000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        complete: {
            article: "215-4"
        },
        nextId: 1040
    },
    1040: {
        title: "千年秘闻",
        tips: "拎壶冲就在映月崖(1,3)，快去找他了解千年前三族大战的真相吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "(不多久狐晶丽就醒了过来，经过一番了解后也知道了发生了什么事，拎壶冲也得知道羊皮卷上记载着馒头下落的事情，也知道你们来找守墓人就是为了破解上面的阵法。)",
            "拎壶冲摇了摇头：要是早点来我确实可以帮你们破解，可惜你们来的太晚了。",
            "你一脸疑惑：太晚是什么意思？",
            "拎壶冲没有回答，而是开口问道：你们可知数千年前人，仙，妖三族大战的真相。",
            "你与狐晶丽都是微微一愣：&难道不是三族为了称霸争夺馒头？",
        ],
        done: [
            "拎壶冲轻轻一笑开始说起数千年前的秘闻.......",
            "数千年前人，仙，妖，三族争夺馒头导致元气大伤，而这却是域外魔族再背后推波助澜想趁机入侵大陆。",
            "域外魔族强者无数，元气大伤的三族无一族能其单独抗衡，三族几乎都要被魔族屠杀殆尽。",
            "这时天地间出现了一名极为神秘的强者，他以一己之力促成了人，仙，妖三族联盟抵御域外魔族。",
            "只是当时三族强者死伤无数，纵然联合也无法魔族彻底消灭，只能将他们重新封印到域外，不过也有一些魔族强者被封印在战场中。",
            "你一脸震撼：&所以说天地间还有魔族存在？",
        ],
        reward: {
            exp: 200000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        nextId: 1041
    },
    1041: {
        title: "剑魔封印",
        tips: "从拎壶冲嘴里了解到映月崖竟然是封印着一尊剑魔后，你决定与他一起去消灭剑魔。",
        type: TASK_TYPE.duihau,
        receive: [
            "拎壶冲点了点头：映月崖内的葬剑冢便镇压着一尊剑魔，而我守墓一脉的职责便是不让剑魔破开封印。",
            "听到这些秘闻你才知道原来这个青衫青年竟然背负了如此重大的责任，只是你有些不解这一切与破解羊皮卷上的阵法有什么关系。",
            "拎壶冲似乎看出来了你的疑惑，淡笑一声：近日葬剑冢内的剑魔封印突然松动起来，我必须趁封印未破解前将其斩杀。",
            "你决定：&我和你一起去！",
        ],
        done: [
            "拎壶冲顿时一惊：什么！！！",
            "你轻轻一笑：我帮斩杀剑魔，事后你帮我破解羊皮卷的封印。",
            "见你没开玩笑，拎壶冲无奈的苦笑一声：如果不怕死，那就跟我了吧。",
            "&跟上去",
        ],
        reward: {
            exp: 250000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,1"
            },
        },
        nextId: 1042
    },
    1042: {
        title: "击杀魔化妖虎",
        tips: "魔化妖虎拦在映月崖(1,4)，快去击杀它们吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "很快你们就来到了一处峡谷入口，不过这里却有一群极为狂暴的妖兽，突然一群浑身散发着恐怖魔气的妖兽朝你们冲了过来。",
            "拎壶冲：不好，这些妖兽都被魔气感染了。",
            "&击杀魔化妖虎",
        ],
        done: [
            "拎壶冲有些气踹吁吁：没想到这些妖虎被魔气感染后竟然强到了这种地步。",
            "&继续",
        ],
        reward: {
            exp: 250000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,3"
            },
        },
        complete: {
            freak: "20037-6"
        },
        nextId: 1043
    },
    1043: {
        title: "击杀魔化妖狼",
        tips: "魔化妖狼拦在映月崖(1,4)，快去击杀它们吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "嗷嗷嗷！！！",
            "这时一群狼妖又围了上来，它们身上都散发与虎妖一样的魔族气息。",
            "&击杀魔化妖狼",
        ],
        done: [
            "清理完全部妖兽后你们进入了峡谷内，只见峡谷内荒凉一片地面上皆是无名墓。",
            "你微微一愣：这些莫非是千年陨落的先辈强者？",
            "拎壶冲点了点头：他们陨落后依旧以自身残魂为阵封印剑魔。",
            "&进入葬剑冢",
        ],
        reward: {
            exp: 300000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10003,0,3"
            },
        },
        complete: {
            freak: "20038-6"
        },
        nextId: 1044
    },
    1044: {
        title: "惩戒盗墓贼",
        tips: "盗墓贼就在葬剑冢(1,1)盗取先辈坟冢，快去狠狠的惩戒它们吧。",
        type: TASK_TYPE.zhandou,
        level: 40,
        receive: [
            "你们刚刚踏入葬剑冢就发现一群鬼鬼祟祟的人。",
            "拎壶冲的脸色顿时一变：这群该死的盗墓贼，竟然连先辈坟冢都敢觊觎！",
            "&惩戒盗墓贼",
        ],
        done: [
            "你们三人将盗墓贼全部赶走后，拎壶冲的脸色瞬间一变，随即急匆匆的御剑朝葬剑冢内飞去。",
            "&跟上去",
        ],
        reward: {
            exp: 500000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,0"
            },
        },
        complete: {
            freak: "20041-8"
        },
        nextId: 1045
    },
    1045: {
        title: "破阵魔修",
        tips: "破阵魔修就在葬剑冢(1,1)破坏阵法，快去将它们击杀吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "只见葬剑冢深处一座巨大的剑冢，里面封印的正是传说中的剑魔。",
            "此时一群魔气冲天的恐怖修士正在使用法术不断轰击镇压剑冢的阵法。",
            "拎壶冲直接拔剑冲上去：不好，这群魔修在破坏阵法。",
            "&诛杀破阵魔修",
        ],
        done: [
            "这时剑冢内一缕缕恐怖的魔气散发出来，每一缕都蕴含毁天灭地的力量。",
            "拎壶冲脸色顿时一变：不好，阵法出现了裂痕。",
            "你：&现在怎么办？",
        ],
        reward: {
            exp: 500000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,0"
            },
        },
        complete: {
            freak: "20042-8"
        },
        nextId: 1046
    },
    1046: {
        title: "守墓铁甲",
        tips: "守墓铁甲被魔气污浊在葬剑冢(1,2)阻拦了你们的去路。",
        type: TASK_TYPE.zhandou,
        receive: [
            "拎壶冲二话不说直接就进入了剑冢内部，你与狐晶丽也是连忙跟上。",
            "只见剑冢内是一条看不到尽头的昏暗的通道，突然前方传来整齐的铁甲碰撞声。",
            "拎壶冲：没想到连守墓铁甲也被魔气感染了。",
            "&击溃守墓铁甲。",
        ],
        done: [
            "守墓铁甲被击倒后立马化为一缕黄土散落一地，不过你也发现这些铁甲生前似乎都是修为不凡的人族修士。",
            "不等你开口，拎壶冲便脸色有些严肃道：当年为了镇压剑魔无数人族修士死后将肉身置于剑冢内加固封印，只是千年过去他们的肉身竟然也被魔气污浊了。",
            "你听完似乎隐隐看到了千年前那场惨烈的大战，同时也更加明白魔族的恐怖。",
            "&继续",
        ],
        reward: {
            exp: 750000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,1"
            },
        },
        complete: {
            freak: "20043-8"
        },
        nextId: 1047
    },
    1046: {
        title: "守墓银甲",
        tips: "守墓银甲被魔气污浊在葬剑冢(1,2)阻拦了你们的去路。",
        type: TASK_TYPE.zhandou,
        receive: [
            "拎壶冲：这些守墓铁甲仅仅只是镇守在剑冢入口的人族先辈修士，如果没猜错的话当初本该镇压剑魔的人族修士肉身全部都被污浊了。",
            "听到这话你顿时大惊，也就是说他们要对付数千被魔气污浊的人族修士。",
            "这时前方又出现整齐的碰撞声音，顺着声音看过去正是一支精锐的银甲队伍。",
            "&击溃守墓银甲。",
        ],
        done: [
            "守墓银甲的实力远比铁甲强的多，一场大战后你们三人身上都受了不少的伤。",
            "你眉头微微一皱，再这样硬闯下去恐怕还没见到剑魔自己三人就先陨落了。",
            "当即看向拎壶冲询问：&难道没有什么密道直接到镇压剑魔的墓室？",
        ],
        reward: {
            exp: 750000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,1"
            },
        },
        complete: {
            freak: "20044-8"
        },
        nextId: 1047
    },
    1047: {
        title: "墓室暗格",
        tips: "拎壶冲竟然忘记了通往墓室的密道暗格，你也只能随便猜一个了。",
        type: TASK_TYPE.biaoxiang,
        receive: [
            "拎壶冲顿时一拍脑袋：我竟然忘记了，师尊生前确实和我说过有一条密道。",
            "说着拎壶冲就在通道旁边的墙壁上摸来摸去，找了了几个暗格随即又尴尬道：时间太久，我忘记那个暗格是机关了。",
            "狐晶丽当即看向你：你运气一向比较好，你来试试吧？",
            "你决定按下：",
        ],
        done: [
            "你凭直觉按下其中一个暗格，瞬间整个通道都开始震动起来，一条秘密通道出现在墙壁内。",
            "拎壶冲大喜：没错，就是这个密道。",
            "&进入密道",
        ],
        reward: {
            exp: 1000000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,1"
            },
        },
        action: {
            type: 1,
            text: '暗格',
            num: 6,
        },
        nextId: 1048
    },
    1048: {
        title: "吸血魔蝠",
        tips: "浓厚的魔气在葬剑冢(1,3)诞生了一群吸血魔蝠拦住了去路。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你们进入密道后还没走多久，突然就看到天空悬挂着一双双血色的眼睛。",
            "只见一只只诡异的蝙蝠倒挂在上方，拎壶冲脸色一变：小心，这是从魔气中诞生的吸血魔蝠。",
            "话音未落，无数吸血魔蝠就铺天盖地的朝你们冲了过来。",
            "&击杀吸血魔蝠",
        ],
        done: [
            "很快你们就发现这些吸血魔蝠根本杀不完，密道内魔气浓厚正在不断的诞生新的吸血魔蝠。",
            "这时密道内的魔气突然朝密道尽头涌去，无数吸血魔蝠失去了能量来源瞬间如下雨一般全部掉落在地上。",
            "密密麻麻的吸血魔蝠落下，你们只能隐隐看到尽头似乎有一道持剑的人影正在吸收剑冢内的魔气。",
            "&继续",
        ],
        reward: {
            exp: 1000000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,2"
            },
        },
        complete: {
            freak: "20045-8"
        },
        nextId: 1049
    },
    1049: {
        title: "镇墓剑侍",
        tips: "千年前封印剑魔的最强人族剑修竟然也被魔气污染了。",
        type: TASK_TYPE.zhandou,
        receive: [
            "拎壶冲顿时如临大敌：这是千年前镇压剑魔的最强剑修，号称镇墓剑侍！",
            "你：这难道是在吸收剑冢内的魔气？",
            "拎壶冲：没错，镇墓剑侍已经被污浊，这些魔气会让他变得更强。",
            "话音刚落剑冢内魔气已被镇墓剑侍全部吸收，恐怖的魔气缠绕在他周身，犹如魔神降临一剑斩了过来。",
            "&联手抵挡",
        ],
        done: [
            "噗！噗！噗！",
            "你们三人联手也是不敌镇墓剑侍，纷纷吐血，毫无疑问，你们败了。",
            "这时变故突起镇墓剑侍的身体骤然炸开化作三道凌厉的剑气射入你们体内。",
            "镇墓剑侍的声音传入你们脑海中：孩子们，我已被魔气污浊，希望这毕生修为凝聚的剑气可以帮助你们战胜剑魔。",
            "你们这才明白原来镇墓剑凭借着意志并未彻底被魔气污浊，在最后一刻吸收了整个剑冢的魔气，然后选择了自爆并将毕生修为所凝聚成三道剑气打入你们体内。",
            "陨落千年依旧不忘抵御魔族，你不由得心生敬佩：&晚辈定不负前辈所托。",
        ],
        reward: {
            exp: 1250000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,2"
            },
        },
        complete: {
            freak: "20046-8"
        },
        nextId: 1050
    },
    1050: {
        title: "魔修傀儡",
        tips: "千年前的魔族强者剑魔即将破开封印，召唤了一群魔修傀儡争取时间。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你们走出密道终于来到了墓室，正中央的上空被魔气环绕的剑魔被八道冰冷的锁链锁住。",
            "剑魔正在不断的轰击锁链，此时已经有六道锁链被轰断了。",
            "拎壶冲：不好，剑魔快突破封印了，必须马上阻止它。",
            "你们刚刚朝剑魔飞过去，一群强大的魔修傀儡便朝你们杀了过来。",
            "&击杀魔修傀儡",
        ],
        done: [
            "剑魔面露狰狞：该死的蝼蚁，竟然将我的傀儡杀完了。",
            "拎壶冲：今日你休想破封。",
            "&继续",
        ],
        reward: {
            exp: 1250000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,3"
            },
        },
        complete: {
            freak: "20047-8"
        },
        nextId: 1051
    },
    1051: {
        title: "剑魔分身",
        tips: "剑魔分化出数十道强大的分身围攻拎壶冲，赶紧去帮忙吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "魔修傀儡尽数解决后，拎壶冲二话不说直接朝剑魔杀过去。",
            "剑魔冷哼一声：蝼蚁，找死！",
            "只见剑魔周身的魔气疯狂涌动，竟然凝聚成无数道分身全部朝拎壶冲杀过去。",
            "&不好，危险！",
        ],
        done: [
            "剑魔分身强大无比，你们三人缠斗了许久方才将它们消灭。",
            "这时剑魔也争取到了最后的时间将最后一个铁锁轰断，瞬间无边魔气冲天而起。",
            "&继续",
        ],
        reward: {
            exp: 1500000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,3"
            },
        },
        complete: {
            freak: "20048-8"
        },
        nextId: 1052
    },
    1052: {
        title: "镇杀剑魔",
        tips: "传说中的剑魔竟然破开了封印，快去将它消灭避免世间大乱吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "剑魔浑身被魔气笼罩：桀桀桀，本座终于破封了。",
            "你们三人顿时脸色凝重，眼下只能趁剑魔实力未彻底恢复出手了。",
            "剑魔怪异一笑：纵然本座实力不及巅峰十一之二，杀尔等蝼蚁还是易如反掌。",
            "&镇杀剑魔！",
        ],
        done: [
            "你们三人联手竟然不到十招便被打的纷纷倒地，关键时刻你们催动全部法力祭出镇墓剑侍存在体内的剑气。",
            "刹那间剑气漫天，剑魔发出不甘的嘶吼：不，不可能！",
            "突然剑魔癫狂的嘶吼一声朝你冲了过来：哈哈哈，给本座陪葬吧！",
            "而此时你体内的法力完全枯竭完全不可能避开，只能眼睁睁的看着剑魔临死前的反扑：就这样结束了？",
            "这时一道淡淡的清香落入你鼻中，一道粉红色的身影挡在了你的面前。",
            "你双眼瞬间猩红：&狐晶丽！！！",
        ],
        reward: {
            exp: 3000000,
        },
        grand: {
            npc: {
                id: 110,
                address: "10004,0,3"
            },
            freak: [{
                id: 110,
                address: "10004,0,3"
            }]
        },
        nextId: 1053
    },
    1053: {
        title: "狐晶丽陨落？",
        tips: "拎壶冲似乎有办法救狐晶丽，快去葬剑冢(1,4)找他了解情况。",
        type: TASK_TYPE.duihau,
        receive: [
            "抱着浑身鲜血的狐晶丽，你不断的喊道：狐晶丽，你醒醒，你醒醒！！",
            "不过无论你怎么喊狐晶丽都没有丝毫反应，反而是变成一只九条尾巴的狐狸。",
            "拎壶冲当即一喜：这是九尾天狐一族，或许还有办法救她。",
            "&什么办法？",
        ],
        done: [
            "拎壶冲：传说九尾天狐一族族长修为通天彻地，拥有起死回生之能，只是千年以来这世间都没有出现过九尾天狐一族的消息。",
            "听到这话你眼中闪过一丝失落，突然想起了欧冶子或许会知道九尾天狐一族的消息。",
            "&回大泽谷",
        ],
        reward: {
            exp: 1500000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10004,0,3"
            },
        },
        nextId: 1054
    },
    1054: {
        title: "鬼医下落",
        tips: "传说中的鬼医可以救回狐晶丽，快去找欧冶子询问鬼医的下落吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "(你抱着狐晶丽一路火急火燎的赶回大泽谷将事情前因后果全部告诉了欧冶子，只是你没想到后者竟然也不知道九尾天狐的下落，就连当年刚刚出生的狐晶丽也是那位带领三族抵御魔族神秘强者抱来的。)",
            "欧冶子：虽然找不到九尾天狐的下落，不过传说中的鬼医可以救这小丫头。",
            "&那前辈知道鬼医在什么地方呢？",
        ],
        done: [
            "欧冶子摇了摇头：鬼医此人性格亦正亦邪，行踪不定，百年前我听说他去了妖族不夜城。",
            "&我这就去不夜城寻找鬼医。",
        ],
        reward: {
            exp: 1500000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        nextId: 1055
    },
    1055: {
        title: "前往不夜城",
        tips: "欧冶子拦住了拎壶冲与你同行，快去大泽谷(1,5)找他了解原因吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "你刚刚准备动身前往不夜城，和你一同回到大泽谷的拎壶冲却喊住了你。",
            "拎壶冲：传说不夜城是亡命徒的聚集之地，极其危险，我和你一起去也好有个照应。",
            "欧冶子：不可，冲儿你必须留下来和我一起破解羊皮卷。",
            "你与拎壶冲都是一愣，难道破解羊皮卷比救狐晶丽还重要？",
            "&继续",
        ],
        done: [
            "欧冶子轻叹了一口气，又是一段千年前的隐秘。",
            "(千年前三族在那神秘强者的带领下虽然将魔族全部封印，但是也有留下一道预言，千年之后被封印的魔族会重新降临世间，葬剑冢内的剑魔破封便是预言的征兆，而寻找到羊皮卷上记载的馒头便是应对此次大劫的关键。)",
            "&独身前往不夜城。",
        ],
        reward: {
            exp: 1500000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,0,4"
            },
        },
        nextId: 1056
    },
    1056: {
        title: "荒漠中的小女孩",
        tips: "荒漠中有个小女孩似乎遇到了麻烦，过去帮助她并打听不夜城的位置吧。",
        type: TASK_TYPE.duihau,
        level: 50,
        receive: [
            "不夜城，传说是在一片无尽荒漠中的孤城，因为极难寻找到位置所以成了无数亡命徒的聚集之地。",
            "你顶着风沙在大漠中走了数日都没找到不夜城，这时不远处似乎有个带着红帽子的小女孩遇到了一点麻烦。",
            "&上前打听不夜城的位置",
        ],
        done: [
            "只见小女孩面前躺着一头骆驼，不过这头骆驼似乎是中毒了奄奄一息。",
            "小红：大哥哥，你能帮我救救骆驼？",
            "&当然可以。",
        ],
        reward: {
            exp: 3000000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,0"
            },
        },
        nextId: 1057
    },
    1057: {
        title: "紫藤萝花",
        tips: "荒漠毒蝎就在不夜城(1,1)，击杀后有一定的概率掉落紫藤萝花。",
        type: TASK_TYPE.shouji,
        receive: [
            "小红：我的骆驼被毒蛇咬了，大哥哥你能去附近帮我找来几朵紫藤萝花？",
            "你点了点头答应下来，随即开始在附近找起紫藤萝花，不久便发现一株紫色的花在黄沙中格外显眼。",
            "你刚要上前采摘就发现黄沙下似乎有什么东西想要袭击你。",
            "&继续",
        ],
        done: [
            "吃下紫藤罗花后，躺在地上奄奄一息的骆驼很快就站了起来。",
            "小红：哈哈，我的骆驼终于好了，谢谢你大哥哥。",
            "&你知道不夜城的位置？",
        ],
        reward: {
            exp: 3250000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,0"
            },
        },
        complete: {
            article: "216-6"
        },
        nextId: 1058
    },
    1058: {
        title: "驱赶毒蛇",
        tips: "荒漠毒蛇就在不夜城(1,1)，快去将它们驱赶走吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "小红：大哥哥，你要去不夜城？",
            "你点了点头正要开口回答，突然周围的黄沙中传来一阵唦唦的动静，只见一群毒蛇悄悄的朝你们靠近。",
            "小红顿时大怒：又是这群臭蛇，大哥哥你能帮我教训他们？",
            "&驱赶毒蛇",
        ],
        done: [
            "(收拾完荒漠毒蛇后小红告诉你，原来她从小就生活在不夜城，因为觉得无聊才偷偷跑出来的，听到你要去不夜城后便决定亲自带你去。)",
            "&继续",
        ],
        reward: {
            exp: 3500000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,0"
            },
        },
        complete: {
            freak: "20222-10"
        },
        nextId: 1059
    },
    1059: {
        title: "小红的身份",
        tips: "小红竟然是传说中的鬼医的孙女，快去找她了解鬼医的事情吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "小红：大哥哥，你去不夜城做什么？",
            "你：去找一个叫鬼医的妖族前辈，你在不夜城有听说过吗？",
            "小红一愣：啊，你是来找我爷爷的吗！",
            "你：&鬼医是你爷爷！",
        ],
        done: [
            "小红点了点头：嗯嗯，大哥哥你找我爷爷干嘛，我看你也没得病啊？",
            "见此你不由的露出喜色：我有个妖族的朋友受了重伤，我是来找鬼医前辈救她的。",
            "小红恍然大悟：原来如此，不过爷爷的脾气古怪可不一定会出手救人。",
            "&无论鬼医前辈愿不愿意出手，我都要去试一试。",
        ],
        reward: {
            exp: 3750000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,0"
            },
        },
        nextId: 1060
    },
    1060: {
        title: "清水解渴",
        tips: "小型仙人掌就在不夜城(1,2)，击杀后有一定的概率掉落清水。",
        type: TASK_TYPE.shouji,
        receive: [
            "荒漠之中，烈日炎炎，此时小红已经是渴的眼冒金星了，突然前面出现一群七八丈高的仙人掌。",
            "小红当即大喜的跑过去：哇，终于有水喝了。",
            "然而小红刚刚靠近那些仙人掌，瞬间无数道仙人掌刺就朝她飞了过去。",
            "你：&小心，仙人掌成精了。",
        ],
        done: [
            "小红熟练的从仙人掌身上采集道满满的一水袋的清水，然后拎起水袋二话不说一口灌了下去。",
            "喝完才将水袋递给了你：大哥哥，你也来喝几口吧。",
            "&接过水袋。",
        ],
        reward: {
            exp: 4000000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,1"
            },
        },
        complete: {
            article: "217-6"
        },
        nextId: 1061
    },
    1061: {
        title: "打了小的，来了老的？",
        tips: "小仙人掌妖就在不夜城(1,2)，击杀后有一定的概率掉落清水。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你接过水袋浅浅的喝了一口，瞬间一股清凉涌遍全身，果然是甘甜解渴。",
            "突然这时黄沙四起，整个天空仿佛都被什么遮盖了一般，只见一棵数十丈高的巨型仙人掌正朝你与小红杀过来。",
            "&我去，打了小的，老的来报仇了。",
        ],
        done: [
            "你与巨型仙人掌大战了数百回合不分上下，剧烈的战斗引来了更多的巨型仙人掌。",
            "见此你也不再过多的纠缠连忙拉着小红仓促开溜。",
            "&不夜城",
        ],
        reward: {
            exp: 4300000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,1"
            },
        },
        complete: {
            freak: "20224-10"
        },
        nextId: 1062
    },
    1062: {
        title: "惩戒地痞",
        tips: "地痞就在不夜城(1,3)，快去教训他们一顿吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "终于你与小红来到了不夜城，而这里也不愧是亡命徒的天堂。",
            "你们刚刚到城外就有一群不长眼的地痞直接围过来要收你们的入城保护费。",
            "你眉头一皱：&滚！",
        ],
        done: [
            "这群地痞在你手中没过几招就被打的跪地求饶，你稍作惩戒便放他们离开了。",
            "不过你没想到这群地痞跑远了后竟然开始放狠话让你有种就在这等着，他们去城里摇人。",
            "小红也是看热闹不事大：行，本姑奶奶就在这等着。",
            "你见此也无奈的摇了摇头，这小红姑娘不愧是不夜城长大的。",
            "&原地地痞摇人。",
        ],
        reward: {
            exp: 4500000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,2"
            },
        },
        complete: {
            freak: "20225-10"
        },
        nextId: 1063
    },
    1063: {
        title: "惩戒流氓",
        tips: "流氓就在不夜城(1,3)，快去教训他们一顿吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "不多时一群流氓混混就提着刀枪棍棒从城里朝冲了出来，不过看到你身边的小红后瞬间傻眼了。",
            "流氓瞬间如见了鬼一般惊呼道：小...小红姑娘！！！",
            "你见此微微一愣看来这小红姑娘在不夜城的威望还不小，不过既然这群流氓都来了你也不打算就这样放了他们。",
        ],
        done: [
            "毫无疑问，这群地痞流氓被你揍得直接又跪地求饶。",
            "小红嘻嘻一笑：你们这群流氓地痞，胆子挺大了，竟然敢收本姑娘的保护费。",
            "流氓连忙磕头：姑奶奶，饶命啊，瞎了我们狗眼了。",
            "你狠狠的惩戒这群地痞流氓后，小红也没有继续玩下去带着你就进城了。",
            "&鬼医居所",
        ],
        reward: {
            exp: 4800000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,2"
            },
        },
        complete: {
            freak: "20226-10"
        },
        nextId: 1064
    },
    1064: {
        title: "初见鬼医",
        tips: "鬼医就在不夜城(1,5)，快请他出手搭救狐晶丽吧。",
        type: TASK_TYPE.duihau,
        replace: true,
        receive: [
            "小红带着你来到城内一处偏僻的宅院，只见院落中一个身着黑袍的老者正在焦急的来回走动，这老者正是传说中的鬼医。",
            "见到小红后老者这才松了一个口气怒道：你这丫头又偷偷跑到什么地方去野了。",
            "小红嘻嘻一笑上前拉着老者的衣角撒娇道：爷爷，我这不是没事嘛。",
            "面对孙女撒娇鬼医怒气顿时消散无形，这才无奈的点了点头，这时也终于是注意到了你的存在眼中闪过一丝疑惑。",
            "你当即上前：&晚辈{name}，见过鬼医前辈。",
        ],
        done: [
            "小红这才又连忙道：爷爷，大哥哥的朋友受了重伤，你帮帮他吧。",
            "你也不迟疑手直接一挥，便见一具散发着寒气的冰棺出现在院子中。",
            "冰棺内躺着的正是狐晶丽的本体，而冰棺自然则是欧冶子为了保护狐晶丽肉身特意打造的。",
            "你：&还请鬼医前辈出手相救。",
        ],
        reward: {
            exp: 5000000,
        },
        grand: {
            npc: {
                id: 106,
                address: "20002,0,4"
            },
        },
        nextId: 1065
    },
    1065: {
        title: "鬼医的考验",
        tips: "鬼医就在不夜城(1,5)，他似乎需要你帮他做什么才肯出手救狐晶丽。",
        type: TASK_TYPE.duihau,
        receive: [
            "鬼医看了眼狐晶丽有些意外：没想到这世间还有九尾天狐一族，不过老夫为什么要帮你呢？",
            "小红见状连忙撒娇道：爷爷，你帮帮大哥哥吧，要不是大哥哥的话我可能就在荒漠中回不来了。",
            "你则是明白鬼医的意思，当即开口问道：&不知前辈有何吩咐？",
        ],
        done: [
            "鬼医点了点头：你小子还算上道，老夫最近在炼制一种丹药还差两种药材。",
            "你微微一笑：&不知是那两种药材？",
        ],
        reward: {
            exp: 5500000,
        },
        grand: {
            npc: {
                id: 1010,
                address: "20002,0,4"
            },
        },
        nextId: 1066
    },
    1066: {
        title: "幻灵青涎",
        tips: "幻青蛇在不夜城(1,4)，击杀后有概率掉落幻灵青涎。",
        type: TASK_TYPE.shouji,
        receive: [
            "鬼医轻轻一笑：第一种药材名为幻灵青涎，此物就生长在不夜城西边的大荒之中。",
            "小红：大哥哥，那里有很多凶兽，你可千万要小心。",
            "你点了点头，随即便直接将前往不夜城西边。",
            "&采集幻灵青涎",
        ],
        done: [
            "看着你采集回来的幻灵青涎，鬼医满意的点了点头：不错，品质都是上品。",
            "&不知道前辈所需第二味药材是何物？",
        ],
        reward: {
            exp: 6000000,
        },
        grand: {
            npc: {
                id: 1010,
                address: "20002,0,4"
            },
        },
        complete: {
            article: "218-6"
        },
        nextId: 1067
    },
    1067: {
        title: "大地之石",
        tips: "食金兽在不夜城(1,4)，击杀后有概率掉落大地之石。",
        type: TASK_TYPE.shouji,
        receive: [
            "鬼医：第二种药材名为大地之石，此物诞生在极为的大地深处，极为难寻，不过荒漠中的食金兽却极其擅长寻找此物。",
            "&晚辈这就去寻来。",
        ],
        done: [
            "鬼医：没想到你小子运气还真不错，竟然真的找到了大地之石。",
            "你轻轻一笑：&如此，前辈是否可以出手了呢？",
        ],
        reward: {
            exp: 7500000,
        },
        grand: {
            npc: {
                id: 1010,
                address: "20002,0,4"
            },
        },
        complete: {
            article: "219-6"
        },
        nextId: 1068
    },
    1068: {
        title: "寻找妖灵",
        tips: "鬼医就在不夜城(1,5)，快去找他询问如何找到狐晶丽的妖灵吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "鬼医摇了摇头：你的朋友妖灵溃散，除非你能找回她的妖灵，否则谁也救不了她。",
            "你：&如何才能找回妖灵呢？",
        ],
        done: [
            "鬼医：迷雾森林中有一个叫赶尸人的家伙，传说此人行走阴阳两界，极善灵魂一道。",
            "你：前辈的意思是此人能帮我找的狐晶丽的妖灵。",
            "鬼医点了点头：没错，不过这迷雾森林中危险重重活人进去九死一生。",
            "听到这话你只是微微一笑，无论这迷雾森林中如何的危险，你也必须走上一遭。",
            "&迷雾森林",
        ],
        reward: {
            exp: 10000000,
        },
        grand: {
            npc: {
                id: 1010,
                address: "20002,0,4"
            },
        },
        nextId: 1069
    },
    1069: {
        title: "迷雾森林",
        tips: "调皮的纸人男童就在迷雾森林(1,1)，快去教训它一下吧。",
        type: TASK_TYPE.zhandou,
        level: 60,
        receive: [
            "你来到迷雾森林的入口，还没有进去你就发现了一些不寻常的地方。",
            "森林内被一层层诡异的红雾笼罩，阴风阵阵，时不时还会传出诡异空灵的声音。",
            "你微微一愣心想这地方不会这有不干净的东西吧？",
            "突然你感觉背后似乎有什么东西无声无息的朝你靠近，你连忙运转法力回身打过去。",
            "&继续",
        ],
        done: [
            "纸人男童：呜呜呜。",
            "你一愣实在没想到偷袭你的竟然是个纸人，而且被你一掌打的直接坐在地上哭了起来。",
            "&纸人活了？",
        ],
        reward: {
            exp: 10000000,
        },
        grand: {
            npc: {
                id: 20231,
                address: "20003,0,0"
            },
        },
        complete: {
            freak: "20231-12"
        },
        nextId: 1070
    },
    1070: {
        title: "纸人女童",
        tips: "调纸人女童在迷雾森林(1,1)，她似乎以为你欺负了纸人男童。",
        type: TASK_TYPE.zhandou,
        receive: [
            "见到纸人男童哭个不停，你都有些不好意思了，感觉自己像是在欺负小孩。",
            "这时突然冒出一个纸人女童：坏蛋，你敢欺负我弟弟。",
            "你：&听我解释，事情不是这样的。",
        ],
        done: [
            "眼见纸人女童根本不理会你的解释也只能无奈的将她先制住说明了事情经过缘由。",
            "纸人女童一愣有些歉意道：对不起，我弟弟他就是调皮喜欢吓人并没有要伤害你的意思，这样我带你去找赶尸人作为赔礼吧。",
            "你大喜：&那就多谢姑娘了。",
        ],
        reward: {
            exp: 10000000,
        },
        grand: {
            npc: {
                id: 20232,
                address: "20003,0,0"
            },
        },
        complete: {
            freak: "20232-12"
        },
        nextId: 1071
    },
    1071: {
        title: "哭瞎了眼？",
        tips: "红木古树就在迷雾森林(1,2)，击杀后有概率掉落朱砂。",
        type: TASK_TYPE.shouji,
        receive: [
            "你们正准备动身突然地面上的纸人男童惊呼起来：姐姐，我好像又看不见了？",
            "纸人女童当即的朝纸人男童的眼部看过去，只见原本点缀成眼睛的朱砂竟然都被哭花了。",
            "对此纸人女童有些不好意思的看向你：能请你帮我去红木古树身上收集点朱砂？",
            "你点了点头：&行，没问题。",
        ],
        done: [
            "纸人女童将朱砂熟练的点在只纸人男童的眼部位置，嘴里随即又念起一道法决。",
            "片刻后纸人男童便开心道：咦，我又可以看见了。",
            "你：&还真是奇妙。",
        ],
        reward: {
            exp: 12000000,
        },
        grand: {
            npc: {
                id: 20232,
                address: "20003,0,0"
            },
        },
        complete: {
            article: "2110-6"
        },
        nextId: 1072
    },
    1072: {
        title: "修补身体",
        tips: "红木古树就在迷雾森林(1,2)，击杀后有概率掉落朱砂。",
        type: TASK_TYPE.shouji,
        receive: [
            "这时纸人男童又突然抱着肚子叫了起来：姐姐，我肚子疼。",
            "你朝他肚子看过去，只见那里有一个手掌形状的大洞，正是你之前不小心一掌拍得。",
            "你尴尬一笑：这个有办法修补？",
            "纸人女童迟疑了一下：金丝古树的树皮倒是可以修复，不过它实力太强了。",
            "你摆了摆手：&无妨，我去去就来。",
        ],
        done: [
            "纸人男童身上的问题终于是解决了，当即就在原地开心的蹦蹦跳跳起来。",
            "不过却被纸人女童训斥了一顿以后不许去调皮的吓唬别人，瞬间就向霜打了的茄子一样。",
            "&继续",
        ],
        reward: {
            exp: 12000000,
        },
        grand: {
            npc: {
                id: 20232,
                address: "20003,0,0"
            },
        },
        complete: {
            article: "2111-6"
        },
        nextId: 1073
    },
    1073: {
        title: "中计？",
        tips: "幻境游魂在迷雾森林(1,3)朝你发起攻击，快去将它们消灭吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "走着走着突然那对纸人姐弟竟然在你面前没有丝毫征兆的凭空消失了。",
            "瞬间你意识到情况似乎有些不太对，这时才发现眼前竟然是一片乱葬岗到处都是游魂。",
            "它们似乎也发现了你这个活人，当即就朝你冲了过来。",
            "你：&不好，中计了！",
        ],
        done: [
            "杀了半天你发现这些游魂无穷无尽根本就杀不完，而且它们被杀后竟然会散发出一种熟悉的灰雾。",
            "你一脸震惊：&这是魔族？",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1011,
                address: "20003,0,2"
            },
        },
        complete: {
            freak: "20235-12"
        },
        nextId: 1074
    },
    1074: {
        title: "入魔？",
        tips: "幻境行尸在迷雾森林(1,3)朝你发起攻击，快去将它们消灭吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "无比的震惊中地面有爬出一具具行尸与映月崖中所见一模一样，葬剑冢内的一切此刻全部涌入心头。",
            "对于这些该死的魔物你恨之入骨，心中只有一个念头将它们杀光。",
            "瞬间你彷如入魔，声音癫狂：杀！杀！杀！",
        ],
        done: [
            "随着你不断击杀这些行尸吸收越多的灰雾，心中的杀意越发癫狂，疯狂的催动法力屠戮眼前的魔物。",
            "你也不知道自己杀了多久，突然周围的魔物全部消失，一个白衣青年就在远处静静的看着你。",
            "白衣青年眼中带着一缕淡淡的笑意，身上倒是没有半点魔族的气息。",
            "你压下心中的杀意看着他问道：&你是？",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1011,
                address: "20003,0,2"
            },
        },
        complete: {
            freak: "20236-12"
        },
        nextId: 1075
    },
    1075: {
        title: "赶尸人",
        tips: "白衣青年突然在迷雾森林(1,4)，快去找他聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "赶尸人：嗯，小家伙不错，竟然还能保留心智。",
            "说罢手他便一挥，刚刚还是一片杀机的森林内竟然出现一座小木屋，之前的纸人姐弟就站在那里朝你招手。",
            "你瞬间猜到了白衣青年的身份：&晚辈见过赶尸人前辈。",
        ],
        done: [
            "只是你话音刚落就见赶尸人有些不约的皱起眉头，随即一股恐怖的杀气朝你压过来。",
            "在这里恐怖的杀气下你发现自己的法力竟然都被无法运转，如此可怕的对手你还是第一次遇到。",
            "下一秒赶尸人便一脸杀意的瞬移到你面前，语气冰冷的道：小子，我看起来很老？",
            "你当即就一愣，立刻就决定这脸不要也罢直接开夸：",
            "&大哥风华绝代，举世无双，天上的星辰与你比也是黯然失色，谁敢说大哥老，小弟保证打死他。",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20003,0,3"
            },
        },
        nextId: 1076
    },
    1076: {
        title: "收集黄砂砾",
        tips: "百年白蚁就在迷雾森林(1,4)，击杀后有概率掉落黄砂砾。",
        type: TASK_TYPE.shouji,
        receive: [
            "赶尸人这才点了点头，散去了一身杀气：嗯，你倒是喜欢说实话，以后就叫我秦大哥吧。",
            "你也干脆的开口：秦大哥，我....",
            "不过赶尸人立马就打断了你的话：制作召灵符需要用到黄砂砾。",
            "你连忙点头：&好的。",
        ],
        done: [
            "赶尸人看着你获得的黄砂砾，英俊的眉头逐渐皱了起来。",
            "你心中一惊：秦大哥，这东西有问题？",
            "赶尸人摇了摇头：路上你看到过一群猴子？",
            "你愣了愣收集黄砂砾的路上确实看到过：&不过这两者有什么关系？",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20003,0,3"
            },
        },
        complete: {
            article: "2112-6"
        },
        nextId: 1077
    },
    1077: {
        title: "教训百年猴精",
        tips: "百年猴精在迷雾森林(1,4)，快去教训它们一顿吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "赶尸人认真的点了点头：没关系，纯粹就是那群猴子太吵了，你去把他们赶走吧。",
            "你不由得嘴角一抽：&......",
        ],
        done: [
            "赶尸人：被这群猴子烦了几个月，这下终于清净了。",
            "你：秦大哥，你修为这么高，为什么不出手赶走它们呢？",
            "赶尸人淡淡一笑：以我的身份和一群猴子打架，岂不是很没格局。",
            "听到这话你尴尬一笑，本以为这赶尸人是个世外高人，不过这短暂的相处下来还真实一言难尽。",
            "&继续",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20003,0,3"
            },
        },
        complete: {
            freak: "20238-12"
        },
        nextId: 1078
    },
    1078: {
        title: "召灵失败",
        tips: "你使用召灵符竟然失败了，快去找赶尸人了解情况吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "片刻后赶尸人便行云流水的画出一张召灵符递给你：心中默念你想找回的人就行。",
            "你接过黄符默认着狐晶丽的名字，便见黄符开始燃烧起来，然而烧到一半竟然直接熄灭了。",
            "你一脸不知所措：&秦大哥，这是什么情况？",
        ],
        done: [
            "赶尸人看着你手中的召灵符片刻才开口道：你朋友的妖灵被人用阵法困住了。",
            "你一惊：什么，那秦大哥知道是谁干的吗？",
            "赶尸人眉头轻轻一皱，随即走屋外走去：虽然有点麻烦，不过这大哥也不能让你白喊，我带你去把人要回来。",
            "&前往盘丝洞",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20003,0,3"
            },
        },
        nextId: 1079
    },
    1079: {
        title: "抓个舌头",
        tips: "虎妖就在盘丝洞(1,1)，快去抓几只询问狐晶丽的下落吧。",
        type: TASK_TYPE.zhandou,
        level: 70,
        receive: [
            "你们来到一处极为偏僻的乱石窟，突然赶尸人前进的步伐停了下来。",
            "你：秦大哥，怎么了？",
            "赶尸人：看到那边的虎妖吗，我从它们身上感受到了你朋友的气息。",
            "&我这就去把他们抓来问问。",
        ],
        done: [
            "虎妖：哎哟，别打了。",
            "你：你们是不是抓了一个狐族少女的妖灵？",
            "虎妖：是老大让我们抓的。",
            "&你们老大是谁？",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,0"
            },
        },
        complete: {
            freak: "20211-15"
        },
        nextId: 1080
    },
    1080: {
        title: "虎妖同伙",
        tips: "狼妖就在盘丝洞(1,1)，立刻追上去把它们抓起来吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "这时突然一道黑影极快的掠过竟然将虎妖给救走了。",
            "你这才发现原来是一群狼妖，不过还没问清楚狐晶丽的下落可不能让它们跑了。",
            "&抓回狼妖。",
        ],
        done: [
            "狼妖：哎哟，哎哟。",
            "数息之间，你便追上了狼妖一脚将其踹到在地。",
            "&继续盘问。",
        ],
        reward: {
            exp: 15000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,0"
            },
        },
        complete: {
            freak: "20212-15"
        },
        nextId: 1081
    },
    1081: {
        title: "盘丝大仙",
        tips: "赶尸人就在盘丝洞(1,1)，他似乎认识盘丝大仙。",
        type: TASK_TYPE.zhandou,
        receive: [
            "经过盘问，你们才知道这虎妖与狼妖嘴里的老大乃是方圆千里最强的妖王，尊号：盘丝大仙。",
            "赶尸人：什么盘丝大仙，不过是只修行千年的蜘蛛精罢了。",
            "你：&秦大哥，你认识那盘丝大仙？",
        ],
        done: [
            "赶尸人：嗯，以前打过交道，这蜘蛛精也懂一些御灵之术倒是有些难缠。",
            "你：&那现在怎么办？",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,0"
            },
        },
        nextId: 1082
    },
    1082: {
        title: "乱石阵",
        tips: "你们在盘丝洞(1,2)被乱石阵困住了，赶紧走出去吧。",
        type: TASK_TYPE.migong,
        receive: [
            "很快你们决定让虎妖带着你们去找盘丝大仙讨要狐晶丽的妖灵。",
            "只是走到一处到处是乱石的地方时虎妖突然朝一块巨滚了过去，然后周围的巨石就开始动了起来。",
            "赶尸人：这是乱石阵，我们必须赶紧走出去。",
        ],
        done: [
            "赶尸人：终于走出来了，看来我们的行踪暴露了。",
            "&那我们要更快行动了。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,1"
            },
        },
        action: {
            type: 2,
            text: ['东', '南', '西', '北'],
            num: 2
        },
        nextId: 1083
    },
    1083: {
        title: "清理巨石兽",
        tips: "巨石兽就在盘丝洞(1,2)，赶路前先将它们处理了吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "赶尸人摇了摇头，目光四处扫过：不着急，我们必须先将这里的巨石兽给清理了。",
            "你顺着赶尸人的目光看过去，只见这些乱石中有些石头竟然会自己动。",
            "&清理巨石兽",
        ],
        done: [
            "赶尸人：这下那小蜘蛛没办法驱使巨石布阵了。",
            "&继续。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,1"
            },
        },
        complete: {
            freak: "20213-15"
        },
        nextId: 1084
    },
    1084: {
        title: "食人树妖",
        tips: "食人树妖就在盘丝洞(1,2)，快去救出被它们吞进去的赶尸人吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "赶尸人：啊！！！",
            "然而你们还没走几步，突然周围的树木竟然也活了过来无数藤蔓化作倾盆大口将赶尸人吞了进去。",
            "&驱赶树妖",
        ],
        done: [
            "赶尸人狼狈的从树妖嘴里爬出来：我去，一不小心差点阴沟里翻船了。",
            "不过经过这一波三折，你们总算是找到了的盘丝大仙洞府。",
            "&进入洞府。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,1"
            },
        },
        complete: {
            freak: "20214-15"
        },
        nextId: 1085
    },
    1085: {
        title: "偷溜进府",
        tips: "黑熊精就在盘丝洞(1,3)，快去将它们打晕溜进盘丝大仙洞府吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "黑熊精：什么人，竟然敢擅闯大仙洞府。",
            "不过你们刚刚准备溜进去就被一群高大威猛的黑熊精给发现了。",
            "你决定：&直接打晕它们。",
        ],
        done: [
            "你：呼，终于解决了。",
            "这群看门的黑熊精修为不低你将它们全部放倒也花了不少力气。",
            "&继续。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,2"
            },
        },
        complete: {
            freak: "20215-15"
        },
        nextId: 1086
    },
    1086: {
        title: "白骨蜘蛛",
        tips: "白骨蜘蛛就在盘丝洞(1,3)，快去将它们也全部击败吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "或许是你们战斗的动静有些大，洞府内又爬出无数犹如白骨般的蜘蛛。",
            "白骨蜘蛛：什么人，竟然敢大伤黑熊精。",
            "你无奈一笑：&看来还要继续打。",
        ],
        done: [
            "你正与白骨蜘蛛战成一团，突然一个极为缥缈出尘的白衣女子杀了出来。",
            "这时一路摸鱼的赶尸人终于选择了出手，一掌迎上，两人交锋的力量瞬间让大地都颤抖起来。",
            "盘丝大仙：哼，没想到你还敢来我盘丝洞。",
            "你：&秦大哥，你们有仇？",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1012,
                address: "20000,0,2"
            },
        },
        complete: {
            freak: "20216-15"
        },
        nextId: 1087
    },
    1087: {
        title: "盘丝大仙现身",
        tips: "盘丝大仙就在盘丝洞(1,3)，快去找她要回狐晶丽的妖灵吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "(经过了解你才知道原来数百年前赶尸人为了修炼一门独门法术已经来过一次盘丝洞偷妖灵，最后被盘丝大仙发现了踪迹大战一场扬长而去。)",
            "赶尸人：小蜘蛛，我们是来找你要一个妖灵。",
            "盘丝大仙冷笑一声：你们是要找那九尾天狐的妖灵吧？",
            "你：&没错，前辈可否将晚辈朋友的妖灵归还。",
        ],
        done: [
            "盘丝大仙冷笑一声：那九尾天狐的妖灵确实在我手中，不过我凭什么给你？",
            "你眉头轻轻一皱：&不知前辈如何才能归还？",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1013,
                address: "20000,0,2"
            },

        },
        nextId: 1088
    },
    1088: {
        title: "证明实力",
        tips: "黑蛇精就在盘丝洞(1,4)，快去击杀它们证明自身实力吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "东边有一群黑蛇妖，用它们证明你的实力。",
            "说完盘丝大仙直接就转身回洞府，而赶尸人竟然也脸皮极厚的跟了进去。",
            "&击杀黑蛇精。",
        ],
        done: [
            "赶尸人：小蜘蛛，没想到这数百年不见你修为又涨了不少嘛。",
            "你回到盘丝洞府后就见赶尸人悠哉悠哉的躺在一个石床上和盘丝大仙说话，而后者则是冷着一个脸完全不理会却也没排斥的意思。",
            "见此你微微一愣，看来这两人的关系并不是简单的仇敌，很有可能是因爱生恨。",
            "盘丝大仙见你回来了：跟我来吧，帮我杀了那千年巨蟒我就将妖灵给你。",
            "&跟上去。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1013,
                address: "20000,0,2"
            },
        },
        complete: {
            freak: "20217-15"
        },
        nextId: 1089
    },
    1089: {
        title: "击杀护洞蛇妖",
        tips: "护洞蛇妖就在盘丝洞(1,4)，快去将它们全部击杀吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "很快你跟随盘丝大仙来到一处洞口，不过这里却有一群人首蛇身的妖精守着。",
            "盘丝大仙也没有也隐藏身形的意思直接大摇大摆走了过去。",
            "护洞蛇妖：有敌袭，杀了它们。",
            "&击杀护洞蛇妖。",
        ],
        done: [
            "你刚将护洞蛇妖击杀，洞内一只巨大的蟒蛇便爬了出来，同样是人首蛇身。",
            "&继续。",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 1013,
                address: "20000,0,3"
            },
        },
        complete: {
            freak: "20218-15"
        },
        nextId: 1090
    },
    1090: {
        title: "千年巨蟒妖",
        tips: "邪恶的千年巨蟒妖就在盘丝洞(1,4)，快去与盘丝大仙联手将它击杀吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "千年巨蟒妖：蜘蛛精，本座还没去找你，你竟然敢找上门来。",
            "盘丝大仙：哼，你杀我无数族人，今日便是你的死期。",
            "&击杀千年巨蟒妖。",
        ],
        done: [
            "你与盘丝大仙联手终于将千年巨蟒妖斩杀，随即一个光团递了过来，光团中正是狐晶丽极为虚弱的妖灵。",
            "盘丝大仙：我发现她的妖灵时已经虚弱无比，若非用秘法保护此时已经消失于天地间了。",
            "你：多谢前辈了。",
            "&回鬼医居所",
        ],
        reward: {
            exp: 20000000,
        },
        grand: {
            npc: {
                id: 111,
                address: "20000,0,3"
            },
            freak: [{
                id: 111,
                address: "20000,0,3"
            }]
        },
        nextId: 1091
    },
    1091: {
        title: "狐晶丽苏醒？",
        tips: "狐晶丽似乎已经醒过来了，快去不夜城(1,5)看看她的情况吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "你找回狐晶丽的妖灵就马不停蹄的回到了不夜城，至于赶尸人则是留在了盘丝洞。",
            "随着妖灵成功归体鬼医将一枚丹药放入狐晶丽的嘴中，不过片刻她便缓缓睁开了眼睛。",
            "&狐晶丽？",
        ],
        done: [
            "只是你发现狐晶丽眼神无光，仿佛植物人一样没有丝毫反应。",
            "你：&鬼医前辈，这是怎么回事？",
        ],
        reward: {
            exp: 25000000,
        },
        grand: {
            npc: {
                id: 101,
                address: "20002,0,4"
            },
        },
        nextId: 1092
    },
    1092: {
        title: "前往妖魔岭",
        tips: "九尾天狐一族或许并没有灭族，快去找鬼医了解情况吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "鬼医见状眉头紧皱，片刻后才确定道：她的妖灵在外飘荡太久，已经无法与肉身彻底融合了。",
            "你：那有什么办法？",
            "鬼医沉吟了一下：除非服用融魂丹，不过此丹需要同族人的精血为药引，而九尾天狐一族...",
            "你听到这话内心也是不由一沉，因为欧冶子前辈说过九尾天狐一族早在抵御魔族的大战中灭族了。",
            "突然你想到了葬剑冢的情况眼前一亮：&前辈可知千年前九尾天狐一脉所在之地？",
        ],
        done: [
            "鬼医微微一愣：你想去九尾天狐一脉的遗迹寻找可能还未陨落的九尾天狐。",
            "你点了点头，因为你觉得九尾天狐一族不一定灭族了，或许与葬剑冢的守墓人一脉一样需要镇压魔族世代无法离开。",
            "鬼医：九尾天狐一脉当初是战场中心，也是魔气侵蚀最严重的地方，如今被称为妖魔岭。",
            "&前往妖魔岭",
        ],
        reward: {
            exp: 30000000,
        },
        grand: {
            npc: {
                id: 1010,
                address: "20002,0,4"
            },
        },
        nextId: 1093
    },
    1093: {
        title: "尸魔虫",
        tips: "尸魔虫就在妖魔岭(1,1)，快去将它们全部击败吧。",
        type: TASK_TYPE.zhandou,
        level: 80,
        receive: [
            "你刚刚来到妖魔岭就发现上空的魔气遮天蔽日，显然也是千年前大战遗留下的痕迹。",
            "你在映月崖见识过这些古战场的可怕，明白四处都是危险。",
            "果不其然，你刚刚踏入妖魔岭中没走多远地底就从四面方涌出一只只魔虫。",
            "&击退尸魔虫",
        ],
        done: [
            "对付这些被魔气侵蚀的魔物，经历过映月崖的你也有了一些经验并没有过多纠缠而是一边杀一边朝深处行动。",
            "&继续",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 20241,
                address: "20004,0,0"
            },
        },
        complete: {
            freak: "20241-18"
        },
        nextId: 1094
    },
    1094: {
        title: "尸魔鹰",
        tips: "尸魔鹰就在妖魔岭(1,1)，快去将它们全部击败吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "随着你不断深入被魔气侵蚀的妖兽也是越来越多。",
            "这时上空的灰雾中传来一声尖锐的鹰啼，你抬头一看正是一群尸魔鹰从上而下袭来。",
            "&击退尸魔鹰",
        ],
        done: [
            "你正应付这些飞行的魔物时，突然不知从何处飞来一掌拍向天空。",
            "只见无数的尸魔鹰如同下雨一般从天空落下，你这才发现远处有一个长着狐族耳朵的魁梧汉子。",
            "你顿时大喜跑过去：&前辈可是九尾天狐一族？",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 20242,
                address: "20004,0,0"
            },
        },
        complete: {
            freak: "20242-18"
        },
        nextId: 1095
    },
    1095: {
        title: "狐山",
        tips: "狐山就在妖魔岭(1,1)，快去找他询问九尾天狐一族的下落吧。",
        type: TASK_TYPE.duihau,
        replace: true,
        receive: [
            "狐山警惕看了你一眼：你是什么人，为何寻找九尾天狐一族。",
            "你：晚辈{name}。",
        ],
        done: [
            "于是你将狐晶丽的事情与自己的来意告知了狐山，而后者听到后极为震惊没想到世间竟然还有九尾天狐的族人。",
            "狐山：我虽狐族之人，但并非九尾天狐带你去找我们族长吧。",
            "&有劳前辈了。",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1014,
                address: "20004,0,0"
            },
        },
        nextId: 1096
    },
    1096: {
        title: "粉红毒蝎",
        tips: "粉红毒蝎就在妖魔岭(1,2)，快去将它们击败。",
        type: TASK_TYPE.zhandou,
        receive: [
            "跟随狐山一路走着走着你突然发现眼前出现一群娇滴滴的狐媚女子。",
            "你立马就察觉这群狐媚女子不对劲，毕竟这里可是古战场，果然下一秒她们就化成一群粉红毒蝎朝你袭来。",
            "你：&妖孽找死！",
        ],
        done: [
            "狐山：哟，还不错，竟然没有被美色迷失心智。",
            "你将粉红毒蝎驱赶后，狐山不知什么地方走了出来满意的点了点头。",
            "&继续",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1014,
                address: "20004,0,1"
            },
        },
        complete: {
            freak: "20243-18"
        },
        nextId: 1097
    },
    1097: {
        title: "红石骨魔",
        tips: "红石骨魔就在妖魔岭(1,2)，快去将它们击败。",
        type: TASK_TYPE.zhandou,
        receive: [
            "通过粉红毒蝎的美色考验后你继续跟着狐山前进，没走多久后者又停了下来。",
            "狐山：咦，这群骨魔又复苏了，你去把它们收拾了吧。",
            "&收拾骨魔",
        ],
        done: [
            "狐山：修为还不错，有资格进入中心地带了。",
            "随着不断深入这一刻你也明白了狐山什么要考验自己。",
            "因为周围的魔气越来越浓烈，修为与心性只要有一点不足恐怕会当场入魔。",
            "&继续",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1014,
                address: "20004,0,1"
            },
        },
        complete: {
            freak: "20244-18"
        },
        nextId: 1098
    },
    1098: {
        title: "狐族高手",
        tips: "狐族高手就在妖魔岭(1,3)，快去将它们击败。",
        type: TASK_TYPE.zhandou,
        receive: [
            "终于你与狐山来到了一处宫殿外，或许是有强大的阵法隔绝，这里魔族气息反倒是淡了不少。",
            "狐山交代你不要乱走后便进去找族长通报，突然你感觉自己被一道浓烈的杀机锁定。",
            "只见一道速度极快的鬼魅身影从宫殿内掠出直接朝你杀了过来。",
            "&抵御狐族高手",
        ],
        done: [
            "狐族高手：哼，你是什么人，竟然敢杀我九尾天狐的族人。",
            "你一愣：&这是不是有什么误会？",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1014,
                address: "20004,0,2"
            },
        },
        complete: {
            freak: "20245-18"
        },
        nextId: 1099
    },
    1099: {
        title: "狐族精英",
        tips: "狐族精英就在妖魔岭(1,3)，快去将它们击败。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐族高手：哼，还敢狡辩，等我族精英来了看你说不说。",
            "话音刚落一群狐族强者也是从大殿内飞出，丝毫不听你的解释直接杀了过来。",
            "见此你也是一脸无奈：&看来只能打一架了。",
        ],
        done: [
            "都给我住手，所有动手的人都是执法队领受刑罚。",
            "这时一道怒斥声从宫殿内传来出来，正是刚刚去大殿内通报族长的回来狐山。",
            "狐山有走到你面前：族长已经答应见你了。",
            "你一喜：&多谢前辈通报。",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 20245,
                address: "20004,0,2"
            },
            tNpc: {
                id: 1014,
                address: "20004,0,2"
            },
        },
        complete: {
            freak: "20246-18"
        },
        nextId: 10100
    },
    10100: {
        title: "狐晶丽母亲",
        tips: "没想到九尾天狐一族的族长竟然就是狐晶丽的母亲，快去与她了解更多吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "你跟着狐山进入宫殿的瞬间就感觉天旋地转，下一秒竟然出现子在一处竹林内。",
            "竹林内摆法着一张石桌，一个风华绝代的风韵女人便静静的坐着。",
            "狐族族长：小家伙，我女儿为何受伤的？",
            "你顿时一惊：&您是狐晶丽母亲！",
        ],
        done: [
            "(经过一番了解你才知道事情前因后果，原来当初镇压魔族之时狐晶丽才刚刚出生无法抵御魔气侵蚀，只能是将她托付给那位横空出世带领三族抵御魔族的神秘强者，只是那神秘强者不知道出于什原因又托付给了欧冶子。)",
            "接下来你询问了此处镇压的魔族强者情况想要出手相助，不过狐族族长却是笑着摇了摇头然后朝你一挥衣袖。",
            "&继续",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1015,
                address: "20004,0,3"
            },
        },
        nextId: 10101
    },
    10101: {
        title: "狐晶丽苏醒",
        tips: "三滴精血竟然自动飞进了狐晶丽的体内，快去看看她的情况吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "这时你才发现自己竟然已经回到鬼医居住的小院，三滴充沛着灵气的精血就漂浮在身前。",
            "院子内小红正拉着推着没有任何意识的狐晶丽晒着太阳，见你凭空出现一脸的惊喜：大哥哥，你终于回来了，你找到狐晶丽姐姐的族人了？",
            "你点了点头刚要开口那三滴精血便似乎受到感应一般飞向狐晶丽的体内。",
            "&查看狐晶丽情况",
        ],
        done: [
            "片刻后狐晶丽终于恢复了意识一脸迷茫的看着你：我没死？",
            "接下的一段时间你与狐晶丽都在鬼医居所养伤，直到你收到了拎壶冲的传讯。",
            "传讯的内容就是羊皮卷他们已经破解，知道了传说中的馒头的下落。",
            "&回大泽谷",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 1015,
                address: "20004,0,3"
            },
        },
        nextId: 10102
    },
    10102: {
        title: "馒头的下落",
        tips: "羊皮卷中的秘密已经被破解，快去找欧冶子聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "老头，我们回来了。",
            "你与狐晶丽一路赶回大泽谷，此时欧冶子与拎壶冲已经在谷内等着你们。",
            "见你与狐晶丽都平安归来两人都是面露惊喜，随即你们都简单的说了一下最近的经历才步入主题。",
            "你：&那传说中的馒头在什么地方？",
        ],
        done: [
            "这时拎壶冲将羊皮卷递了过来，羊皮卷上显示着一幅画，画中一个金光灿灿的馒头飞向了一座古老的大山。",
            "你看不出来这是什么地方，看向狐晶丽发现后者也是一脸疑惑。",
            "欧冶子：这是传说中的昆仑山，乃是世间所有修士诞生的根源之地。",
            "&修士根源之地，那为何我从未听过昆仑山？",
        ],
        reward: {
            exp: 50000000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        nextId: 10103
    },
    10103: {
        title: "昆仑山传说",
        tips: "传说中的昆仑山早已经消失只留下一缕昆仑土，快去找欧冶子打听昆仑土的下落吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "欧冶子：昆仑山早在数十万年前便已经神秘消失，天地间无人知晓其中原因，如今世间自然是少有修士知晓这上古神山。",
            "你：馒头岂不是永远也找不到了？",
            "欧冶子：这倒是也未必，传说昆仑山消失后还有一缕土遗留天地间被人所得，或许借助此土便可引起昆仑山的共鸣。",
            "&那是谁得到了昆仑土呢？",
        ],
        done: [
            "欧冶子：仙族族长，仙帝！",
            "你嘴角顿时一抽仙族族长那可是世间三大强者之一，从他手中拿到昆仑土这不是做梦嘛？",
            "见此欧冶子呵呵一笑：小家伙你身具大气运不妨去试试，这次的魔族大劫或许就要靠你解决。",
            "&那晚辈就去试试。",
        ],
        reward: {
            exp: 100000000,
        },
        grand: {
            npc: {
                id: 104,
                address: "10002,0,4"
            },
        },
        // nextId: 10104
    },
}


module.exports = {
    ...taskMap
}
