const { TASK_TYPE } = require('../enum');
module.exports = {
    100: {
        title: "序章",
        tips: "灰色古籍就在仙隐村(1,1)，翻开看看吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "我穿越了千年,在无尽的岁月长河中沉睡,最终忘却了一切,只为重回千年前……",
            "神秘声音：醒醒,快点醒醒!",
            "一道犹如风铃般的声音将你从沉睡中唤醒,你睁开眼发现面前是一卷灰色古籍。",
            "&翻开灰色古籍",
        ],
        done: [
            "古籍中记载了一段千年前的隐秘......",
            "千年前一位名为东坡先生的大能制作出四个馒头，分别献给了人，仙，妖三族族长。",
            "三族族长吃下馒头后实力暴涨，心中皆是衍生出称霸三族的念头。",
            "不过三族族长都吃过馒头，实力不相上下，于是都想将最后一个馒头占为己有，一场惊世大战因此爆发。",
            "神秘声音：&醒醒，快点醒醒！",
        ],
        reward: {
            exp: 200,
            article:'1630'
        },
        grand: {
            npc: {
                id: 1010,
                address: "10000,0,0"
            },
        },
        nextId: 102
    },
    102: {
        type: TASK_TYPE.zhandou,
        title: "天选者",
        tips: "巡逻山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        receive: [
            "你被少女不讲武德的推到一群彪形大汉面前，刚要开口解释巡逻山贼便面露凶意朝你聚了过来!",
            "巡逻山贼：什么人，兄弟们杀了他!",
            "你：&......",
        ],
        done: [
            "你艰难的打倒了几个巡逻山贼，打斗的动静就引来了更多山贼，你二话不说，拔腿就跑。",
            "胡晶丽气喘吁吁的追了上来：你不是天选者嘛，怎么这么弱？",
            "你：天选者是什么？",
            "这时身后密密麻麻的山贼已经追了过来，狐晶丽吓得脸色一白：算了，我们先回村子再说。",
            "&仙隐村",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        complete: {
            freak: "2000-2"
        },
        nextId: 103
    },
    103: {
        type: TASK_TYPE.biaoxiang,
        title: "全身武装",
        tips: "破旧宝箱就在仙隐村(1,1)，挑一个打开吧。",
        receive: [
            "终于你与狐晶丽成功甩开山贼回到了村子，这才开口问道：你刚刚说的天选者是什么？",
            "胡晶丽：我也不太清楚，好像是与数千年的那场三族大战有关。",
            "你微微一愣，莫非是那灰色古籍中记载为了三族族长为了争夺馒头而爆发的大战。",
            "正要开口询问狐晶丽不知道从什么地方拿出一堆破旧的箱子：放的时间有些久了，我也忘记那个箱子里面有装备，你随便挑一个吧。",
        ],
        done: [
            "你随便找了个宝箱打开，只见里面竟然有一套崭新的装备。",
            "狐晶丽&：不愧是天选者，这运气真不错。",
        ],
        action: {
            type: 1,
            text: '破旧宝箱'
        },
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 1010
    },
    1010: {
        type: TASK_TYPE.shouji,
        title: "收集蛇胆",
        tips: "斑斓蛇就在仙隐村(1,5)，快去收集蛇胆压制毒性。",
        receive: [
            "这时之前那群女子中走出来一人：这是断魂散。",
            "你：那姑娘可知道有什么办法可以解毒。",
            "小蝶：目前没有办法，不过这后山有中名为斑斓蛇的妖兽，它的蛇胆可以暂时压制毒性不蔓延。",
            "你：&我这就去取来。",
        ],
        done: [
            "你取到蛇胆回到黑风寨时狐晶丽已经昏过去了，气色惨白随时都可能见阎王的模样。",
            "小蝶接过蛇胆看了你一眼：你可以出去了。",
            "你：为什么？",
            "小蝶指了指狐晶丽伤口的部位，你这才反应过来，老脸一红连忙走了出去。",
            "&继续",
        ],
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            article: "200-2"
        },
        nextId: 1046
    },
    1046: {
        title: "误入阵法",
        tips: "你们一路来到大泽谷深处，没想到竟然不小心闯入了阵法。",
        receive: [
            "你们跟着逃走的驭蜂师很快就来到了大泽谷深处，只是进入这里你们立刻发现那人不见了踪影。",
            "拎壶冲：不好，我们好像闯进阵法了。",
            "你：那现在怎么办？",
            "拎壶冲：我对阵法也不精通，只能随便蒙一个方向了。",
        ],
        done: [
            "狐晶丽：嘻嘻，还真蒙对了。",
            "下一秒空气中就传来一道刺鼻的味道，只见前方出现一个巨大的祭台。",
            "祭台上一具干瘦的枯尸盘腿而坐，干尸盘中的地方则是连接着数百条千丈的血河勾勒出诡异的符文。",
            "你甚至清楚的看到血河中无数的残肢断臂，顿时头皮发麻：&这是被抓来的凡人！！！",
        ],
        action: {
            type: 2,
            text: ['东', '南', '西', '北'],
            mun: 4
        },
        reward: {
            exp: 200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,2"
            },
            tNpc: {
                id: 101,
                address: "10002,0,3"
            },
        },
        // nextId: 104
    },
}
