const { TASK_TYPE } = require('../enum');
const taskMap = {
    100: {
        title: "序章",
        tips: "灰色古籍就在仙隐村(1,1)，翻开看看吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "我穿越了千年,在无尽的岁月长河中沉睡,最终忘却了一切,只为重回千年前……",
            "神秘声音：醒醒,快点醒醒!",
            "一道犹如风铃般的声音将你从沉睡中唤醒,你睁开眼发现面前是一卷灰色古籍。",
            "&翻开灰色古籍",
        ],
        done: [
            "古籍中记载了一段千年前的隐秘......",
            "千年前一位名为东坡先生的大能制作出四个馒头，分别献给了人，仙，妖三族族长。",
            "三族族长吃下馒头后实力暴涨，心中皆是衍生出称霸三族的念头。",
            "不过三族族长都吃过馒头，实力不相上下，于是都想将最后一个馒头占为己有，一场惊世大战因此爆发。",
            "神秘声音：&醒醒，快点醒醒！",
        ],
        reward: {
            exp: 500,
            article: '100-30,101-30'
        },
        grand: {
            npc: {
                id: 1010,
                address: "10000,0,0"
            },
        },
        nextId: 101
    },
    101: {
        title: "初识狐晶丽",
        tips: "神秘少女就在仙隐村(1,1)，去和她聊聊。",
        type: TASK_TYPE.duihau,
        replace: true,
        receive: [
            "你再度睁开眼这才发现自己正躺在一棵古树下，身前则是一个看起来像是狐族的少女。",
            "少女见你醒后：你终于醒了，我们赶紧动身吧!",
            "你明明记得自己是被车撞了，此时应该是躺在医院才对，当即就是灵魂三问：&你是谁，这是什么地方，我们要去干什么？",
        ],
        done: [
            "少女：我叫狐晶丽，这里是仙隐村，现在要去剿灭黑风寨。",
            "你一句都没听懂，这时已经被少女拉到了村外，一群彪形大汉在此处来回巡逻。",
            "狐晶丽直接将你推了出去：&上吧，{name}!",
        ],
        reward: {
            exp: 600,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
            tNpc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        nextId: 102
    },
    102: {
        title: "惩戒巡逻山贼",
        tips: "巡逻山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你被少女不讲武德的推到一群彪形大汉面前，刚要开口解释巡逻山贼便面露凶意朝你聚了过来!",
            "巡逻山贼：什么人，兄弟们杀了他!",
            "你：&......",
        ],
        done: [
            "你艰难的打倒了几个巡逻山贼，打斗的动静就引来了更多山贼，你二话不说，拔腿就跑。",
            "胡晶丽气喘吁吁的追了上来：你不是天选者嘛，怎么这么弱？",
            "你：天选者是什么？",
            "这时身后密密麻麻的山贼已经追了过来，狐晶丽吓得脸色一白：算了，我们先回村子再说。",
            "&仙隐村",
        ],
        reward: {
            exp: 700,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,1"
            },
        },
        complete: {
            freak: "2000-2"
        },
        nextId: 103
    },
    103: {
        title: "天选者",
        tips: "狐晶丽就在仙隐村(1,1)，快去找她了解天选者的传说吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "回到村子狐晶丽与你说起了天选者的来历。",
            "千年前人，仙，妖三族为了争夺馒头大战一场，而这其实是域外魔族的阴谋，趁着三族元气大伤时入侵大陆。",
            "三族为了抵御魔族便选择暂时联盟，不过域外魔族强者众多，三族先辈死伤近乎九成的强者才拼死将魔族封印。",
            "不过封印终有一天会被破开，皆是必然又是一场大战，传说只有天选者才能终结这一切，。",
            "你&：所以你觉得我是天选者？",
        ],
        done: [
            "狐晶丽：传说中天选者会从天而降，你就是从天上掉下来的。",
            "你：.....",
            "狐晶丽突然想起了什么拿着你朝村口的大树走去：对了，你跟我来。",
            "你&：去干什么？",
        ],
        reward: {
            exp: 800,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 104
    },
    104: {
        title: "全身武装",
        tips: "破旧宝箱就在仙隐村(1,1)，挑一个打开吧。",
        type: TASK_TYPE.biaoxiang,
        receive: [
            "只见狐晶丽在大树前灰头土脸的一顿乱挖，下面竟然埋了七八个破旧不堪的箱子",
            "你：这是装的啥？",
            "狐晶丽：当然是好东西了，不过时间久了，我也忘记是藏在那个箱子了。",
            "你&：......",
        ],
        done: [
            "你随便找了个宝箱打开，只见里面竟然海真有一堆宝贝。",
            "狐晶丽&：运气真不错。",
        ],
        action: {
            type: 1,
            text: '破旧宝箱'
        },
        reward: {
            exp: 900,
            article: '1630'
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        nextId: 105
    },
    105: {
        title: "惩戒持刀山贼",
        tips: "持刀山贼就在仙隐村(1,2)，赶紧过去惩戒他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你刚刚换上装备就见村外有几道手持大刀的山贼，显然是他们一路找过来。",
            "狐晶丽：不好，他们竟然这么快就找来了。",
            "你信心十足：&别怕，我去收拾他们。",
        ],
        done: [
            "持刀山贼完全不是你的对手，几个回合就被你打的落荒而逃。",
            "狐晶丽：你怎么把他们放走了。",
            "你：&有什么问题？",
        ],
        reward: {
            exp: 1000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "2001-2"
        },
        nextId: 106
    },
    106: {
        title: "击杀持斧山贼",
        tips: "持斧山贼就在仙隐村(1,3)，赶紧过去击杀他们。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：这些可是山贼，你把他们放了，他们肯定还会找人来。",
            "说完就见之前的山贼带着一群拿着斧头的山贼又找上门来。",
            "&迎战。",
        ],
        done: [
            "这次你听了狐晶丽的话，几个回合后，这群山贼全部被你击杀。",
            "不过最后一个山贼死前放出了一道烟花在天空炸开。",
            "狐晶丽：&不好，是信号弹!",
        ],
        reward: {
            exp: 1200,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "2002-2"
        },
        nextId: 107
    },
    107: {
        title: "突出重围",
        tips: "精英山贼就在仙隐村(1,3)，赶紧冲出重围吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "信号弹一出，你也意识到事情不妙，正准备带着狐晶丽离开，迎面而来的便是几个明显实力不凡的精英山贼。",
            "此时还有远远不断的山贼四面八方的朝村子聚拢。",
            "狐晶丽：完了，完了，被包围了。",
            "&杀出重围。",
        ],
        done: [
            "危机时刻你爆发出强大的力量，护着狐晶丽竟然硬生生的杀出了重围。",
            "狐晶丽重重的送了一口气：呼，终于逃出来了。",
            "你：还不能放松，那群山贼肯定还在找我们。",
            "狐晶丽：啊，那怎么办？",
            "你：&直捣黄龙。",
        ],
        reward: {
            exp: 1400,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,0"
            },
        },
        complete: {
            freak: "2003-2"
        },
        nextId: 108
    },
    108: {
        title: "偷袭二当家",
        tips: "二当家就在仙隐村(1,4)，趁机出手袭击他吧。",
        type: TASK_TYPE.zhandou,
        replace: true,
        receive: [
            "你带着狐晶丽一路悄悄的潜入了黑风寨，果然这里的防守弱了很多。",
            "一个身材魁梧脸上还一道刀疤的大汉正在大厅里正在威逼几个刚刚抓来的女子与他玩乐。",
            "狐晶丽立即小心提醒：这是黑风寨二当家，实力非常强。",
            "于是你决定：&袭击。",
        ],
        done: [
            "你不讲武德的偷袭非常顺利，二当家到死都没反应过来头颅便直接落地。",
            "狐晶丽：{name}，你太棒了。",
            "如此血腥一幕，吓得一众女子连声惊叫。",
            "你：&不好。",
        ],
        reward: {
            exp: 1600,
        },
        grand: {
            tpc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "2004-1"
        },
        nextId: 109
    },
    109: {
        title: "迎战大当家",
        tips: "大当家就在仙隐村(1,4)，赶紧出招迎战吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "果然这群女子的尖叫立即引来的黑风寨大当家。",
            "大当家举着一柄寒光凛凛的大刀朝你冲了过来：小子，给我死。",
            "&迎战大当家。",
        ],
        done: [
            "你与大当家大战了几个回合后终于将其斩杀，突然一道暗器从黑风寨外飞进来目标正是你。",
            "狐晶丽飞身一跃挡在你前面：小心暗器。",
            "你大惊连忙就追出去，可是偷袭之人不见踪影了。",
            "&查看狐晶丽伤势。",
        ],
        reward: {
            exp: 1800,
            tael: 50000
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "2005-1"
        },
        nextId: 1010
    },
    1010: {
        title: "暗器有毒",
        tips: "狐晶丽替你挡住了暗器，赶紧查看她的伤势吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "狐晶丽惨叫：屁股，我的屁股。",
            "你一看发现那暗器就扎在狐晶丽屁股上，此时已经是一片有些发黑的血。",
            "你脸色一变：&不好，这暗器有毒。",
        ],
        done: [
            "狐晶丽一脸惊慌：啊，那怎么办，我不会要死了吧，呜呜呜，我还没成亲呢。",
            "你：&放心，我不会让你有事的",
        ],
        reward: {
            exp: 2000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        nextId: 1011
    },
    1011: {
        title: "收集蛇胆",
        tips: "斑斓蛇就在仙隐村(1,5)，快去收集蛇胆压制毒性。",
        type: TASK_TYPE.shouji,
        receive: [
            "狐晶丽：我听说剧毒之物，七步之内必有解药，后山有一种名为斑斓蛇的妖兽，它的蛇胆肯定能解毒。",
            "你眼前一黑，这小狐狸怕不是被毒傻了。",
            "嘶嘶嘶！",
            "这时后山传来一阵细微的动静，正是一群毒蛇朝你们包围过来。",
            "你：&只能以毒攻毒试试了。",
        ],
        done: [
            "你将毒蛇驱散顺手还找了几颗蛇胆，递给已经是一脸苍白的狐晶丽。",
            "狐晶丽：你先出去等我。",
            "你正要问为什么，突然想起她的伤口部位，好像自己留在这里是有点不礼貌了。",
            "&继续",
        ],
        reward: {
            exp: 2500,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            article: "210-2"
        },
        nextId: 1012
    },
    1012: {
        title: "驱赶四眼老鹰",
        tips: "四眼老鹰就在仙隐村(1,5)，赶紧将它们击退吧。",
        type: TASK_TYPE.zhandou,
        replace: true,
        receive: [
            "走出大厅后你立即就察觉到头顶有一道道强烈的敌意。",
            "抬头看去，只见空中一群四只眼睛的老鹰似乎是被斑斓蛇胆吸引直接朝黑风寨大厅扑来。",
            "&驱赶四眼老鹰。",
        ],
        done: [
            "四眼老鹰极为难缠，不过在你击杀几只四眼老鹰后其余鹰群也都四散逃了。",
            "这时大厅内传来狐晶丽的声音：{name}，你快来看这是什么？",
            "只见狐晶丽脸色好了不少，手中正拿着一张看着有些破旧的羊皮卷。",
            "你：&你没事了？",
        ],
        reward: {
            exp: 3000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
        },
        complete: {
            freak: "2007-2"
        },
        nextId: 1013
    },
    1013: {
        title: "羊皮卷",
        tips: "刺客去而复返，赶紧迎战吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽摇了摇头：蛇胆暂时将毒压制了，你看这羊皮卷似乎是一张藏宝图。",
            "你见此才接过羊皮卷，看起来已经有些年代了，还没仔细看突然一道暗器再度袭来。",
            "你：&不好，之前的刺客还没走。",
        ],
        done: [
            "这次你将暗器成功挡下与那刺客直接战成一团，只是经过几场大战你消耗过多，几招后便落入了下风。",
            "眼下狐晶丽又中毒未痊愈，你决定：",
            "&三十六计，走为上策。",
        ],
        reward: {
            exp: 3500,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,3"
            },
            freak: [{
                id: 110,
                address: "10000,0,3"
            }],
        },
        nextId: 1014
    },
    1014: {
        title: "一路追杀",
        tips: "你与狐晶丽被追杀到了悬崖边上，没想到后者竟然拉着你跳崖了。",
        type: TASK_TYPE.duihau,
        receive: [
            "你与狐晶丽一路逃跑，不想竟然被逼到了后山悬崖。",
            "刺客：这下看你们往那跑！",
            "眼见退无可退你正决定拼命，突然狐晶丽拉着你直接就朝悬崖下跳去。",
            "&我靠！",
        ],
        done: [
            "想象中摔成肉泥的场景并没有出现，只见半空中狐晶丽吐出一颗白色妖丹，澎湃的妖力竟然减缓了下降的速度。",
            "不过这手段对于狐晶丽来说似乎很吃力，并就中毒未愈，此时脸色越发苍白。",
            "直到快落地时已经法力不支，你二人直接从就与地面来了一个亲密接触昏了过去。",
            "&悬崖之底。",
        ],
        reward: {
            exp: 4000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10000,0,4"
            },
        },
        nextId: 1015
    },
    1015: {
        title: "大泽谷",
        tips: "从昏迷中醒来，你发现自己正在一处山谷之中。",
        type: TASK_TYPE.duihau,
        receive: [
            "等你醒来发现正躺在一个小木屋中，房间内点着一抹淡淡的熏香甚是好闻。",
            "你起身走出房间才发现这是一个荒僻的山谷，山谷中除了几间简朴的木屋，便只有一鼎巨大的火炉与一张太师椅。",
            "此时太师椅上一个浑身肌肉的老头正闭目悠哉悠哉的躺着，见此你走上前去：",
            "&多谢前辈相救。",
        ],
        done: [
            "欧冶子点了点头：路过顺手而已。",
            "见此你随即又问道：前辈可还见到一名狐族少女。",
            "欧冶子：你认识那小狐狸啊，她就住你旁边那间。",
            "你连忙朝欧冶子所说的那间木屋处，站在窗外就能看到狐晶丽脸色苍白的躺在木床上，呼吸都感觉断断续续。",
            "这时躺在太师椅上的欧冶子突然开口道：小子，别看了，这小狐狸法力枯竭又身中剧毒活不了几天了。",
            "你顿时一惊：",
            "&前辈可有办法救救她？",
        ],
        reward: {
            exp: 5000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1016
    },
    1016: {
        title: "教训大地魔熊",
        tips: "教训大地魔熊就在大泽谷(1,1),狠狠的教训它们一顿。",
        type: TASK_TYPE.zhandou,
        receive: [
            "欧冶子叹了一口气：小子，这毒可不好解。",
            "你自是听出了这话的言外之意，不好解，也就是说可以解，只是不能白解。",
            "轻轻一笑，你便顺着老者的话道：晚辈承蒙前辈相救，不知晚辈有什么可以帮的上前辈的呢？",
            "欧冶子当即在太师椅上坐了起来，故作一脸怒气：你小子怎么说话的，难道老夫救人是为了报答不成。",
            "你微微一愣，难道自己猜错了。",
            "不过下一秒欧冶子就语锋一转：不过既然你是诚心的，老夫也不好拒绝，山谷附近有一群大地魔熊，你替我去收拾它们一顿吧。",
            "你嘴角一抽，随即道：&晚辈去去就来。",
        ],
        done: [
            "你回到山谷后，便见欧冶子大笑：哈哈，这群该死的畜生，终于可以消停了。",
            "不过很快欧冶子有脸露难色，似乎还有什么问题。",
            "&不知晚辈还什么忙可以帮上前辈呢？",
        ],
        reward: {
            exp: 6000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            freak: "2008-4"
        },
        nextId: 1017
    },
    1017: {
        title: "教训黑白魔熊",
        tips: "教训黑白魔熊就在大泽谷(1,2),狠狠的教训它们一顿。",
        type: TASK_TYPE.zhandou,
        receive: [
            "欧冶子：哎，这大地魔熊虽然赶走了，不过还有一群黑白魔熊也是一到晚上就鬼哭狼嚎的让人睡不着觉。",
            "你：&前辈稍等。",
        ],
        done: [
            "欧冶子：哈哈，总算是出了一口恶气，小子我现在就可以传授你毒丹之法。",
            "你：毒丹之法？",
            "欧冶子：你的同伴所中之毒乃是世间少有的奇毒：断魂散，唯有我这毒丹之法可解。",
            "&多谢前辈",
        ],
        reward: {
            exp: 7000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            freak: "2009-4"
        },
        nextId: 1018
    },
    1018: {
        title: "毒丹之法",
        tips: "快去大泽谷(2,1)找欧冶子了解凝聚毒丹之法的准备工作吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "欧冶子：这毒丹之法便是在中毒者体内凝聚一枚毒丹，将全部毒素汇入其中不仅可以解毒，战斗时还可催动毒丹杀敌。",
            "你点了点头：果然是妙法。",
            "欧冶子得意一笑：那是自然，这可使老夫的成名之法，不过在此之前你还需要准备一番。",
            "&前辈请说。",
        ],
        done: [
            "欧冶子：毒丹之法虽强，不过也有失败的风险，在大泽谷一种名为蛇蝎兰的花，此花剧毒无比，凡人碰之则死，却是可以提升凝聚毒丹概率。",
            "&那我该如何摘取呢？",
        ],
        reward: {
            exp: 8000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1019
    },
    1019: {
        title: "炼制辟毒丹",
        tips: "大泽毒蛙就在大泽谷(1,2),去收集它们身上的毒囊吧。",
        type: TASK_TYPE.shouji,
        receive: [
            "欧冶子：我可以替你炼制一枚辟毒丹，服用后短时间内任何毒素都无法对你造成伤害。",
            "说罢欧冶子话锋一转，轻咳两声：不过炼制此丹需要大泽毒蛙身上的毒囊。",
            "&我这就取来。",
        ],
        done: [
            "欧冶子接过毒囊，点了点头：没错，就是这玩意。",
            "随即欧冶子便在那鼎丹炉中炼起丹来，腾腾的火焰下飘来淡淡的丹香。",
            "&安静等待",
        ],
        reward: {
            exp: 9000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            article: "211-4"
        },
        nextId: 1020
    },
    1020: {
        title: "收集蛇蝎兰",
        tips: "大泽毒蝎就在大泽谷(1,2),击败后可掉落蛇蝎兰。",
        type: TASK_TYPE.shouji,
        receive: [
            "丹成，起炉！",
            "片刻之后欧冶子一声轻喝，一枚翠绿的丹药出炉，瞬间丹香四溢。",
            "欧冶子将辟毒丹朝你扔来：去吧，采集蛇蝎兰的时候小心那一代的大泽毒蝎。",
            "你点了点：&前辈放心。",
        ],
        done: [
            "采集到蛇蝎兰后，在欧冶子的指点下你成功使用毒丹之法在狐晶丽的体内凝聚出一枚毒丹。",
            "没多久狐晶丽便迷迷糊糊的醒了过来。",
            "&继续",
        ],
        reward: {
            exp: 10000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            article: "212-4"
        },
        nextId: 1021
    },
    1021: {
        title: "美味鱼汤",
        tips: "青鲤鱼就在大泽谷(1,3)，快去抓几条做鱼汤吧。",
        type: TASK_TYPE.zhandou,
        replace: true,
        receive: [
            "狐晶丽：{name}，我这是在什么地方？",
            "你：这里是大泽谷，坠崖后是欧冶子前辈救了我们。",
            "说罢你指了指屋外躺在太师椅上正悠闲晒着太阳的欧冶子。",
            "见狐晶丽还有些虚弱，你突然想起之前在大泽谷看到一处小溪里面似乎有鱼。",
            "&你先好好休息，我去弄个鱼汤。",
        ],
        done: [
            "小溪中的青鲤鱼极为灵活，你费了好大功夫终于是抓到了几条。",
            "山谷内很快就被一股鱼香弥漫，就连欧冶子也被吸引了过来。",
            "&继续",
        ],
        reward: {
            exp: 11000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,1,0"
            },
        },
        complete: {
            freak: "20012-5"
        },
        nextId: 1022
    },
    1022: {
        title: "偷鱼的贼",
        tips: "河藤葵就在大泽谷(1,3)，快去教训他们一顿吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "狐晶丽：你脚下有一条，你背后也有一条，哎呀，你怎么一条都没抓住。",
            "这天你依旧在河里抓青鲤鱼，狐晶丽则是在岸上呱呱叫。",
            "你听着狐晶丽在岸上一阵瞎指挥，若不是考虑到她是个病号你都想把她扔进里。",
            "这时狐晶丽突然竹篮怪叫一声：哎呀，我们抓的鱼不见了。",
            "你朝竹篮里看去果然抓到鱼一条都不见了，这时你才注意到几条藤蔓正裹着你的鱼悄悄逃去。",
            "&我去，敢偷我的鱼。",
        ],
        done: [
            "狠狠的教训了一顿这群偷鱼贼，不过抓的鱼却被它们偷吃完了。",
            "于是你只能去河里重新抓鱼，在狐晶丽的负面指挥下抓到下午太阳快落山了才回到大泽谷。",
            "&继续。",
        ],
        reward: {
            exp: 12000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,0,3"
            },
            tNpc: {
                id: 101,
                address: "10002,1,0"
            },
        },
        complete: {
            freak: "20013-5"
        },
        nextId: 1023
    },
    1023: {
        title: "羊皮卷",
        tips: "欧冶子似乎知道羊皮卷的秘密，快去和他聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "时间飞速流逝，这日你无聊的拿出当日在黑风寨中得到的羊皮卷研究起来，不过上面的一道道符文你压根看不明白。",
            "欧冶子略有兴致的看了你手中羊皮卷一眼：小子，你这藏宝图看起来有点年代了。",
            "你：&藏宝图？",
        ],
        done: [
            "欧冶子：嗯，不过藏宝图被动了手脚，必须破解才能知道具体的藏宝地点。",
            "你：&前辈知道如何破解？",
        ],
        reward: {
            exp: 13000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1024
    },
    1024: {
        title: "收集藏羚羊皮",
        tips: "藏羚羊就在大泽谷(1,4),击杀后有可掉落藏羚羊皮。",
        type: TASK_TYPE.shouji,
        receive: [
            "欧冶子：要破解倒也不难，你先去收集几张藏羚羊皮过来。",
            "&继续",
        ],
        done: [
            "你将藏羚羊皮交给欧冶子，片刻之后就见后者手中多出几张与黑风寨中一模一样的羊皮卷。",
            "你一脸惊讶：这是？",
            "欧冶子：怎么样，是不是很像，我现在已经知道这羊皮卷是如何制作的了？",
            "&那我们是不是可以破解了？",
        ],
        reward: {
            exp: 14000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            article: "213-4"
        },
        nextId: 1025
    },
    1025: {
        title: "真假羊皮卷",
        tips: "欧冶子不小心将羊皮卷混到了一起，快从里面找出真的羊皮卷吧。",
        type: TASK_TYPE.biaoxiang,
        receive: [
            "欧冶子：那是自然，不好！",
            "只见本来还一脸得意的欧冶子突然脸色一变惊呼了起来。",
            "你连忙问道：怎么了？",
            "欧冶子：刚刚顾着研究如何破解羊皮卷，我忘记那张才是真的了。",
            "你：....",
        ],
        done: [
            "恭喜你一选就中，快去找欧冶子了解如何破解羊皮卷吧。",
            "&继续",
        ],
        action: {
            type: 1,
            text: '羊皮卷',
            num: 6
        },
        reward: {
            exp: 15000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1026
    },
    1026: {
        title: "收集巨羊角",
        tips: "巨角羊就在大泽谷(1,4),击杀后有可掉落巨羊角。",
        type: TASK_TYPE.shouji,
        receive: [
            "欧冶子：这羊皮卷上被人施加了一道秘术，你去寻几个巨羊角过来。",
            "&好的。",
        ],
        done: [
            "欧冶子拿着巨羊角口中念了一道口诀就见那羊皮卷纹路竟然开始动了起来，最后竟然形成了一片无尽死海。",
            "只见大海之中无数骷髅生物似乎正在争抢着一个散发着紫气的馒头。",
            "&这是什么地方？",
        ],
        reward: {
            exp: 16000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        complete: {
            article: "214-4"
        },
        nextId: 1027
    },
    1027: {
        title: "传说中的馒头",
        tips: "羊皮卷上竟然记载了千年前那引发三族大战的馒头的下落。",
        type: TASK_TYPE.duihau,
        receive: [
            "欧冶子：藏宝图上的地方恐怕是无妄海，而这群骷髅生物在争夺的莫非是传说中的馒头。",
            "你顿时一惊：难道是传说中吃了就能让人拥有一统三族力量的馒头？",
            "欧冶子：当年三族大战死伤无数，这馒头却是不翼而飞，没想到竟然在会无妄海。",
            "&前辈知道无妄海在什么地方？",

        ],
        done: [
            "欧冶子：小家伙，你想去找无妄海这个馒头？",
            "你：没错。",
            "这时狐晶丽走了过来：馒头，啥馒头？",
            "你：&羊皮卷上记载了千年前引发三族大战的馒头的下落。",
        ],
        reward: {
            exp: 17000,
        },
        grand: {
            npc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1028
    },
    1028: {
        title: "欧冶子的打击",
        tips: "欧冶子或许有办法让你实力大增，快去找他聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "狐晶丽惊呼：什么！！！",
            "你点了点头：羊皮卷上记载这馒头就在无妄海之中。",
            "狐晶丽：那太好了，我们快去找馒头吧，到时候我们就可以天下无敌了。",
            "欧冶子：你俩这微末道行去无妄海送死吗？",
            "狐晶丽：......",
            "你：&......",
        ],
        done: [
            "你：那欧冶子前辈有什么办法让我们短时间内变强？",
            "狐晶丽连忙点头附和：嗯嗯嗯。",
            "欧冶子递过来一枚玉佩：我在云荒大陆有一个好友太白金星，你可以去找他。",
            "&前往云荒大陆",
        ],
        reward: {
            exp: 18000,
        },
        grand: {
            npc: {
                id: 101,
                address: "10002,1,0"
            },
            tNpc: {
                id: 105,
                address: "10002,1,0"
            },
        },
        nextId: 1029
    },
    1029: {
        title: "云荒大陆",
        tips: "你在云荒大陆遇到了一个老者，或许他知道太白金星的下落。",
        type: TASK_TYPE.duihau,
        receive: [
            "你来到云荒大陆看到一个鹤发童颜的老者在路边呆呆的发愣。",
            "你：前辈，请问你认识太白金星？",
            "太白金星：？？？",
            "你：&？？？",
        ],
        done: [
            "你感觉这个老人可能不会说话，便准备离开。",
            "太白金星：你找他做什么？",
            "你：你认识他？",
            "太白金星摇头：不认识！",
            "......",
        ],
        reward: {
            exp: 20000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,0"
            },
        },
        nextId: 1030
    },
    1030: {
        title: "超度孤魂",
        tips: "孤魂就在云荒大陆(1,1)，快去将它们超度吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "你转身就要离开，太白金星连忙就拉住你：不过，我知道他在哪里？",
            "你一愣：你都不认识他，怎么会知道他在什么地方？",
            "太白金星嘿嘿一笑：那你别管，附近有不少的孤魂,你先去帮超度了它们我就告诉你。",
            "你将信将疑：&行，等着。",
        ],
        done: [
            "太白金星：哟，身手不错嘛，这么快就回来了。",
            "你：说正事。",
            "太白金星：他就住在东边？",
            "你：&这就没了？",
        ],
        reward: {
            exp: 22000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,0"
            },
        },
        complete: {
            freak: "2040-8"
        },
        nextId: 1031
    },
    1031: {
        title: "超度野鬼",
        tips: "野鬼就在云荒大陆(1,1)，快去将它们超度吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "太白金星点头：没了。",
            "你：......",
            "太白金星嘻嘻一笑：如果你能帮我在去超度一下周围的野鬼，我可以带你去他家。",
            "你：&成交。",
        ],
        done: [
            "太白金星：跟我来吧。",
            "&继续",
        ],
        reward: {
            exp: 24000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,0"
            },
        },
        complete: {
            freak: "2041-8"
        },
        nextId: 1032
    },
    1032: {
        title: "树妖迷宫",
        tips: "你们竟然迷路了，太点找准方向走出去吧。",
        type: TASK_TYPE.migong,
        receive: [
            "你跟着太白金星走了片刻，突然后者又停了下来。",
            "你：怎么了？",
            "太白金星：我们好像迷路了。",
            "你：迷路？",
            "太白金星：看来只能碰碰运气了。",
        ],
        done: [
            "运气不错，你们总算找到了方向走出迷宫，不过你很快就注意到周围的树木似乎在移动。",
            "你：&这些树似乎不太对劲。",
        ],
        action: {
            type: 2,
            text: ['东', '南', '西', '北'],
            num: 2
        },
        reward: {
            exp: 26000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,1"
            },
        },
        nextId: 1033
    },
    1033: {
        title: "惩戒树妖",
        tips: "你们迷路原来是周围的树妖在搞鬼，快去教训它们一顿吧",
        type: TASK_TYPE.zhandou,
        receive: [
            "太白金星：我说怎么迷路了，原来是这群树妖在搞鬼。",
            "&收拾树妖",
        ],
        done: [
            "你几道法术将一众树妖打的狼狈逃走。",
            "太白金星：这群树妖经常捉弄路人，这次终于得到了教训。",
            "&继续赶路",
        ],
        reward: {
            exp: 28000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,1"
            },
        },
        complete: {
            freak: "2042-8"
        },
        nextId: 1034
    },
    1034: {
        title: "桑果解渴",
        tips: "桑树就在云荒大陆(1,2)，树上长了很多解渴的桑果。",
        type: TASK_TYPE.shouji,
        receive: [
            "没走多远，太白金星突然又停了下来。",
            "你：又迷路了？",
            "太白金星：没有，我今天在路边呆了一天有些口渴，你去弄点桑果解解渴。",
            "你：&......",
        ],
        done: [
            "吃完桑果后，太白金星：好了别浪费时间，我们快走吧，马上天要黑了。",
            "你当即脸一黑，谁浪费时间没点数？",
            "&继续",
        ],
        reward: {
            exp: 30000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,1"
            },
        },
        complete: {
            article: "215-6"
        },
        nextId: 1035
    },
    1035: {
        title: "到家了",
        tips: "原来老者就是太白金星，快去和他聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "很快你们来到一间简陋的木屋外，太白金星：终于到家了。",
            "你：到家？",
            "&难道你就是太白金星！！！",
        ],
        done: [
            "太白金星：是欧冶子那老家伙让你来的？",
            "你微微一愣：前辈怎么知道的？",
            "太白金星指了指你腰间的玉佩，你见到腰间欧冶子给你的玉佩这才恍然大悟。",
            "&原来如此。",
        ],
        reward: {
            exp: 33000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        nextId: 1036
    },
    1036: {
        title: "警告大耳猴",
        tips: "大耳猴就在云荒大陆(1,3)，为了秘密不被泄露先去警告它们一番吧。",
        type: TASK_TYPE.zhandou,
        receive: [
            "翌日，太白金星把你喊了过去：欧冶子那老家伙让你来找我是为了提升修为吧？",
            "你点了点头，将你要去无妄的事情说了出来。",
            "太白金星：原来如此，我确实可以帮你，不过此法乃是不传之秘，你先去警告周围的大耳猴一顿。",
            "&前往警告",
        ],
        done: [
            "太白金星满意的点头：这些猴子耳朵极灵，这方法可不能让它们听走了。",
            "你：&前辈请讲。",
        ],
        reward: {
            exp: 36000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        complete: {
            freak: "2044-8"
        },
        nextId: 1037
    },
    1037: {
        title: "教训皮皮猴",
        tips: "太白金星正要传授你方法，突然发现一群皮皮猴在窗外偷听。",
        type: TASK_TYPE.zhandou,
        receive: [
            "太白金星：此法便是将人放入丹炉中淬炼，激发体内潜力。",
            "你顿时嘴角一抽：前辈没开玩笑吧？",
            "突然太白金星看着木屋外道：你先去把它们赶走。",
            "只见一群皮皮猴正躲在窗外悄摸摸的偷听。",
            "&教训皮皮猴",
        ],
        done: [
            "太白金星：这皮皮猴可是出了名的大嘴巴，若是丹炉淬体之法被让它们听走了第二天就会传遍云荒大陆。",
            "你：&丹炉淬炼真的可以激发潜力？",
        ],
        reward: {
            exp: 39000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        complete: {
            freak: "2045-8"
        },
        nextId: 1038
    },
    1038: {
        title: "收集赤炎蛛腿",
        tips: "赤炎蜘蛛身上会掉落赤炎蛛腿，快去收集回来吧。",
        type: TASK_TYPE.shouji,
        receive: [
            "太白金星：寻常丹炉淬体自然没用，不过老夫研究的可不一样，不过需要大量的材料。",
            "你：不知需要什么材料？",
            "太白金星：其他的都有了，目前还差赤炎蛛腿和灵异水，前者击杀赤炎蜘蛛后可以掉落。",
            "&收集赤炎蛛腿",
        ],
        done: [
            "你回到木屋后就看到太白金星已经架起了一尊巨大的炉鼎。",
            "&前辈我回来了。",
        ],
        reward: {
            exp: 42000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        complete: {
            article: "216-6"
        },
        nextId: 1039
    },
    1039: {
        title: "收集灵异水",
        tips: "灵异小妖身上会携带了很多灵异水，快去弄点回来吧。",
        type: TASK_TYPE.shouji,
        receive: [
            "太白金星：灵异水的下落我已经打听到了，灵异小妖身上就有这东西。",
            "&收集灵异水",
        ],
        done: [
            "你将赤炎蛛腿和灵异水都交给太白金星后，便见他全部扔进了炉鼎之中。",
            "太白金星：你可以进入了。",
            "看着沸腾的炉鼎，你咽了咽口水一咬牙直接跳入炉鼎之中。",
            "&继续",
        ],
        reward: {
            exp: 45000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        complete: {
            article: "216-6"
        },
        nextId: 1040
    },
    1040: {
        title: "淬体洗髓",
        tips: "太白金星在为你淬体洗髓，赶紧抓紧吸收吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "跳入炉鼎中并没鱼想想中的滚烫，反倒是一股澎湃的灵气疯狂朝你身体涌进入。",
            "太白金星：小家伙，抓紧吸收灵气，这是在替你淬体洗髓。",
            "&全力吸收",
        ],
        done: [
            "灵气进入身体你只觉得周身穴位大开，气血翻腾，浑身上下都在以极为恐怖的速度蜕变。",
            "&继续",
        ],
        reward: {
            exp: 48000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
        },
        nextId: 1041
    },
    1041: {
        title: "回大泽谷",
        tips: "淬体洗髓结束，快回大泽谷找狐晶丽前往无妄海吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "淬体洗髓结束后，你从炉鼎中走浑身上下都散发着强者的气息。",
            "太白金星满意的点了的头：果然潜力非凡，以你如今的修为世间已少有敌手了，可以回去大泽谷了。",
            "你拱手谢道：&多谢前辈，晚辈告辞了。",
        ],
        done: [
            "狐晶丽，我回来了！！！",
            "刚回到山谷外，你就迫不及待的朝谷内跑去，嘴里一边还兴奋的喊道。",
            "躺在太师椅上被无视的欧冶子当即气呼呼道：臭小子，别喊了，你看不到老头子我嘛？",
            "你姗姗一笑，随即问道：&欧冶子前辈，狐晶丽呢？",
        ],
        reward: {
            exp: 50000,
        },
        grand: {
            npc: {
                id: 102,
                address: "40000,0,3"
            },
            tNpc: {
                id: 105,
                address: "10002,2,1"
            }
        },
        nextId: 1042
    },
    1042: {
        title: "前往无妄海",
        tips: "狐晶丽已经前往在无妄海(1,1)，快去找她聊聊吧。",
        type: TASK_TYPE.duihau,
        receive: [
            "欧冶子：那小丫头已经先一步去无妄海打探消息了，你既然回来了就快去无妄海找她吧。",
            "&前往无妄海",
        ],
        done: [
            "你来到无妄海远远就见到一片漆黑的大海，海面上无数恐怖的生物。",
            "此时无妄海岸边还聚集无数的修士，你眉头一皱，心想这里莫非发生了什么大事。",
            "不过你还是决定先找到狐晶丽。",
            "&继续",
        ],
        reward: {
            exp: 55000,
        },
        grand: {
            npc: {
                id: 101,
                address: "40001,0,0"
            }
        },
        nextId: 1043
    },
}


module.exports = {
    ...taskMap
}
